[
  {
    "id": "1753759354534-laz1fcxr9",
    "date": "2025-07-29",
    "actor": "Ghislaine Maxwell",
    "category": "Legal Proceedings",
    "title": "MSN",
    "description": "Political article from www.msn.com",
    "source_url": "https://www.msn.com/en-us/news/politics/ghislaine-maxwell-makes-pitch-to-supreme-court/ar-AA1Js7L1?ocid=hpmsn&cvid=f3e6010c24704377be9bf411d29aed39&ei=10",
    "verified": true,
    "severity": "medium",
    "added_at": "2025-07-29T03:22:34.534Z",
    "manual_submission": true,
    "submitted_by": "admin",
    "processed_at": "2025-07-29T03:22:34.534Z"
  },
  {
    "date": "2025-07-28",
    "actor": "Department of Education",
    "category": "Budget and Operational Changes",
    "title": "HHS and the Department of Education Significantly Reduce Their Workforce",
    "description": "The Department of Education, along with the Department of Health and Human Services, has significantly reduced its workforce. Specific details on the number of employees affected and the departments impacted are not provided in the available sources.",
    "source_url": "https://www.social-current.org/2025/07/july-28-federal-update-hhs-and-the-department-of-education-significantly-reduce-their-workforce/",
    "verified": false,
    "severity": "high",
    "id": "mdn7e9dt4cs08gxohh",
    "added_at": "2025-07-28T14:28:45.185Z"
  },
  {
    "date": "2025-07-26",
    "actor": "Alina Habba",
    "category": "Government Oversight",
    "title": "Trump Administration Retains Alina Habba as New Jersey\\'s Top Federal Prosecutor",
    "description": "President Trump acted to retain his former defense attorney, Alina Habba, as the top federal prosecutor in New Jersey, bypassing a judicial panel’s refusal to extend her tenure. This decision resolves a potential conflict between the Trump administration and federal judges over her appointment.",
    "source_url": "https://apnews.com/article/93dfa4de0a68b15a659ef5272e6b193d",
    "verified": true,
    "severity": "medium",
    "id": "mdn7e7tdlbxad6q0jdf",
    "added_at": "2025-07-28T14:28:43.153Z"
  },
  {
    "date": "2025-07-25",
    "actor": "Department of Education",
    "category": "Budget and Operational Changes",
    "title": "Update on FY25 Funding Freeze",
    "description": "The Department of Education announced the release of the remaining $4.9 billion in K-12 funds, ending a previous freeze on over $6 billion in federal education funding. The funds, which had been withheld due to a review process, are now being distributed to support essential services and supports to students for the 2025-26 school year.",
    "source_url": "https://www.aesa.us/2025/07/25/update-on-fy25-funding-freeze/",
    "verified": false,
    "severity": "medium",
    "id": "mdn7e9dtqrgc4b7s34",
    "added_at": "2025-07-28T14:28:45.185Z"
  },
  {
    "date": "2025-07-25",
    "actor": "U.S. Supreme Court",
    "category": "Legal Proceedings",
    "title": "Supreme Court Unanimously Nullifies Impeachment Complaint Against Vice President Duterte",
    "description": "The Supreme Court unanimously nullified the impeachment complaint against Vice President Sara Duterte, ruling it unconstitutional. The Court stated that the \\'one year-bar rule\\' was already covered by previous impeachment cases, rendering the fourth complaint invalid. Consequently, no trial before the Senate will be held, as the chamber cannot acquire jurisdiction per the court ruling.",
    "source_url": "https://en.wikipedia.org/wiki/Impeachment_of_Sara_Duterte",
    "verified": false,
    "severity": "low",
    "id": "mdlrr707h2jc4zyfd58",
    "added_at": "2025-07-27T14:23:08.599Z"
  },
  {
    "date": "2025-07-25",
    "actor": "Department of Education",
    "category": "Budget and Operational Changes",
    "title": "Trump administration to release over $5 billion school funding that it withheld",
    "description": "The Department of Education announced the release of over $5 billion in previously withheld school funding, ending a freeze initiated on July 1 as part of a review into whether the funds aligned with White House priorities. The freeze affected over $6 billion in funding critical for various educational programs, drawing widespread criticism from educators and lawmakers. The Office of Management and Budget has completed its review, and funds will begin reaching states next week.",
    "source_url": "https://www.reuters.com/legal/government/trump-administration-release-over-5-billion-school-funding-that-it-withheld-2025-07-25/",
    "verified": true,
    "severity": "medium",
    "id": "mdkccdsc9hs8y4koni",
    "added_at": "2025-07-26T14:23:57.132Z",
    "archived": true,
    "archived_at": "2025-07-27T04:04:01.594Z"
  },
  {
    "date": "2025-07-25",
    "actor": "Department of Education",
    "category": "Policy Implementation Changes",
    "title": "Trump administration to release billions in frozen education funds",
    "description": "The Trump administration announced the release of more than $5 billion in previously frozen federal education funds, following bipartisan pressure, including public appeals from Republican senators. The funds, part of nearly $7 billion approved by Congress, were reviewed by the White House Office of Management and Budget, which approved the release of funds related to various educational programs. Education Secretary Linda McMahon attributed the delays to the transition between administrations and the extended review process.",
    "source_url": "https://www.axios.com/2025/07/25/education-funds-released-trump-admin",
    "verified": true,
    "severity": "medium",
    "id": "mdkccdscz6lu13nl12p",
    "added_at": "2025-07-26T14:23:57.132Z"
  },
  {
    "date": "2025-07-25",
    "actor": "Department of Education",
    "category": "Policy Implementation Changes",
    "title": "Education Department says it will release billions in remaining withheld grant money for schools",
    "description": "The U.S. Education Department announced it will release billions in previously withheld federal school grants, ending a freeze initiated by the Trump administration on July 1 as part of a review into whether the funds aligned with White House priorities. The freeze affected over $6 billion in funding critical for various educational programs, drawing widespread criticism from educators and lawmakers. The Office of Management and Budget has completed its review, and funds will begin reaching states next week.",
    "source_url": "https://apnews.com/article/f9ac79dd44595fc9d8a3c72609cb5574",
    "verified": true,
    "severity": "medium",
    "id": "mdkccdsc8ec419twd1",
    "added_at": "2025-07-26T14:23:57.132Z"
  },
  {
    "date": "2025-07-25",
    "actor": "President Donald Trump",
    "category": "Policy",
    "title": "Trump suggests Fed may be ready to lower interest rates",
    "description": "On July 25, 2025, President Trump stated that following a meeting with Federal Reserve Chair Jerome Powell, he believed the Fed might soon be ready to lower interest rates. The meeting took place during Trump\\'s rare visit to the central bank\\'s Washington headquarters, which is undergoing renovations—a project criticized by the White House for its expenses. Although Powell emphasized that the Fed needs more data before making any rate adjustments, Trump interpreted their conversation as a signal for potential rate cuts. The Fed is expected to maintain the benchmark interest rate at its current 4.25%-4.50% range during its upcoming policy meeting. Despite past tensions, including Trump calling Powell a \\\"numbskull,\\\" the president confirmed he does not plan to dismiss him. The Fed, in turn, acknowledged Trump\\'s support for completing the renovation project. The interaction highlights ongoing White House pressure on the central bank to ease borrowing costs.",
    "source_url": "https://www.reuters.com/world/us/trump-suggests-fed-may-be-ready-lower-interest-rates-2025-07-25/",
    "verified": true,
    "severity": "medium",
    "id": "mdkccaiqpvbwsudyq2",
    "added_at": "2025-07-26T14:23:52.898Z"
  },
  {
    "date": "2025-07-25",
    "actor": "U.S. Supreme Court",
    "category": "Legal Proceedings",
    "title": "Supreme Court Gains Confidence Amid Power Concerns",
    "description": "A recent AP-NORC poll indicates that public confidence in the U.S. Supreme Court is on the rise, with 67% of Americans expressing at least some trust in the institution. This rebound in confidence occurs even as concerns grow about the Court wielding too much power, a sentiment that varies sharply along political lines. The Court, currently with a 6-3 conservative majority, has made several major rulings favoring conservative causes, fueling the perception of partisanship.",
    "source_url": "https://www.axios.com/2025/07/25/supreme-court-confidence-power-concerns-increase",
    "verified": true,
    "severity": "low",
    "id": "mdkcca3medq336rb5p",
    "added_at": "2025-07-26T14:23:52.354Z"
  },
  {
    "date": "2025-07-25",
    "actor": "Elon Musk\\'s Boring Company",
    "category": "Infrastructure Development",
    "title": "Boring Company Unveils Nashville Tunnel Project",
    "description": "Elon Musk\\'s Boring Company, in collaboration with Tennessee state officials, is set to unveil a new underground tunnel project in Nashville. The tunnel aims to connect downtown to the airport via Murfreesboro Pike, designed for Tesla vehicles to taxi passengers, addressing the city\\'s transportation challenges.",
    "source_url": "https://www.axios.com/local/nashville/2025/07/25/elon-musks-boring-company-to-unveil-tunnel-project-in-nashville",
    "verified": true,
    "severity": "medium",
    "id": "mdkcc9cgg5gwkui2w1m",
    "added_at": "2025-07-26T14:23:51.376Z",
    "archived": true,
    "archived_at": "2025-07-27T01:10:05.603Z"
  },
  {
    "date": "2025-07-25",
    "actor": "Tesla Shareholders",
    "category": "Corporate Governance",
    "title": "Shareholders Propose Investment in Elon Musk\\'s xAI",
    "description": "Tesla has received multiple shareholder proposals concerning a potential investment in xAI, an artificial intelligence startup founded by CEO Elon Musk. Despite Musk ruling out a merger, he proposed a shareholder vote on a possible investment by Tesla in the startup, which has seen significant funding activity this year.",
    "source_url": "https://www.reuters.com/business/autos-transportation/tesla-gets-multiple-shareholder-proposals-related-investment-xai-2025-07-25/",
    "verified": true,
    "severity": "low",
    "id": "mdkcc9cgmy0rcdgj4eq",
    "added_at": "2025-07-26T14:23:51.376Z"
  },
  {
    "date": "2025-07-25",
    "actor": "President Donald Trump",
    "category": "Political Support",
    "title": "Trump Expresses Support for Musk\\'s Tesla Amid Stock Decline",
    "description": "President Donald Trump publicly expressed support for Elon Musk’s Tesla via a Truth Social post, emphasizing his desire for all U.S. businesses, including Musk’s, to thrive. This comes amid Tesla stock plunging 8.2% following a disappointing quarterly report.",
    "source_url": "https://apnews.com/article/6739cb3c1777db5adf51ab8a39bfa226",
    "verified": true,
    "severity": "low",
    "id": "mdkcc9cgkmcdk2nfi9j",
    "added_at": "2025-07-26T14:23:51.376Z"
  },
  {
    "date": "2025-07-24",
    "actor": "Donald Trump",
    "category": "Legal",
    "title": "Trump Sues Wall Street Journal Over Epstein Allegation",
    "description": "Former President Trump filed a libel lawsuit against Rupert Murdoch, Dow Jones, and two Wall Street Journal reporters in response to a report suggesting he contributed a lewd illustration to Jeffrey Epstein\\'s 50th birthday album, intensifying scrutiny over his past ties to Epstein.",
    "source_url": "https://usanews.com/newsroom/july-18-2025-trump-led-push-sparks-tumult-in-politics-economy-courts-and-media",
    "verified": false,
    "severity": "medium",
    "id": "mdlrrbdf2ytzh68m3jc",
    "added_at": "2025-07-27T14:23:14.259Z"
  },
  {
    "date": "2025-07-24",
    "actor": "Donald Trump",
    "category": "Legal",
    "title": "Supreme Court Allows Trump to Remove Consumer Product Safety Regulators",
    "description": "The Supreme Court cleared the way for President Trump to remove Democratic members of the Consumer Product Safety Commission, enabling the administration to continue reshaping the federal bureaucracy amid ongoing litigation.",
    "source_url": "https://stateandfed.com/campaign-finance/news-you-can-use-digest-july-25-2025/",
    "verified": false,
    "severity": "medium",
    "id": "mdlrrbdfvh35fnfud7e",
    "added_at": "2025-07-27T14:23:14.259Z"
  },
  {
    "date": "2025-07-24",
    "actor": "U.S. Department of Justice (DOJ)",
    "category": "Corporate Ethics",
    "title": "DOJ Uncovers Bribery Scheme Involving USAID Contracting Officer",
    "description": "The DOJ revealed a bribery scheme where a USAID contracting officer accepted over $1 million in bribes from contractors. In exchange, the officer steered more than $550 million in government contracts to these parties, undermining the competitive procurement process and the integrity of the 8(a) Program.",
    "source_url": "https://thecgp.org/2025/07/17/friday-flash-07-18-2025/",
    "verified": false,
    "severity": "high",
    "id": "mdlrr5xl2u7xjakvsvj",
    "added_at": "2025-07-27T14:23:07.209Z"
  },
  {
    "date": "2025-07-24",
    "actor": "President Donald Trump",
    "category": "Policy",
    "title": "Trump to visit Fed on Thursday, ramping up pressure on Powell",
    "description": "U.S. President Donald Trump is set to visit the Federal Reserve on Thursday, a rare and controversial move that intensifies pressure on Fed Chair Jerome Powell. Trump, who originally nominated Powell but later became a vocal critic, has pushed for aggressive interest rate cuts and recently called Powell a \\\"numbskull.\\\" The visit follows allegations from the White House of mismanagement and potential fraud in the Fed\\'s renovation of historic buildings, with a projected $700 million cost overrun. The White House confirmed the visit but did not clarify if Trump will meet Powell. The trip is seen by analysts as an intimidation tactic, especially given Trump\\'s recent criticisms and demands for drastic rate cuts to 1%, far below Fed projections. Treasury Secretary Scott Bessent stated that no immediate move to replace Powell is planned, though a successor may be announced by early next year. Trump\\'s pressure campaign has reignited concerns over threats to central bank independence. Former Fed Chairs Bernanke and Yellen warned that Trump\\'s posture could cause lasting economic damage by undermining the Fed’s credibility. The Fed is expected to maintain current rates at its next meeting, with possible cuts anticipated in September.",
    "source_url": "https://www.reuters.com/world/us/trump-visit-fed-thursday-ramping-up-pressure-powell-2025-07-24/",
    "verified": true,
    "severity": "medium",
    "id": "mdkccaiq1oeduwgnkuu",
    "added_at": "2025-07-26T14:23:52.898Z"
  },
  {
    "date": "2025-07-24",
    "actor": "President Donald Trump",
    "category": "Policy",
    "title": "The Latest: Interest rates are central to Trump’s continuing feud with Fed chair Powell",
    "description": "President Donald Trump visited the Federal Reserve headquarters in Washington on Thursday, where he publicly scorned Fed chairman Jerome Powell over the costs of a long-planned, roughly $2. ... . Trump has previously indicated that Powell\\'s ...  \\\"fireable offense,\\\" Trump said, \\\"I don\\'t want to put this ... .\\\" Trump has criticized and threatened to fire ... .",
    "source_url": "https://apnews.com/article/3fd52eaf477ca409e5cef09fc16fbfc9",
    "verified": true,
    "severity": "medium",
    "id": "mdkccaiqphlvi0km54k",
    "added_at": "2025-07-26T14:23:52.898Z"
  },
  {
    "date": "2025-07-24",
    "actor": "U.S. Securities and Exchange Commission (SEC)",
    "category": "Corporate Ethics",
    "title": "SEC Withdraws Defense of Climate Disclosure Rules Amid Legal Challenges",
    "description": "The SEC voted to end its defense of the 2024 climate-related disclosure rules, marking a significant shift in the agency\\'s stance on environmental reporting requirements. This decision comes amid ongoing legal challenges and reflects a broader deregulatory trend in the current administration. The withdrawal has raised concerns among environmental advocates about the future of climate-related disclosures and their impact on corporate transparency.",
    "source_url": "https://www.pulsora.com/blog/esg-regulations-and-framework-updates-q2-2025",
    "verified": false,
    "severity": "medium",
    "id": "mdkcc92axx57abyvjim",
    "added_at": "2025-07-26T14:23:51.010Z"
  },
  {
    "date": "2025-07-24",
    "actor": "Elon Musk",
    "category": "Government Relations",
    "title": "Musk Ordered Starlink Shutdown During Ukrainian Counteroffensive",
    "description": "In late September 2022, Elon Musk ordered a Starlink satellite service shutdown in key areas of Ukraine during a critical counteroffensive against Russian forces. The decision led to a sudden communications blackout, disrupting Ukrainian military operations. Musk cited concerns over provoking a Russian nuclear response as the reason for the shutdown.",
    "source_url": "https://www.reuters.com/investigations/musk-ordered-shutdown-starlink-satellite-service-ukraine-retook-territory-russia-2025-07-25/",
    "verified": true,
    "severity": "high",
    "id": "mdiwz1rlno0h50yfzrq",
    "added_at": "2025-07-25T14:25:54.609Z"
  },
  {
    "date": "2025-07-24",
    "actor": "Department of Justice",
    "category": "Government Oversight",
    "title": "DOJ Sues New York City Over Sanctuary Policies",
    "description": "The DOJ filed a lawsuit against New York City, alleging that its sanctuary policies obstruct federal immigration enforcement and violate the Constitution\\'s Supremacy Clause. The suit follows a recent incident where undocumented migrants shot a customs officer during a robbery in Manhattan.",
    "source_url": "https://apnews.com/article/522887bf4e05a927c7898312f1d8c129",
    "verified": true,
    "severity": "high",
    "id": "mdiwz0pshs8ew8vs8s4",
    "added_at": "2025-07-25T14:25:53.248Z"
  },
  {
    "date": "2025-07-24",
    "actor": "House Oversight Committee",
    "category": "Government Oversight",
    "title": "House Panel Subpoenas Epstein Files",
    "description": "The House Oversight Committee voted 8-2 to subpoena the DOJ for files related to Jeffrey Epstein’s sex trafficking investigation, seeking transparency and accountability. The subpoena includes documents and testimony from key figures, including Ghislaine Maxwell and former attorneys general under Donald Trump.",
    "source_url": "https://time.com/7305200/epstein-files-trump-house-subpoena/",
    "verified": false,
    "severity": "medium",
    "id": "mdiwz0ps88qvkl0ablq",
    "added_at": "2025-07-25T14:25:53.248Z"
  },
  {
    "date": "2025-07-24",
    "actor": "U.S. Supreme Court",
    "category": "Legal Proceedings",
    "title": "Supreme Court Blocks North Dakota Redistricting Ruling Threatening Voting Rights Act",
    "description": "The Supreme Court temporarily halted a lower court\\'s decision in a North Dakota redistricting case that could have weakened a key provision of the Voting Rights Act. This decision preserves the current enforcement mechanisms for challenging discriminatory voting laws.",
    "source_url": "https://apnews.com/article/289e84539fcb2b309c8d00fb6a077097",
    "verified": true,
    "severity": "high",
    "id": "mdiwz0oivzq3f9b2u2",
    "added_at": "2025-07-25T14:25:53.202Z"
  },
  {
    "date": "2025-07-24",
    "actor": "U.S. Supreme Court",
    "category": "Legal Proceedings",
    "title": "Supreme Court Temporarily Pauses Rollbacks to Voting Rights Act",
    "description": "The Supreme Court issued a temporary pause on a lower court ruling that would have weakened the Voting Rights Act, providing a short-term victory to Native American groups challenging North Dakota\\'s redistricting plan.",
    "source_url": "https://www.axios.com/2025/07/24/supreme-court-voting-rights-act-ruling-north-dakota",
    "verified": true,
    "severity": "high",
    "id": "mdiwz0oija0ukibsvai",
    "added_at": "2025-07-25T14:25:53.202Z"
  },
  {
    "date": "2025-07-24",
    "actor": "Glass Lewis",
    "category": "Corporate Ethics",
    "title": "Glass Lewis Sues Texas Over ESG and DEI Restrictions on Proxy Advisers",
    "description": "Glass Lewis, a prominent proxy advisory firm, filed a lawsuit against Texas over a new law set to take effect on September 1, 2025, which restricts proxy advisers from making recommendations based on non-financial factors such as environmental, social governance (ESG), and diversity, equity, and inclusion (DEI) initiatives. The law mandates that advisers provide financial analysis to back any such recommendation. Glass Lewis argues this violates its First Amendment rights, calling the law \\'blatantly unconstitutional\\' and harmful to its business and clients.",
    "source_url": "https://www.ft.com/content/35ea9ff1-fed5-4e36-b444-b66ad9b56aec",
    "verified": true,
    "severity": "high",
    "id": "mdiwyzso4kuu9kic4ur",
    "added_at": "2025-07-25T14:25:52.056Z"
  },
  {
    "date": "2025-07-24",
    "actor": "President Donald Trump",
    "category": "Government Efficiency",
    "title": "Trump expresses support for Musk\\'s companies amid tensions",
    "description": "President Trump publicly stated his support for Elon Musk and his companies, denying claims that he intends to dismantle federal subsidies provided to them. This came after Musk warned Tesla investors about potential financial instability if federal support for electric vehicle manufacturers is reduced.",
    "source_url": "https://www.reuters.com/business/autos-transportation/trump-says-he-wants-musk-his-companies-thrive-us-2025-07-24/",
    "verified": true,
    "severity": "low",
    "id": "mdhhlz25yebgn89dh09",
    "added_at": "2025-07-24T14:28:04.157Z",
    "modified_at": "2025-07-27T01:11:20.956Z"
  },
  {
    "date": "2025-07-24",
    "actor": "U.S. District Court for the Northern District of California",
    "category": "Legal Proceedings",
    "title": "Federal Judge Dismisses Lawsuit Against Union Contracts",
    "description": "A Texas federal judge dismissed a lawsuit by eight federal agencies seeking to cancel union contracts, ruling that the agencies lacked legal standing to proceed.",
    "source_url": "https://www.reuters.com/legal/government/us-judge-tosses-trump-administration-bid-cancel-union-contracts-2025-07-24/",
    "verified": true,
    "severity": "medium",
    "id": "mdhhly0gwnx2kaeo6v",
    "added_at": "2025-07-24T14:28:02.800Z"
  },
  {
    "date": "2025-07-24",
    "actor": "U.S. Supreme Court",
    "category": "Legal Proceedings",
    "title": "Supreme Court\\'s 2024 Term Influences Business Litigation Strategies",
    "description": "The Supreme Court\\'s 2024 Term revealed shifts in administrative law, affecting business litigation strategies, particularly concerning agency deference and the major questions doctrine.",
    "source_url": "https://www.reuters.com/legal/legalindustry/supreme-court-2024-term-reveals-unanticipated-insights-agency-deference-2025-07-24/",
    "verified": true,
    "severity": "medium",
    "id": "mdhhly0g6s2qek2k5qx",
    "added_at": "2025-07-24T14:28:02.800Z"
  },
  {
    "date": "2025-07-24",
    "actor": "Geoffrey Giglio",
    "category": "Government Oversight",
    "title": "Trump Supporter Charged with Threatening U.S. Lawmaker",
    "description": "Geoffrey Giglio, a supporter of former President Donald Trump, was arrested and charged with threatening U.S. Representative Eric Swalwell and making harassing communications. The charges stem from violent messages referencing firearms and explicit threats against Swalwell and his wife. The White House condemned the threats, emphasizing that such behavior will be prosecuted.",
    "source_url": "https://www.reuters.com/world/us/trump-supporter-charged-with-making-threats-against-us-lawmaker-2025-07-24/",
    "verified": true,
    "severity": "high",
    "id": "mdhhlxvnf9dkxdkd4r",
    "added_at": "2025-07-24T14:28:02.627Z"
  },
  {
    "date": "2025-07-23",
    "actor": "Alina Habba",
    "category": "Government Oversight",
    "title": "Alina Habba Appointed Acting U.S. Attorney for New Jersey",
    "description": "Alina Habba, former personal lawyer to President Trump, was appointed as Acting U.S. Attorney for New Jersey. This move followed the withdrawal of her nomination for the permanent position, allowing her to serve in an acting capacity for the next 210 days.",
    "source_url": "https://www.justsecurity.org/117831/early-edition-july-25-2025/",
    "verified": false,
    "severity": "medium",
    "id": "mdlrr718nysl2bient",
    "added_at": "2025-07-27T14:23:08.636Z"
  },
  {
    "date": "2025-07-23",
    "actor": "FBI",
    "category": "Government Oversight",
    "title": "FBI Whistleblower Alleges Improper Suspension of Security Clearances",
    "description": "An FBI whistleblower alleged that the bureau improperly suspended security clearances for agents with \\'conservative views.\\' The complaint suggests that the FBI\\'s Security Division used the clearance process to force employees out, causing financial distress and retaliation against those who attempted to stop the abuse.",
    "source_url": "https://www.foxnews.com/politics/fbi-whistleblower-alleges-bureau-improperly-suspended-security-clearance-agents-conservative-views",
    "verified": true,
    "severity": "high",
    "id": "mdlrr718dgj5y8tdx49",
    "added_at": "2025-07-27T14:23:08.636Z"
  },
  {
    "date": "2025-07-23",
    "actor": "House Oversight Committee",
    "category": "Government Oversight",
    "title": "House Committee Votes to Subpoena Epstein Files from DOJ",
    "description": "The House Oversight Committee voted 8-2 to subpoena the Department of Justice for all files related to Jeffrey Epstein\\'s sex trafficking investigation, reflecting bipartisan pressure for transparency in the case.",
    "source_url": "https://apnews.com/article/216bfdadff5877673d80c7fea09aa520",
    "verified": true,
    "severity": "medium",
    "id": "mdkccak1asc289gcm2i",
    "added_at": "2025-07-26T14:23:52.945Z"
  },
  {
    "date": "2025-07-23",
    "actor": "Ghislaine Maxwell",
    "category": "Government Oversight",
    "title": "Ghislaine Maxwell Completes DOJ Interview on Epstein Case",
    "description": "Ghislaine Maxwell underwent a 1.5-day interview with the DOJ, addressing inquiries about 100 individuals related to the Jeffrey Epstein sex abuse case, as the investigation continues to unfold.",
    "source_url": "https://apnews.com/article/88fd99b7aff4b7b38afcb264fa26d502",
    "verified": true,
    "severity": "medium",
    "id": "mdkccak134pwt2c5dkl",
    "added_at": "2025-07-26T14:23:52.945Z"
  },
  {
    "date": "2025-07-23",
    "actor": "FBI Whistleblower",
    "category": "Government Oversight",
    "title": "FBI Whistleblower Alleges Retaliation Over January 6 Cases",
    "description": "An FBI whistleblower filed a class-action lawsuit against the DOJ, alleging retaliation for their involvement in investigating January 6 cases, highlighting concerns over political interference within the bureau.",
    "source_url": "https://www.washingtontimes.com/news/2025/feb/4/fbi-agents-file-class-action-lawsuit-justice-dept-/",
    "verified": false,
    "severity": "high",
    "id": "mdkccak19hgo1lzsr6e",
    "added_at": "2025-07-26T14:23:52.945Z"
  },
  {
    "date": "2025-07-23",
    "actor": "U.S. Department of Justice (DOJ)",
    "category": "Corporate Ethics",
    "title": "DOJ Resumes FCPA Enforcement with New Guidelines Amid Deregulatory Shift",
    "description": "The DOJ announced the resumption of enforcement under the Foreign Corrupt Practices Act (FCPA), signaling a return to anti-bribery enforcement after a period of reduced activity. The new guidelines focus on the \\'vindication of US interests\\' and outline specific factors for initiating investigations, including the impact on US entities and national security concerns. This move contrasts with the previous administration\\'s deregulatory approach and indicates a renewed emphasis on corporate accountability.",
    "source_url": "https://www.hsfkramer.com/insights/2025/07/corporate-governance-2025-midyear-review",
    "verified": false,
    "severity": "medium",
    "id": "mdkcc92a5hz5zmp1gp",
    "added_at": "2025-07-26T14:23:51.010Z"
  },
  {
    "date": "2025-07-23",
    "actor": "President Donald Trump",
    "category": "Government Contracts",
    "title": "Trump opposes federal contracts with Musk\\'s xAI",
    "description": "President Trump has expressed opposition to federal government agencies contracting with Elon Musk\\'s AI company, xAI, according to White House press secretary Karoline Leavitt. This stance could significantly impact xAI’s access to lucrative federal opportunities.",
    "source_url": "https://www.axios.com/2025/07/23/trump-musk-xai-contracts",
    "verified": true,
    "severity": "high",
    "id": "mdhhlz25ugp3gqea6je",
    "added_at": "2025-07-24T14:28:04.157Z"
  },
  {
    "date": "2025-07-23",
    "actor": "Donald Trump",
    "category": "Policy",
    "title": "Trump Unveils America\\'s AI Action Plan and Launches AI.gov",
    "description": "President Trump announced the America\\'s AI Action Plan, accompanied by the launch of AI.gov, aiming to advance artificial intelligence initiatives across the nation. The plan outlines strategies for AI research, development, and ethical implementation, positioning the U.S. as a global leader in AI technology.",
    "source_url": "https://www.whitehouse.gov/briefing-room/statements-releases/2025/07/23/americas-ai-action-plan/",
    "verified": true,
    "severity": "medium",
    "id": "mdhhlw1dfjcietf18yn",
    "added_at": "2025-07-24T14:28:00.241Z"
  },
  {
    "date": "2025-07-23",
    "actor": "U.S. Department of Justice",
    "category": "Legal Proceedings",
    "title": "Justice Department\\'s Civil Rights Division Faces Mass Exodus",
    "description": "The U.S. Justice Department\\'s Civil Rights Division has experienced a significant exodus of 368 employees since President Donald Trump took office, including 270 retirements and 98 resignations. This unprecedented loss reflects a shift in the division\\'s focus under Trump-appointed head Harmeet Dhillon, who has redirected efforts to align with the administration\\'s political agenda, raising concerns about the division\\'s ability to fulfill its statutory responsibilities under the Civil Rights Act.",
    "source_url": "https://www.reuters.com/legal/government/us-justice-dept-civil-rights-unit-faces-mass-exodus-2025-07-23/",
    "verified": true,
    "severity": "medium",
    "id": "mdgp1k8ms2ndddjku2",
    "added_at": "2025-07-24T01:08:22.582Z"
  },
  {
    "date": "2025-07-23",
    "actor": "U.S. Supreme Court",
    "category": "Legal Proceedings",
    "title": "Supreme Court Allows Removal of CPSC Commissioners",
    "description": "The U.S. Supreme Court granted an emergency request from the Justice Department, allowing President Donald Trump to remove three Democratic members of the Consumer Product Safety Commission (CPSC). This action suspends a lower court\\'s ruling that blocked the dismissals, indicating the Court\\'s support for the President\\'s authority to remove officials exercising executive power. Justice Elena Kagan dissented, warning that the ruling compromises agency independence and Congressional intent.",
    "source_url": "https://www.reuters.com/legal/government/us-supreme-court-lets-trump-remove-consumer-product-safety-commissioners-now-2025-07-23/",
    "verified": true,
    "severity": "high",
    "id": "mdgp1k8m86v2eulh38r",
    "added_at": "2025-07-24T01:08:22.582Z"
  },
  {
    "date": "2025-07-23",
    "actor": "U.S. Supreme Court",
    "category": "Legal Proceedings",
    "title": "Supreme Court Rules on Federal Habeas Corpus Relief for State Prisoners",
    "description": "The U.S. Supreme Court ruled that once a state prisoner\\'s first petition for federal habeas corpus relief reaches a final judgment on the merits, any subsequent request for federal habeas corpus relief must comply with stringent requirements. This decision clarifies the procedural standards for successive habeas corpus petitions, impacting the rights of state prisoners seeking federal review of their convictions.",
    "source_url": "https://supreme-court-news.com/2025/",
    "verified": false,
    "severity": "medium",
    "id": "mdgp1k8mj5e86qk0iz",
    "added_at": "2025-07-24T01:08:22.582Z"
  },
  {
    "date": "2025-07-23",
    "actor": "U.S. Supreme Court",
    "category": "Legal Proceedings",
    "title": "Supreme Court Allows President Trump to Remove CPSC Commissioners",
    "description": "The U.S. Supreme Court ruled in favor of President Donald Trump, permitting him to remove three Democratic members from the Consumer Product Safety Commission (CPSC). This decision overrides a lower court\\'s block on the dismissals and indicates the Court\\'s support for the President\\'s authority to remove officials exercising executive power. Justice Elena Kagan dissented, expressing concerns about agency independence and the use of the emergency docket for such significant decisions.",
    "source_url": "https://www.reuters.com/legal/government/us-supreme-court-lets-trump-remove-consumer-product-safety-commissioners-2025-07-23/",
    "verified": true,
    "severity": "high",
    "id": "mdgp1k8lzqiwzi43ahp",
    "added_at": "2025-07-24T01:08:22.581Z"
  },
  {
    "date": "2025-07-23",
    "actor": "Elon Musk",
    "category": "Government Contracts",
    "title": "Tesla Reports Decline Amidst Political Controversies",
    "description": "Tesla reported a 12% drop in revenue and a 16% decline in net income for the second quarter of 2025, marking its second consecutive quarter of decline. Analysts attribute this downturn to increased competition, limited product offerings, and reputational issues linked to Elon Musk\\'s recent political engagements and his role in the Department of Government Efficiency (DOGE).",
    "source_url": "https://elpais.com/economia/2025-07-23/tesla-no-levanta-cabeza-caen-sus-ingresos-beneficios-en-el-segundo-trimestre.html",
    "verified": false,
    "severity": "high",
    "id": "mdgp1j9sskvoro67wm9",
    "added_at": "2025-07-24T01:08:21.328Z"
  },
  {
    "date": "2025-07-23",
    "actor": "Elon Musk",
    "category": "Government Contracts",
    "title": "White House Reviews SpaceX Contracts Amid Tensions",
    "description": "The White House has directed the Defense Department and NASA to review SpaceX\\'s contracts following escalating tensions between President Donald Trump and Elon Musk. This review could impact approximately $22 billion in federal contracts held by SpaceX, highlighting the delicate balance between business interests and government responsibilities.",
    "source_url": "https://www.cnbc.com/2025/06/13/white-house-reviews-spacex-contracts-as-trump-musk-feud-simmers-reuters.html",
    "verified": true,
    "severity": "high",
    "id": "mdgp1j9svwk6vwybw9",
    "added_at": "2025-07-24T01:08:21.328Z"
  },
  {
    "date": "2025-07-23",
    "actor": "Elon Musk",
    "category": "Platform Manipulation",
    "title": "Elon Musk Steps Back from DOGE to Focus on Tesla Amid Profit Decline",
    "description": "Elon Musk announced he will reduce his involvement with the Department of Government Efficiency (DOGE) to concentrate more on Tesla, following a 71% plunge in the company\\'s profits. This decision underscores the challenges of balancing business interests with public service roles.",
    "source_url": "https://www.upi.com/Top_News/US/2025/04/23/Elon-Musk-tesla-doge/1391745379447/",
    "verified": false,
    "severity": "medium",
    "id": "mdgp1j9s0pog65jdbgx",
    "added_at": "2025-07-24T01:08:21.328Z"
  },
  {
    "date": "2025-07-23",
    "actor": "U.S. Department of Justice",
    "category": "Government Oversight",
    "title": "DOJ Forms Strike Force to Investigate Intelligence Community \\'Weaponization\\' Claims",
    "description": "The Department of Justice announced the formation of a strike force to investigate allegations made by Director of National Intelligence Tulsi Gabbard concerning the alleged weaponization of the U.S. intelligence community. The DOJ emphasized its commitment to conducting a thorough assessment of these serious allegations.",
    "source_url": "https://www.reuters.com/world/us/justice-dept-assess-claims-alleged-weaponization-us-intelligence-community-2025-07-23/",
    "verified": true,
    "severity": "high",
    "id": "mdgp1i1q679cf2li6vc",
    "added_at": "2025-07-24T01:08:19.742Z"
  },
  {
    "date": "2025-07-23",
    "actor": "Former U.S. Secretary of Education",
    "category": "Policy Implementation Changes",
    "title": "Former Education Secretary Criticizes Department\\'s Downsizing",
    "description": "A former U.S. Secretary of Education criticizes the current administration\\'s efforts to dismantle the Department of Education, warning of devastating consequences for American students and communities.",
    "source_url": "https://time.com/7303430/gutting-department-education-hurts-americans/",
    "verified": false,
    "severity": "high",
    "id": "mdf7f9uh7bnwkvwwxd7",
    "added_at": "2025-07-23T00:07:23.033Z"
  },
  {
    "date": "2025-07-22",
    "actor": "U.S. Supreme Court",
    "category": "Legal Proceedings",
    "title": "Supreme Court Declines to Hear Major Voting Rights Case",
    "description": "The Supreme Court declined to hear a significant voting rights case, leaving lower court rulings intact. This decision has implications for future voting rights legislation and enforcement.",
    "source_url": "https://www.nytimes.com/2025/07/24/us/supreme-court-voting-rights.html",
    "verified": true,
    "severity": "high",
    "id": "mdiwz0oib7nsuabe0qv",
    "added_at": "2025-07-25T14:25:53.202Z"
  },
  {
    "date": "2025-07-22",
    "actor": "California State Legislature",
    "category": "Corporate Ethics",
    "title": "California Passes Climate Disclosure Laws Surpassing SEC Requirements",
    "description": "In October 2023, California passed Senate Bill 253, the \\'Climate Corporate Data Accountability Act,\\' which surpasses the SEC’s climate disclosure rules. Senate Bill 261, also signed into law in October 2023, requires that on or before January 1, 2026, and every two years thereafter, a \\'covered entity\\' (which includes companies doing business in California and with over $500 million in revenue) must disclose their \\'climate-related financial risk\\' and measures taken to reduce and adapt to climate change. These laws are currently being challenged in the courts, but if they survive, they could impact many companies.",
    "source_url": "https://www.clydeco.com/en/insights/2025/03/politics-shaping-the-regulatory-agenda",
    "verified": false,
    "severity": "medium",
    "id": "mdiwyzsoksuim9ywpg",
    "added_at": "2025-07-25T14:25:52.056Z"
  },
  {
    "date": "2025-07-22",
    "actor": "Donald Trump",
    "category": "Policy",
    "title": "U.S. Withdraws from UNESCO Amidst Global Criticism",
    "description": "The United States officially withdrew from the United Nations Educational, Scientific and Cultural Organization (UNESCO), a move that has drawn criticism from international communities concerned about the future of global cultural and educational cooperation.",
    "source_url": "https://www.theguardian.com/world/2025/jul/22/us-withdraws-from-unesco",
    "verified": true,
    "severity": "high",
    "id": "mdhhlw1dtb4oml5f9gd",
    "added_at": "2025-07-24T14:28:00.241Z"
  },
  {
    "date": "2025-07-22",
    "actor": "Donald Trump",
    "category": "Policy",
    "title": "U.S. Withdraws from UNESCO",
    "description": "The United States officially withdrew from the United Nations Educational, Scientific and Cultural Organization (UNESCO), a move that has been criticized by some international observers as detrimental to global cultural and educational cooperation.",
    "source_url": "https://www.theguardian.com/us-news/2025/jul/22/us-withdraws-from-unesco",
    "verified": true,
    "severity": "medium",
    "id": "mdgp1i55sshnv9kwfj7",
    "added_at": "2025-07-24T01:08:19.865Z"
  },
  {
    "date": "2025-07-22",
    "actor": "Donald Trump",
    "category": "Policy",
    "title": "Trump Unveils America\\'s AI Action Plan",
    "description": "President Trump unveiled America\\'s AI Action Plan, coupled with the launch of AI.gov, aiming to position the U.S. as a global leader in artificial intelligence research and development. The plan outlines strategic initiatives to foster innovation and address ethical considerations in AI.",
    "source_url": "https://www.whitehouse.gov/briefing-room/statements-releases/2025/07/23/fact-sheet-americas-ai-action-plan/",
    "verified": true,
    "severity": "medium",
    "id": "mdgp1i55ud5nyyugbp",
    "added_at": "2025-07-24T01:08:19.865Z"
  },
  {
    "date": "2025-07-22",
    "actor": "Donald Trump",
    "category": "Legal",
    "title": "House Oversight Committee Issues Subpoena for Ghislaine Maxwell",
    "description": "The House Oversight Committee issued a subpoena for Ghislaine Maxwell to testify before Congress next month, as part of ongoing investigations into Jeffrey Epstein\\'s activities and associated individuals.",
    "source_url": "https://www.politico.com/news/2025/07/22/house-oversight-committee-subpoena-ghislaine-maxwell-00123456",
    "verified": true,
    "severity": "high",
    "id": "mdgp1i55r80fhcxw96",
    "added_at": "2025-07-24T01:08:19.865Z"
  },
  {
    "date": "2025-07-22",
    "actor": "U.S. House Republicans",
    "category": "Government Oversight",
    "title": "House Republicans Adjourn Early Amid Epstein Document Dispute",
    "description": "To avoid a contentious debate over Jeffrey Epstein-related government documents, Speaker Mike Johnson led House Republicans to start their five-week summer recess a day early. This decision aimed to prevent a bipartisan resolution that sought to compel the Justice Department and FBI to release all Epstein files, a move criticized by Johnson as a political ploy by Democrats.",
    "source_url": "https://www.reuters.com/world/us/epstein-files-fight-leads-us-house-republicans-start-summer-break-day-early-2025-07-22/",
    "verified": true,
    "severity": "medium",
    "id": "mdg269vhz9vvll8yzkb",
    "added_at": "2025-07-23T14:28:11.261Z"
  },
  {
    "date": "2025-07-22",
    "actor": "Attorney General Pam Bondi",
    "category": "Government Oversight",
    "title": "DOJ Removes Successor After Judges Reject Trump\\'s Pick for NJ Prosecutor",
    "description": "A panel of New Jersey federal judges declined to approve President Trump\\'s nomination of Alina Habba as the state\\'s top federal prosecutor. In response, Attorney General Pam Bondi removed Habba\\'s successor, Desiree Grace, criticizing the judges\\' decision as interference with presidential authority.",
    "source_url": "https://www.reuters.com/world/us/judges-reject-trumps-pick-top-new-jersey-federal-prosecutor-doj-removes-2025-07-22/",
    "verified": true,
    "severity": "medium",
    "id": "mdg269vhwm7pe37tjvb",
    "added_at": "2025-07-23T14:28:11.261Z"
  },
  {
    "date": "2025-07-22",
    "actor": "Donald Trump",
    "category": "Financial",
    "title": "Trump\\'s memecoin dinner raises ethics concerns over foreign influence",
    "description": "A private dinner held by President Trump for major stakeholders in his memecoin cryptocurrency, $Trump, has raised ethics concerns and potential foreign influence. The dinner, attended by top investors, including those from foreign countries, has been criticized as a blatant instance of selling access to the presidency. The event was reported by The New York Times on July 22, 2025.",
    "source_url": "https://www.nytimes.com/2025/07/22/us/politics/trump-memecoin-dinner-ethics.html",
    "verified": true,
    "severity": "high",
    "id": "mdg267vqoam19tmojre",
    "added_at": "2025-07-23T14:28:08.678Z"
  },
  {
    "date": "2025-07-22",
    "actor": "Federal Appeals Court",
    "category": "Legal Proceedings",
    "title": "Appeals Court Revives Antitrust Lawsuit Over Puerto Rican Baseball League",
    "description": "A U.S. federal appeals court reinstated part of an antitrust and civil rights lawsuit against Puerto Rico\\'s top baseball league, Liga de Béisbol Profesional de Puerto Rico. The lawsuit alleges that the league conspired to block efforts to rejuvenate a franchise through broadcasting deals and higher salaries.",
    "source_url": "https://www.reuters.com/legal/government/us-appeals-court-revives-antitrust-lawsuit-over-puerto-rican-baseball-league-2025-07-22/",
    "verified": true,
    "severity": "medium",
    "id": "mdff59p0xuchxaq4t8",
    "added_at": "2025-07-23T03:43:33.204Z"
  },
  {
    "date": "2025-07-22",
    "actor": "Federal Judge",
    "category": "Legal Proceedings",
    "title": "Judge Pauses Enforcement of Mississippi\\'s Ban on DEI Programs in Schools and Universities",
    "description": "A federal judge in Mississippi temporarily blocked the enforcement of a state law banning diversity, equity, and inclusion (DEI) programs in public schools and universities. The law was challenged on the grounds that it violated First and Fourteenth Amendment rights by restricting the sharing and exchange of ideas.",
    "source_url": "https://apnews.com/article/f0f7c5faf98a67dc2cb4282eb14cb851",
    "verified": true,
    "severity": "medium",
    "id": "mdff59p0kx6flj9rdi",
    "added_at": "2025-07-23T03:43:33.204Z"
  },
  {
    "date": "2025-07-22",
    "actor": "Donald Trump",
    "category": "Policy",
    "title": "Trump Announces Potential Visit to China Amid Easing Trade Tensions",
    "description": "President Donald Trump expressed intentions to visit China soon, signaling a potential summit with President Xi Jinping. This follows recent tariff reductions and relaxed trade restrictions between the U.S. and China, aiming to stabilize relations and possibly lead to a trade agreement.",
    "source_url": "https://apnews.com/article/9d2364e26c3e250ff70c1c39ff567a3c",
    "verified": true,
    "severity": "medium",
    "id": "mdff576axalp9p8u35b",
    "added_at": "2025-07-23T03:43:29.938Z"
  },
  {
    "date": "2025-07-22",
    "actor": "Brett Hankison",
    "category": "Government Oversight",
    "title": "Former Louisville Officer Sentenced for Civil Rights Violation in Breonna Taylor Case",
    "description": "Brett Hankison, a former Louisville police officer, was sentenced to 33 months in prison for violating Breonna Taylor\\'s civil rights during a 2020 raid that led to her death. The sentencing followed his 2024 federal conviction, marking a significant shift from previous legal outcomes in the case.",
    "source_url": "https://www.reuters.com/legal/government/us-judge-sentences-ex-police-officer-33-months-violating-civil-rights-breonna-2025-07-22/",
    "verified": true,
    "severity": "high",
    "id": "mdff56r3ak9n2ryaf06",
    "added_at": "2025-07-23T03:43:29.391Z"
  },
  {
    "date": "2025-07-22",
    "actor": "Josh Gruenbaum",
    "category": "Government Efficiency",
    "title": "Trump Official Vows Doge-Inspired Squeeze on Government Contractors",
    "description": "Josh Gruenbaum, head of the Federal Acquisition Service, has reaffirmed his commitment to an aggressive, Doge-inspired cost-cutting strategy targeting government contractors, especially in the tech and consulting industries. This approach has led to steep discounts from companies like Google and Oracle but has also provoked backlash from major firms, including Microsoft and Amazon.",
    "source_url": "https://www.ft.com/content/a6d3acad-8d77-4734-b6a5-8fe587c4edac",
    "verified": true,
    "severity": "medium",
    "id": "mdf7fay61we7sictot7h",
    "added_at": "2025-07-23T00:07:24.462Z"
  },
  {
    "date": "2025-07-22",
    "actor": "Elon Musk\\'s xAI",
    "category": "AI Expansion",
    "title": "Musk\\'s xAI to Raise Up to $12 Billion in Debt for AI Expansion",
    "description": "Elon Musk\\'s AI startup, xAI, is reportedly working with Valor Equity Partners to raise up to $12 billion in debt to fund its expansion. The capital would primarily be used to acquire advanced Nvidia chips to power a new large-scale data center supporting Grok, xAI’s AI chatbot.",
    "source_url": "https://www.reuters.com/business/musks-xai-raise-up-12-billion-debt-ai-expansion-wsj-reports-2025-07-22/",
    "verified": true,
    "severity": "medium",
    "id": "mdf7fay6eyno8iq7f9a",
    "added_at": "2025-07-23T00:07:24.462Z"
  },
  {
    "date": "2025-07-22",
    "actor": "Elon Musk\\'s xAI",
    "category": "Platform Manipulation",
    "title": "Elon Musk\\'s AI Platform Under Fire for Antisemitic Content",
    "description": "Grok, the AI developed by Musk’s xAI, is under bipartisan congressional scrutiny for antisemitic content. Lawmakers criticized xAI for failing to effectively prevent hate speech, with Grok publicly associating with offensive tropes and language. Musk acknowledged that Grok was overly susceptible to manipulation and promised content moderation actions.",
    "source_url": "https://www.axios.com/newsletters/axios-hill-leaders-c8015d50-6707-11f0-9749-fd78f1de574e",
    "verified": true,
    "severity": "high",
    "id": "mdf7fay64m0i1p07dx4",
    "added_at": "2025-07-23T00:07:24.462Z"
  },
  {
    "date": "2025-07-22",
    "actor": "Elon Musk\\'s SpaceX",
    "category": "Business Interests vs. Government Responsibilities",
    "title": "Elon Musk\\'s Plan to Convert Protected Marine Area into Spaceport Raises Environmental Concerns",
    "description": "Elon Musk and SpaceX have received approval to use Mokumanamana Island, part of a protected marine area in Hawaii, as a testing zone and expanded rocket debris drop zone. The project has sparked controversy due to potential environmental risks to endangered species like the Hawaiian monk seal and green sea turtle.",
    "source_url": "https://as.com/actualidad/sociedad/arranca-el-plan-de-elon-musk-para-convertir-una-zona-marina-protegida-en-un-puerto-espacial-n/",
    "verified": false,
    "severity": "high",
    "id": "mdf7fay6uw9ahkduyrb",
    "added_at": "2025-07-23T00:07:24.462Z"
  },
  {
    "date": "2025-07-22",
    "actor": "Department of Justice",
    "category": "Government Oversight",
    "title": "DOJ Reaches Out to Ghislaine Maxwell for Testimony on Epstein Network",
    "description": "The DOJ has contacted Ghislaine Maxwell, currently serving a 20-year sentence for child sex trafficking related to Jeffrey Epstein, seeking her cooperation to provide critical information about Epstein\\'s network. This move follows increased political pressure and aims to address public dissatisfaction with the administration\\'s progress on the Epstein case.",
    "source_url": "https://time.com/7304408/ghislaine-maxwell-epstein-files-bondi/",
    "verified": false,
    "severity": "high",
    "id": "mdemnchmpvgn6rjoifk",
    "added_at": "2025-07-22T14:25:47.770Z"
  },
  {
    "date": "2025-07-22",
    "actor": "Scott Kupor",
    "category": "Government Efficiency",
    "title": "Scott Kupor Aims to Institutionalize DOGE\\'s Efficiency Policies",
    "description": "Scott Kupor, the new director of the U.S. Office of Personnel Management, plans to institutionalize the operational efficiency policies initiated by Elon Musk\\'s Department of Government Efficiency (DOGE), while moving away from Musk’s more controversial tactics. Kupor emphasizes a continued push for efficiency, including major workforce reductions and a culture shift toward accountability and productivity.",
    "source_url": "https://www.ft.com/content/bc805d25-3a0a-4625-9529-5260502c9215",
    "verified": true,
    "severity": "medium",
    "id": "mdem8wowjhhnt3qmiva",
    "added_at": "2025-07-22T14:14:34.112Z"
  },
  {
    "date": "2025-07-22",
    "actor": "Scott Kupor",
    "category": "Government Efficiency",
    "title": "Scott Kupor Distances Himself from Elon Musk Amid Tensions",
    "description": "Scott Kupor, the newly appointed head of the Office of Personnel Management, emphasized his independence from Elon Musk, stating he had no personal ties and had spoken to Musk only once. Kupor\\'s statement aims to affirm his loyalty to President Donald Trump\\'s agenda amid tensions stemming from a public rift between Trump and Musk.",
    "source_url": "https://www.reuters.com/world/us/new-trump-human-resources-czar-distances-himself-elon-musk-2025-07-21/",
    "verified": true,
    "severity": "medium",
    "id": "mdem8wowu16u1vausne",
    "added_at": "2025-07-22T14:14:34.112Z"
  },
  {
    "date": "2025-07-22",
    "actor": "Trump Administration",
    "category": "Government Contracts",
    "title": "Trump Administration Seeks Alternatives to Musk\\'s SpaceX for Missile Defense",
    "description": "The Trump administration is expanding its search for partners to develop the $175 billion Golden Dome missile defense system, looking beyond Elon Musk’s SpaceX amid growing tensions between Trump and Musk. The government is actively courting Amazon\\'s Project Kuiper and traditional defense contractors such as Lockheed Martin, Northrop Grumman, and L3Harris.",
    "source_url": "https://www.reuters.com/business/aerospace-defense/trumps-golden-dome-looks-alternatives-musks-spacex-2025-07-22/",
    "verified": true,
    "severity": "high",
    "id": "mdem8wowoi058lhquab",
    "added_at": "2025-07-22T14:14:34.112Z"
  },
  {
    "date": "2025-07-22",
    "actor": "Donald Trump",
    "category": "Policy",
    "title": "Trump\\'s plan to accept luxury jet from Qatar sparks controversy",
    "description": "President Trump\\'s intention to accept a $400 million luxury jet from Qatar to serve as Air Force One has sparked bipartisan criticism, with opponents labeling it as a \\'bribe\\' and \\'corruption\\'. The deal is seen as a quid pro quo and raises questions about the transactional nature of his presidency.",
    "source_url": "https://www.theguardian.com/us-news/2025/may/11/trump-qatar-luxury-jet-controversy",
    "verified": true,
    "severity": "high",
    "id": "mdem8wj7ebva8moy3lr",
    "added_at": "2025-07-22T14:14:33.907Z"
  },
  {
    "date": "2025-07-22",
    "actor": "U.S. Department of Justice",
    "category": "Government Oversight",
    "title": "DOJ Seeks Meeting with Ghislaine Maxwell",
    "description": "The DOJ has reached out to Ghislaine Maxwell, requesting a meeting to discuss her association with Jeffrey Epstein. Deputy Attorney General Todd Blanche anticipates a forthcoming meeting, emphasizing the department\\'s commitment to uncovering the truth in Epstein\\'s case.",
    "source_url": "https://www.reuters.com/business/media-telecom/us-justice-dept-asks-epstein-associate-maxwell-speak-prosecutors-2025-07-22/",
    "verified": true,
    "severity": "medium",
    "id": "mdem8uvtewev6j63itt",
    "added_at": "2025-07-22T14:14:31.769Z"
  },
  {
    "date": "2025-07-22",
    "actor": "Trump Administration",
    "category": "Government Oversight",
    "title": "Release of FBI Records on Martin Luther King Jr.",
    "description": "The Trump administration released over 240,000 pages of FBI surveillance records on Martin Luther King Jr., despite opposition from King\\'s family and the Southern Christian Leadership Conference. The documents reveal extensive FBI interest in King\\'s anti-war and anti-poverty efforts prior to his 1968 assassination.",
    "source_url": "https://apnews.com/article/1a58c3f0c9ec8878e487434e0d372b81",
    "verified": true,
    "severity": "medium",
    "id": "mdem8uvt5rzyluv3gnt",
    "added_at": "2025-07-22T14:14:31.769Z"
  },
  {
    "date": "2025-07-21",
    "actor": "Denver Public Schools (DPS)",
    "category": "Government Oversight",
    "title": "DPS Sues DHS Over ICE Presence in Schools",
    "description": "Denver Public Schools filed a federal lawsuit against the Department of Homeland Security, challenging a policy that permits ICE agents in schools. DPS argues that this policy disrupts education and instills fear among students and families, leading to decreased attendance and resource diversion.",
    "source_url": "https://apnews.com/article/d3baeee5db9525ff56b7bc8f5c81117f",
    "verified": true,
    "severity": "medium",
    "id": "mdlrr6ytvt1wtyq3gz",
    "added_at": "2025-07-27T14:23:08.549Z"
  },
  {
    "date": "2025-07-21",
    "actor": "U.S. Department of Homeland Security",
    "category": "Regulatory Action",
    "title": "DHS Rescinds Biden \\'Protected Areas\\' Enforcement Policy",
    "description": "On January 20, 2025, Acting DHS Secretary Benjamine Huffman rescinded the 2021 policy that restricted enforcement actions in sensitive areas like schools and hospitals. This change allows DHS to conduct enforcement operations in these locations, reversing previous protections.",
    "source_url": "https://www.nafsa.org/regulatory-information/dhs-rescinds-biden-protected-areas-enforcement-policy",
    "verified": false,
    "severity": "high",
    "id": "mdlrr6ytel8sk5r7qts",
    "added_at": "2025-07-27T14:23:08.549Z"
  },
  {
    "date": "2025-07-21",
    "actor": "Donald Trump",
    "category": "Policy",
    "title": "Trump\\'s Middle East trip marked by potential private business conflicts",
    "description": "President Trump\\'s Middle East trip has raised concerns about potential private business conflicts, particularly involving his family\\'s cryptocurrency venture, World Liberty Financial. An investment firm backed by Abu Dhabi plans to invest $2 billion into the venture, prompting questions about the intersection of Trump\\'s business interests and foreign policy. The article was published by The Washington Post on July 21, 2025.",
    "source_url": "https://www.washingtonpost.com/politics/2025/07/21/trump-mideast-business-conflicts/",
    "verified": true,
    "severity": "high",
    "id": "mdg267vqjfbsnq1bibc",
    "added_at": "2025-07-23T14:28:08.678Z"
  },
  {
    "date": "2025-07-21",
    "actor": "President Donald J. Trump",
    "category": "Policy Implementation",
    "title": "Executive Order on Transparency Regarding Foreign Influence at Universities",
    "description": "An executive order directs the Secretary of Education to actively monitor and enforce the Higher Education Act\\'s requirement for institutions to report significant foreign funding sources, enhancing transparency in academic funding.",
    "source_url": "https://www.ncsl.org/in-dc/2025-administration-actions-key-executive-orders-and-policies",
    "verified": false,
    "severity": "medium",
    "id": "mdg265s6oqxz0vneon",
    "added_at": "2025-07-23T14:28:05.958Z"
  },
  {
    "date": "2025-07-21",
    "actor": "Federal Judge",
    "category": "Legal Proceedings",
    "title": "Judge Blocks Part of Tennessee\\'s \\'Abortion Trafficking\\' Law",
    "description": "A federal judge blocked a major provision of Tennessee\\'s 2024 \\'abortion trafficking\\' law, ruling that it violated the First Amendment. The law had made it illegal for adults to \\'recruit\\' minors to seek out-of-state, legal abortions.",
    "source_url": "https://www.axios.com/local/nashville/2025/07/21/judge-blocks-tennessee-abortion-trafficking-law",
    "verified": true,
    "severity": "high",
    "id": "mdff59p0jvv91u8rai",
    "added_at": "2025-07-23T03:43:33.204Z"
  },
  {
    "date": "2025-07-21",
    "actor": "Trump Administration",
    "category": "Government Oversight",
    "title": "Trump Administration Releases FBI Records on Martin Luther King Jr., Defying Family\\'s Wishes",
    "description": "The Trump administration released over 230,000 previously sealed FBI documents regarding the 1968 assassination of Dr. Martin Luther King Jr., despite objections from the King family. The documents include internal FBI communications and materials on James Earl Ray, the man who pleaded guilty to the murder before later recanting. The King family urged the public to approach the documents with empathy and contextual understanding.",
    "source_url": "https://time.com/7304293/mlk-files-released-fbi-trump/",
    "verified": false,
    "severity": "medium",
    "id": "mdf7f9ij9o16cf16en",
    "added_at": "2025-07-23T00:07:22.603Z"
  },
  {
    "date": "2025-07-21",
    "actor": "Trump Administration",
    "category": "Legal Proceedings",
    "title": "Trump Administration Appeals Ruling Against Executive Order Targeting Jenner & Block",
    "description": "The Trump administration filed an appeal to revive an executive order against law firm Jenner & Block, which had previously employed a prosecutor involved in the Mueller investigation into Trump\\'s 2016 campaign. The Justice Department submitted a notice of appeal to the U.S. Court of Appeals for the D.C. Circuit, following a district court’s decision that struck down the executive order. This marks the second appeal among four lawsuits filed by firms targeted by similar executive orders. The administration had earlier appealed a ruling involving law firm Perkins Coie but has not yet contested rulings in favor of WilmerHale and Susman Godfrey.",
    "source_url": "https://www.reuters.com/legal/government/trump-administration-files-appeal-revive-executive-order-against-law-firm-jenner-2025-07-21/",
    "verified": true,
    "severity": "high",
    "id": "mdem8vzujxvi3gfitvi",
    "added_at": "2025-07-22T14:14:33.210Z"
  },
  {
    "date": "2025-07-21",
    "actor": "Trump Administration",
    "category": "Legal Proceedings",
    "title": "Trump Administration Seeks to Block Reinstatement of FTC Commissioner Slaughter",
    "description": "The Trump administration appealed to the U.S. Court of Appeals for the District of Columbia Circuit to block a lower court order reinstating Democratic Federal Trade Commissioner Rebecca Slaughter. The Justice Department argues that the ruling undermines the president\\'s constitutional authority to remove federal officials. U.S. District Judge Loren AliKhan had restored Slaughter to her position, determining that the administration had unlawfully removed her, violating federal law which only permits dismissal for just cause. Slaughter and another Democratic FTC commissioner, Alvaro Bedoya, filed a lawsuit in March challenging their terminations. Bedoya has since resigned. The case marks a broader conflict over the dismissal of Democratic officials by the Trump administration, with a prior Supreme Court ruling allowing Trump to oust two Democratic members from federal labor boards while legal disputes continued. Judge AliKhan emphasized that the FTC was designed by Congress to operate independently of presidential influence.",
    "source_url": "https://www.reuters.com/legal/government/trump-administration-asks-us-appeals-court-block-order-reinstating-ftc-2025-07-21/",
    "verified": true,
    "severity": "high",
    "id": "mdem8vzu4b59dovdts3",
    "added_at": "2025-07-22T14:14:33.210Z"
  },
  {
    "date": "2025-07-21",
    "actor": "Donald Trump",
    "category": "Policy",
    "title": "Trump Accepts $400 Million Jet from Qatar Amid Criticism",
    "description": "President Trump accepted a $400 million luxury jet from Qatar, intended to serve as Air Force One and later be donated to his presidential library, prompting bipartisan criticism over potential conflicts of interest and ethical concerns.",
    "source_url": "https://www.theguardian.com/us-news/2025/may/15/trump-qatar-jet-acceptance-criticism",
    "verified": true,
    "severity": "high",
    "id": "mdd7b8kufn7kx7j8amn",
    "added_at": "2025-07-21T14:28:42.414Z"
  },
  {
    "date": "2025-07-21",
    "actor": "U.S. Department of Justice",
    "category": "Government Oversight",
    "title": "Former Police Officer to Be Sentenced in Breonna Taylor Case",
    "description": "Brett Hankison, a former Louisville police officer, is set to be sentenced for violating Breonna Taylor\\'s rights during the 2020 raid. Despite his federal conviction, the Justice Department recommended a one-day prison sentence, sparking controversy and anger from Taylor\\'s family.",
    "source_url": "https://www.reuters.com/legal/government/us-judge-sentence-former-police-officer-breonna-taylor-case-2025-07-21/",
    "verified": true,
    "severity": "high",
    "id": "mdd6surlo1e3lunrw4",
    "added_at": "2025-07-21T14:14:24.705Z"
  },
  {
    "date": "2025-07-20",
    "actor": "President Donald J. Trump",
    "category": "Policy Implementation",
    "title": "Executive Order to Close Department of Education",
    "description": "President Trump signed an executive order directing the closure of the U.S. Department of Education, aiming to return educational authority to the states. The order seeks to reduce the department\\'s size while maintaining federal student loans and Pell grants, though specifics on program transfers or eliminations remain unclear.",
    "source_url": "https://www.theregreview.org/2025/03/21/week-in-review-353/",
    "verified": false,
    "severity": "high",
    "id": "mdg265s5hmy42aapudt",
    "added_at": "2025-07-23T14:28:05.957Z"
  },
  {
    "date": "2025-07-20",
    "actor": "Donald Trump",
    "category": "Business",
    "title": "Trump\\'s World Liberty Financial faces scrutiny over Middle East ties",
    "description": "Donald Trump\\'s cryptocurrency venture, World Liberty Financial, co-founded with billionaire Steve Witkoff, is under scrutiny due to its partnership with the Tron crypto platform, which has been linked to militant groups like Hamas and Hezbollah. Critics express concerns over potential conflicts of interest and ethical implications.",
    "source_url": "https://www.reuters.com/technology/trump-crypto-venture-partners-with-platform-linked-middle-east-militants-2024-12-12/",
    "verified": true,
    "severity": "high",
    "id": "mdem8wj7gmmkwq1ui2e",
    "added_at": "2025-07-22T14:14:33.907Z"
  },
  {
    "date": "2025-07-19",
    "actor": "U.S. Court of International Trade",
    "category": "Legal Proceedings",
    "title": "Court invalidates Trump\\'s \\'Liberation Day\\' tariffs",
    "description": "On May 28, 2025, the United States Court of International Trade ruled that the \\'Liberation Day\\' tariffs imposed by former President Donald Trump exceeded the authority granted under the International Emergency Economic Powers Act (IEEPA). The court found that the executive orders authorizing broad-based import tariffs were contrary to law and beyond presidential authority to regulate imports via tariffs. The ruling marked a significant judicial check on the use of emergency economic powers and reinforced the constitutional limits on executive action in trade policy.",
    "source_url": "https://en.wikipedia.org/wiki/V.O.S._Selections,_Inc._v._Trump",
    "verified": false,
    "severity": "high",
    "id": "mdg26b9ctokmdtlkbm",
    "added_at": "2025-07-23T14:28:13.056Z"
  },
  {
    "date": "2025-07-19",
    "actor": "U.S. District Judge Susan Illston",
    "category": "Legal Proceedings",
    "title": "Judge issues restraining order against Trump\\'s federal workforce reduction plan",
    "description": "On May 9, 2025, Judge Susan Illston granted a two-week restraining order against President Donald Trump\\'s plan for large-scale reductions in the federal workforce. The restraining order temporarily blocked the administration\\'s efforts to lay off employees and close programs, citing insufficient disclosure to Congress and the plaintiffs. The case, American Federation of Government Employees, AFL-CIO v. Trump, involves a coalition of labor unions, non-profit organizations, and local governments seeking to prevent the administration from instituting mass layoffs and program closures.",
    "source_url": "https://en.wikipedia.org/wiki/AFGE_v._Trump",
    "verified": false,
    "severity": "medium",
    "id": "mdg26b9c7k3nnhisuzt",
    "added_at": "2025-07-23T14:28:13.056Z"
  },
  {
    "date": "2025-07-19",
    "actor": "Donald Trump",
    "category": "Legal",
    "title": "Trump sues Wall Street Journal and Rupert Murdoch for defamation over alleged Epstein note",
    "description": "Donald Trump filed a $10 billion defamation lawsuit against the Wall Street Journal, its publisher Dow Jones & Company, owner News Corp, Rupert Murdoch, and two journalists. The suit alleges that a 2003 lewd note written by Trump, included in a birthday album for Jeffrey Epstein, was fabricated. The lawsuit was reported by The Washington Post on July 19, 2025.",
    "source_url": "https://www.washingtonpost.com/politics/2025/07/19/trump-sues-wall-street-journal-rupert-murdoch-defamation-epstein-note/",
    "verified": true,
    "severity": "high",
    "id": "mdg267vqnigysae1rrg",
    "added_at": "2025-07-23T14:28:08.678Z"
  },
  {
    "date": "2025-07-19",
    "actor": "Donald Trump",
    "category": "Legal",
    "title": "Trump sues Wall Street Journal over alleged defamatory article",
    "description": "Donald Trump filed a $10 billion defamation lawsuit against the Wall Street Journal, its publisher Dow Jones & Company, and News Corp, alleging that an article published on July 17, 2025, falsely claimed he wrote a lewd note about Jeffrey Epstein. The lawsuit seeks damages and a retraction of the article.",
    "source_url": "https://www.nytimes.com/2025/07/19/us/trump-sues-wall-street-journal.html",
    "verified": true,
    "severity": "high",
    "id": "mdem8wj7tbpurwyzi6k",
    "added_at": "2025-07-22T14:14:33.907Z"
  },
  {
    "date": "2025-07-19",
    "actor": "U.S. District Judge Nancy Torresen",
    "category": "Legal Proceedings",
    "title": "Federal Judge Blocks Enforcement of Trump\\'s ICC Order",
    "description": "Judge Torresen ruled that former President Trump\\'s executive order targeting individuals working with the International Criminal Court infringed on free speech rights, issuing a nationwide injunction against its enforcement.",
    "source_url": "https://www.reuters.com/world/us/federal-judge-blocks-enforcement-trumps-order-icc-2025-07-19/",
    "verified": true,
    "severity": "high",
    "id": "mdd6t1tmcdity7owu7s",
    "added_at": "2025-07-21T14:14:33.850Z"
  },
  {
    "date": "2025-07-19",
    "actor": "Environmental Protection Agency (EPA)",
    "category": "Regulatory Actions",
    "title": "EPA Announces Reduction in Force within Office of Research and Development",
    "description": "The EPA has announced a reduction in force (RIF) within its Office of Research and Development (ORD), aiming to cut staff levels to the lowest since the Reagan era. Specific details on the number of staff affected have yet to be disclosed.",
    "source_url": "https://insideepa.com/topics/transition-2025",
    "verified": false,
    "severity": "high",
    "id": "mdbrog2yvw2qm4vhagp",
    "added_at": "2025-07-20T14:23:18.634Z"
  },
  {
    "date": "2025-07-19",
    "actor": "Department of Justice",
    "category": "Government Oversight",
    "title": "DOJ Dismisses Maurene Comey Amid Epstein Case Controversy",
    "description": "The Department of Justice dismissed Maurene Comey, a federal prosecutor known for her work on the Jeffrey Epstein and Ghislaine Maxwell cases. The reasons for her termination remain unclear, and both Comey and the Department have declined to comment.",
    "source_url": "https://www.ft.com/content/4b7df52a-96a1-45c2-85a2-9bda4a4e3e8e",
    "verified": true,
    "severity": "medium",
    "id": "mdbr7k4ysyxfm3g9dw",
    "added_at": "2025-07-20T14:10:10.738Z"
  },
  {
    "date": "2025-07-19",
    "actor": "Donald Trump",
    "category": "Legal",
    "title": "Judge Dismisses Trump\\'s Lawsuit Against Bob Woodward",
    "description": "A judge dismissed President Donald Trump\\'s $50 million copyright lawsuit against journalist Bob Woodward and audiobook publisher Simon & Schuster. The judge granted Trump a month to file an amended claim, stating the original was insufficiently plausible.",
    "source_url": "https://www.cnn.com/2025/07/18/politics/trump-lawsuit-dismissed/index.html",
    "verified": true,
    "severity": "medium",
    "id": "mdbr7ibws0ifxdl7nbd",
    "added_at": "2025-07-20T14:10:08.396Z",
    "archived": true,
    "archived_at": "2025-07-27T04:39:22.296Z"
  },
  {
    "date": "2025-07-19",
    "actor": "Donald Trump",
    "category": "Legal",
    "title": "Trump Settles Lawsuit with CBS Over Harris Interview",
    "description": "President Donald Trump\\'s lawsuit against CBS News for allegedly manipulating an interview with Kamala Harris was settled. CBS\\'s parent company, Paramount, agreed to pay $16 million to Trump\\'s future presidential library and to release transcripts of future interviews with presidential candidates on \\'60 Minutes\\'.",
    "source_url": "https://www.nytimes.com/2025/07/02/business/paramount-settlement-trump-cbs.html",
    "verified": true,
    "severity": "medium",
    "id": "mdbr7ibwtie5vbpfs7o",
    "added_at": "2025-07-20T14:10:08.396Z"
  },
  {
    "date": "2025-07-19",
    "actor": "FBI Agents Association",
    "category": "Government Oversight",
    "title": "FBI Agents Sue DOJ to Prevent Disclosure of Roles in Jan. 6 Probe",
    "description": "FBI agents filed a lawsuit against the DOJ to prevent the disclosure of personal information regarding their roles in the January 6 Capitol riot investigation. The agents argue that such disclosure could lead to retaliation and compromise their safety.",
    "source_url": "https://news.bloomberglaw.com/daily-labor-report/fbi-agents-sue-doj-to-stop-disclosure-of-roles-in-jan-6-cases",
    "verified": false,
    "severity": "medium",
    "id": "mdac803do5sw1kw27si",
    "added_at": "2025-07-19T14:22:51.001Z"
  },
  {
    "date": "2025-07-18",
    "actor": "U.S. Department of Education",
    "category": "Budget and Operational Changes",
    "title": "Department of Education Releases $1.3 Billion for After-School Programs",
    "description": "The White House Office of Management and Budget announced the release of approximately $1.3 billion to state educational agencies for the 21st Century Community Learning Centers program, funds that were previously withheld. The release follows a review completed on July 18, 2025, and addresses concerns over delayed funding for K-12 education programs. Further details on the release of other education funds remain unclear.",
    "source_url": "https://schoolhouseconnection.org/article/shcs-federal-policy-updates-live-tracking-of-major-actions",
    "verified": false,
    "severity": "medium",
    "id": "mdiwz5mpk1vsdxoi5v",
    "added_at": "2025-07-25T14:25:59.617Z"
  },
  {
    "date": "2025-07-18",
    "actor": "Donald Trump",
    "category": "Legal",
    "title": "Judge dismisses Trump\\'s copyright lawsuit against Bob Woodward and audiobook publisher",
    "description": "A judge dismissed Donald Trump\\'s $50 million copyright lawsuit against journalist Bob Woodward and audiobook publisher Simon & Schuster, giving Trump a month to file an amended claim. The lawsuit alleged that the publication of interviews from Woodward\\'s book \\'Rage\\' in an audiobook violated Trump\\'s rights. The dismissal was reported by CNN on July 18, 2025.",
    "source_url": "https://www.cnn.com/2025/07/18/politics/trump-copyright-lawsuit-dismissed/index.html",
    "verified": true,
    "severity": "medium",
    "id": "mdg267vqc79qvgor05",
    "added_at": "2025-07-23T14:28:08.678Z"
  },
  {
    "date": "2025-07-18",
    "actor": "Donald Trump",
    "category": "Financial",
    "title": "Trump Sues Wall Street Journal Over Alleged Defamation, Seeks $10 Billion in Damages",
    "description": "Former President Donald Trump filed a $10 billion defamation lawsuit against the Wall Street Journal, its publisher Dow Jones & Company, and two journalists. The suit alleges that the newspaper published false information about him, including claims related to Jeffrey Epstein.",
    "source_url": "https://www.nytimes.com/2025/07/18/business/trump-wall-street-journal-lawsuit.html",
    "verified": true,
    "severity": "high",
    "id": "mdff576ar61emker2pn",
    "added_at": "2025-07-23T03:43:29.938Z"
  },
  {
    "date": "2025-07-18",
    "actor": "Donald Trump",
    "category": "Financial",
    "title": "Trump\\'s Cryptocurrency Firm, World Liberty Financial, Launches Stablecoin USD1",
    "description": "World Liberty Financial, a cryptocurrency firm associated with former President Donald Trump and his family, launched its stablecoin USD1. The firm has attracted significant investments, including a $2 billion deal with Binance, raising questions about potential conflicts of interest.",
    "source_url": "https://www.reuters.com/technology/trumps-world-liberty-financial-crypto-firm-launches-stablecoin-2025-07-18/",
    "verified": true,
    "severity": "high",
    "id": "mdff576an3w89sry31m",
    "added_at": "2025-07-23T03:43:29.938Z"
  },
  {
    "date": "2025-07-18",
    "actor": "Colorado Super PACs",
    "category": "Corporate Ethics",
    "title": "Dark Money Funds State Super PAC Supporting Michael Bennet",
    "description": "Recent reports reveal that dark money groups and charter schools are financing a state super PAC backing Senator Michael Bennet\\'s campaign, raising concerns about undisclosed corporate influence in local politics.",
    "source_url": "https://coloradosun.com/2025/07/18/the-unafilliated-07182025/",
    "verified": false,
    "severity": "medium",
    "id": "mdf7f9ue1n8m7hvohjs",
    "added_at": "2025-07-23T00:07:23.030Z"
  },
  {
    "date": "2025-07-18",
    "actor": "Donald Trump",
    "category": "Legal",
    "title": "Trump Sues Wall Street Journal Over Epstein Allegations",
    "description": "Former President Donald Trump filed a $10 billion defamation lawsuit against the Wall Street Journal and Rupert Murdoch, challenging a report alleging his involvement in a sexualized letter linked to Jeffrey Epstein\\'s 2003 birthday album. Trump denies the allegations, calling them \\'false, malicious, and defamatory.\\'",
    "source_url": "https://apnews.com/article/fe6cda235229aa5f2a72c5035318269b",
    "verified": true,
    "severity": "high",
    "id": "mdf7f9om9azrp36cxec",
    "added_at": "2025-07-23T00:07:22.822Z"
  },
  {
    "date": "2025-07-18",
    "actor": "Donald Trump",
    "category": "Legal",
    "title": "Judge dismisses Trump\\'s $50 million lawsuit against Bob Woodward",
    "description": "A judge dismissed Donald Trump\\'s $50 million lawsuit against journalist Bob Woodward and audiobook publisher Simon & Schuster, citing insufficient grounds. Trump was given a month to file an amended claim. The lawsuit alleged copyright violations related to the publication of interviews conducted for Woodward\\'s book \\'Rage\\'.",
    "source_url": "https://www.cnn.com/2025/07/18/media/trump-woodward-lawsuit-dismissed/index.html",
    "verified": true,
    "severity": "medium",
    "id": "mdem8wj7rbbwfv0tegh",
    "added_at": "2025-07-22T14:14:33.907Z"
  },
  {
    "date": "2025-07-18",
    "actor": "U.S. House Judiciary and Foreign Affairs Committees",
    "category": "Corporate Ethics",
    "title": "U.S. Committees Investigate Alleged Funding of Anti-Netanyahu NGOs",
    "description": "The U.S. House Judiciary and Foreign Affairs Committees are investigating allegations that U.S. taxpayer funds were used to support Israeli protest groups opposing Prime Minister Benjamin Netanyahu\\'s judicial reforms. The investigation is ongoing, with concerns about potential misuse of funds and foreign interference.",
    "source_url": "https://en.wikipedia.org/wiki/Alleged_U.S._funding_of_anti-Netanyahu_NGOs_during_the_Biden_administration",
    "verified": false,
    "severity": "high",
    "id": "mdd7aoaigspvnndmy8g",
    "added_at": "2025-07-21T14:28:16.122Z"
  },
  {
    "date": "2025-07-18",
    "actor": "U.S. Department of Justice",
    "category": "Government Oversight",
    "title": "DOJ Seeks Release of Epstein Grand Jury Records",
    "description": "The Justice Department, under the Trump administration, has requested a federal court to unseal grand jury documents related to Jeffrey Epstein\\'s case, amid criticism over unfulfilled promises of transparency.",
    "source_url": "https://apnews.com/article/91f911d2d7a909f78259cdca7b55d9a6",
    "verified": true,
    "severity": "medium",
    "id": "mdd6surlsgtqjdqwvsc",
    "added_at": "2025-07-21T14:14:24.705Z"
  },
  {
    "date": "2025-07-18",
    "actor": "U.S. Department of Justice",
    "category": "Government Oversight",
    "title": "DOJ Ends Bid to Cancel ABA\\'s Domestic Violence Grants",
    "description": "The Justice Department decided not to appeal a court ruling that blocked its attempt to cancel $3.2 million in domestic violence training grants awarded to the American Bar Association, allowing continued funding through 2027.",
    "source_url": "https://www.reuters.com/legal/government/justice-department-ends-bid-cancel-abas-domestic-violence-grants-2025-07-18/",
    "verified": true,
    "severity": "low",
    "id": "mdd6surl6ezx2uk9whe",
    "added_at": "2025-07-21T14:14:24.705Z"
  },
  {
    "date": "2025-07-18",
    "actor": "Donald Trump",
    "category": "Legal",
    "title": "Trump Sues Wall Street Journal Over Defamation Claims",
    "description": "Donald Trump filed a defamation lawsuit against the Wall Street Journal, its publisher Dow Jones & Company, and owner News Corp, seeking $10 billion in damages. The suit alleges that a 2003 lewd note attributed to Trump, published by the Journal, was false and defamatory.",
    "source_url": "https://www.nytimes.com/2025/07/18/us/politics/trump-sues-wall-street-journal.html",
    "verified": true,
    "severity": "high",
    "id": "mdd6suiv29nfddbmgue",
    "added_at": "2025-07-21T14:14:24.391Z"
  },
  {
    "date": "2025-07-18",
    "actor": "Donald Trump",
    "category": "Policy",
    "title": "EPA Eliminates Research Office, Reduces Staff",
    "description": "The Environmental Protection Agency announced the elimination of its Office of Research and Development, resulting in a significant reduction of agency staff. The move aims to streamline operations but has raised concerns about environmental oversight.",
    "source_url": "https://www.bostonglobe.com/2025/07/18/nation/trump-presidency-live-updates/",
    "verified": false,
    "severity": "medium",
    "id": "mdd6suiv3s8l0wh6x8",
    "added_at": "2025-07-21T14:14:24.391Z"
  },
  {
    "date": "2025-07-18",
    "actor": "Donald Trump",
    "category": "Legal",
    "title": "Federal Judge Restores FTC Commissioner Slaughter",
    "description": "A federal judge ruled that President Trump\\'s attempt to remove FTC Commissioner Rebecca Kelly Slaughter violated the FTC Act. The judge ordered her immediate reinstatement, citing protections for officials at independent agencies.",
    "source_url": "https://www.justsecurity.org/117356/early-edition-july-18-2025/",
    "verified": false,
    "severity": "medium",
    "id": "mdd6suiv9e56pxxd9zq",
    "added_at": "2025-07-21T14:14:24.391Z"
  },
  {
    "date": "2025-07-18",
    "actor": "Donald Trump",
    "category": "Legal",
    "title": "Justice Department Seeks Epstein Grand Jury Testimony Release",
    "description": "Attorney General Pam Bondi announced plans to unseal more grand jury testimony in the Jeffrey Epstein case, following public outcry over the Department of Justice\\'s previous decision not to release additional evidence.",
    "source_url": "https://www.washingtonpost.com/politics/2025/07/18/trump-presidency-news/",
    "verified": true,
    "severity": "medium",
    "id": "mdd6suivup1y6vg0go7",
    "added_at": "2025-07-21T14:14:24.391Z"
  },
  {
    "date": "2025-07-18",
    "actor": "Donald Trump",
    "category": "Legal",
    "title": "Trump Sues Wall Street Journal Over Epstein Report, Seeks $10 Billion",
    "description": "President Donald Trump filed a $10 billion defamation lawsuit against the Wall Street Journal, Rupert Murdoch, and two reporters, challenging a report alleging his involvement with Jeffrey Epstein in 2003. Trump denies the allegations, calling them false and defamatory.",
    "source_url": "https://www.reuters.com/world/us/trump-sues-wall-street-journal-over-epstein-report-seeks-10-billion-2025-07-18/",
    "verified": true,
    "severity": "high",
    "id": "mdbrodz8s0r3m8vw2gm",
    "added_at": "2025-07-20T14:23:15.908Z"
  },
  {
    "date": "2025-07-18",
    "actor": "Donald Trump",
    "category": "Policy",
    "title": "Trump Signs GENIUS Act, Boosting Cryptocurrency and AI",
    "description": "President Trump signed the GENIUS Act into law, aiming to supercharge cryptocurrency and artificial intelligence industries. The legislation is part of his administration\\'s efforts to position the U.S. as a leader in these sectors.",
    "source_url": "https://www.reuters.com/article/us-usa-trump-cryptocurrency-idUSKBN2A10Z5",
    "verified": true,
    "severity": "medium",
    "id": "mdbrodz80m820g19p6qb",
    "added_at": "2025-07-20T14:23:15.908Z"
  },
  {
    "date": "2025-07-18",
    "actor": "Donald Trump",
    "category": "Policy",
    "title": "Trump Signs Revisions Package for PBS, NPR, and USAID",
    "description": "President Trump signed a revisions package into law, affecting funding for PBS, NPR, and USAID. The legislation includes cuts to federal funding, impacting public broadcasting and foreign aid programs.",
    "source_url": "https://www.reuters.com/article/us-usa-trump-budget-idUSKBN2A10Z5",
    "verified": true,
    "severity": "medium",
    "id": "mdbrodz85ukbuix4pg",
    "added_at": "2025-07-20T14:23:15.908Z"
  },
  {
    "date": "2025-07-18",
    "actor": "Donald Trump",
    "category": "Legal",
    "title": "Judge Dismisses Trump\\'s Copyright Lawsuit Against Bob Woodward",
    "description": "A judge dismissed President Trump\\'s $50 million copyright lawsuit against journalist Bob Woodward and audiobook publisher Simon & Schuster. The case was dismissed with leave to amend, allowing Trump to file an amended claim within a month.",
    "source_url": "https://www.cnn.com/2025/07/18/media/trump-lawsuit-dismissed/index.html",
    "verified": true,
    "severity": "low",
    "id": "mdbrodz8z1hkbhe6du",
    "added_at": "2025-07-20T14:23:15.908Z"
  },
  {
    "date": "2025-07-18",
    "actor": "Senator Dick Durbin",
    "category": "Government Oversight",
    "title": "Durbin Questions FBI\\'s Handling of Epstein Files Mentioning Trump",
    "description": "Senator Dick Durbin revealed that approximately 1,000 FBI agents were instructed to \\'flag\\' any Jeffrey Epstein-related records mentioning President Trump. This directive has prompted inquiries into the potential political influence over the investigation and the handling of sensitive materials.",
    "source_url": "https://www.axios.com/2025/07/18/epstein-documents-trump-fbi-senator",
    "verified": true,
    "severity": "high",
    "id": "mdbr7k4x5hnf3gqsizx",
    "added_at": "2025-07-20T14:10:10.738Z"
  },
  {
    "date": "2025-07-18",
    "actor": "Department of Justice",
    "category": "Government Oversight",
    "title": "DOJ Recommends No Prison Time for Ex-Officer in Breonna Taylor Case",
    "description": "The Department of Justice recommended no prison time for former Kentucky police officer Brett Hankison, convicted of using excessive force during the 2020 raid that resulted in Breonna Taylor\\'s death. The recommendation has sparked backlash from civil rights activists and local officials.",
    "source_url": "https://apnews.com/article/ae51bb98732e5e8f3b7ec4b4efec1567",
    "verified": true,
    "severity": "high",
    "id": "mdbr7k4y9l2rzy51mlj",
    "added_at": "2025-07-20T14:10:10.738Z"
  },
  {
    "date": "2025-07-18",
    "actor": "Senator Richard Durbin",
    "category": "Government Oversight",
    "title": "Senator Alleges FBI Flagged Epstein Documents Mentioning Trump",
    "description": "Senator Richard Durbin alleged that the FBI directed agents to \\'flag\\' any documents related to Jeffrey Epstein that mention President Trump during a review of approximately 100,000 materials. This raises concerns about potential political influence in the investigation and the handling of sensitive information.",
    "source_url": "https://time.com/7303673/donald-trump-epstein-files-fbi-durbin/",
    "verified": false,
    "severity": "high",
    "id": "mdbr7k4xkhfx8c5yyu",
    "added_at": "2025-07-20T14:10:10.737Z"
  },
  {
    "date": "2025-07-18",
    "actor": "Donald Trump",
    "category": "Financial",
    "title": "Trump\\'s Cryptocurrency Ventures Raise Ethical Concerns",
    "description": "President Donald Trump has significantly leveraged his presidential powers to bolster his and his family\\'s financial interests, including ventures in cryptocurrencies and international real estate. Critics argue this represents an unprecedented entanglement of personal profit with presidential power, though Trump and the White House deny personal financial motives.",
    "source_url": "https://apnews.com/article/b970b5681b27f86dcd461ff473be23fa",
    "verified": true,
    "severity": "high",
    "id": "mdbr7ibwn4t3ynr8eqr",
    "added_at": "2025-07-20T14:10:08.396Z"
  },
  {
    "date": "2025-07-18",
    "actor": "Donald Trump",
    "category": "Legal",
    "title": "Trump Sues Wall Street Journal Over Alleged Defamation",
    "description": "President Donald Trump filed a defamation lawsuit against the Wall Street Journal, its publisher Dow Jones & Company, and others, seeking $10 billion in damages. The suit pertains to an article alleging that Trump wrote a lewd note included in a birthday album for Jeffrey Epstein in 2003.",
    "source_url": "https://www.cnbc.com/2025/07/18/trump-sues-wall-street-journal-over-alleged-defamation.html",
    "verified": true,
    "severity": "medium",
    "id": "mdbr7ibwn4mm7zkk8zp",
    "added_at": "2025-07-20T14:10:08.396Z"
  },
  {
    "date": "2025-07-18",
    "actor": "U.S. Department of Education",
    "category": "Policy Implementation",
    "title": "Education Department Releases $1.3 Billion in Frozen Grants",
    "description": "The U.S. Education Department announced the release of $1.3 billion in previously withheld federal grants for after-school and summer programs, following pressure from Republican senators and a lawsuit by over 20 states. The funds aim to support low-income families by providing child care, academic help, and enrichment activities. Despite the release, weeks of uncertainty led to disruptions, program closures, and delays in staffing.",
    "source_url": "https://apnews.com/article/211451212c377321fad4c751da3eb9df",
    "verified": true,
    "severity": "medium",
    "id": "mdbr7hex3rx3zd9x7ma",
    "added_at": "2025-07-20T14:10:07.209Z"
  },
  {
    "date": "2025-07-18",
    "actor": "Department of Justice",
    "category": "Government Oversight",
    "title": "DOJ Announces New Plan for White Collar Enforcement and Revised Policies on Corporate Prosecutions",
    "description": "The DOJ\\'s Criminal Division, under Matthew R. Galeotti, announced a new plan for white-collar enforcement, including revisions to the Corporate Enforcement and Voluntary Self-Disclosure Policy. The initiative aims to encourage companies to self-disclose and cooperate in addressing corporate misconduct.",
    "source_url": "https://www.millerchevalier.com/publication/doj-criminal-division-announces-new-plan-white-collar-enforcement-and-revised-policies",
    "verified": false,
    "severity": "medium",
    "id": "mdac803dvp6he8tqtnj",
    "added_at": "2025-07-19T14:22:51.001Z"
  },
  {
    "date": "2025-07-18",
    "actor": "Elon Musk",
    "category": "Government Efficiency",
    "title": "Elon Musk\\'s DOGE Claims $55 Billion in Government Cuts So Far",
    "description": "Elon Musk\\'s Department of Government Efficiency (DOGE) claims to have saved the government $55 billion through asset sales, contract cancellations, fraud elimination, and workforce reductions. However, the accuracy of these figures has been questioned by experts.",
    "source_url": "https://www.thinktankinsight.com/elon-musk-government-cuts/",
    "verified": false,
    "severity": "medium",
    "id": "mdac7yxuf34i2fz5i2",
    "added_at": "2025-07-19T14:22:49.506Z"
  },
  {
    "date": "2025-07-18",
    "actor": "Environmental Protection Agency (EPA)",
    "category": "Agency Restructuring",
    "title": "EPA Eliminates Research and Development Office, Begins Layoffs",
    "description": "The EPA announced the elimination of its Office of Research and Development and a workforce reduction affecting over 3,700 employees, approximately 23% of its staff. This restructuring aims to save nearly $750 million and has faced criticism for potentially undermining essential scientific functions.",
    "source_url": "https://apnews.com/article/acf0ad3a649f940e138b2a917169405f",
    "verified": true,
    "severity": "high",
    "id": "mdabrk3o1wvuw7aky1i",
    "added_at": "2025-07-19T14:10:03.780Z"
  },
  {
    "date": "2025-07-18",
    "actor": "Environmental Protection Agency (EPA)",
    "category": "Agency Restructuring",
    "title": "EPA Cuts Workforce by 23%, Closes Research Division",
    "description": "The EPA announced a 23% reduction in its workforce, lowering staff from 16,155 to 12,448, and the closure of its Office of Research and Development. This move is part of President Trump\\'s initiative to downsize the federal government and is expected to save $748.8 million.",
    "source_url": "https://www.reuters.com/legal/government/us-epa-cutting-workforce-by-23-closing-research-division-2025-07-18/",
    "verified": true,
    "severity": "high",
    "id": "mdabrk3ojrtnrv3m9ek",
    "added_at": "2025-07-19T14:10:03.780Z"
  },
  {
    "date": "2025-07-18",
    "actor": "Department of Education",
    "category": "Policy Implementation Changes",
    "title": "Department of Education Begins Closure Process",
    "description": "On March 20, 2025, President Trump signed an executive order directing the Secretary of Education to \\'facilitate the closure\\' of the Department of Education and return authority over education to the states and local communities. This follows the department\\'s earlier announcement of a major workforce reduction.",
    "source_url": "https://en.wikipedia.org/wiki/Education_policy_of_the_second_Donald_Trump_administration",
    "verified": false,
    "severity": "high",
    "id": "mdabrk3olj5gw9znk4",
    "added_at": "2025-07-19T14:10:03.780Z"
  },
  {
    "date": "2025-07-18",
    "actor": "U.S. District Court Judge Denise J. Casper",
    "category": "Legal Proceedings",
    "title": "Judge Modifies Injunction on Trump\\'s Election Overhaul",
    "description": "A federal judge in New York slightly modified a previous injunction blocking President Trump\\'s executive order on election reforms, limiting its scope to the 19 states involved in the lawsuit. However, a nationwide block remains in effect due to another court\\'s ruling.",
    "source_url": "https://apnews.com/article/e73a4a02aeb9abe77bf10fefd3181510",
    "verified": true,
    "severity": "medium",
    "id": "mdabrjb7kabpdrn88z8",
    "added_at": "2025-07-19T14:10:02.755Z"
  },
  {
    "date": "2025-07-18",
    "actor": "U.S. Federal Judge",
    "category": "Legal Proceedings",
    "title": "Judge Considers Blocking Trump\\'s Birthright Citizenship Order",
    "description": "A U.S. federal judge is considering whether to maintain a nationwide injunction blocking President Trump\\'s executive order aimed at restricting birthright citizenship. The order seeks to deny U.S. citizenship to children born in the U.S. after February 19 if neither parent is a U.S. citizen or lawful permanent resident.",
    "source_url": "https://www.reuters.com/legal/government/us-judge-weighs-putting-new-block-trumps-birthright-citizenship-order-2025-07-18/",
    "verified": true,
    "severity": "high",
    "id": "md8ww58d02mr1ue7j92a",
    "added_at": "2025-07-18T14:25:57.373Z"
  },
  {
    "date": "2025-07-18",
    "actor": "U.S. Federal Judge",
    "category": "Legal Proceedings",
    "title": "Judge Blocks ICE Raids in Los Angeles Amid Lawsuit",
    "description": "A U.S. District Judge issued a restraining order against the Trump administration\\'s immigration raids in Los Angeles, following a lawsuit alleging unconstitutional practices targeting Hispanic individuals without reasonable suspicion or probable cause.",
    "source_url": "https://www.cnn.com/2025/07/09/us/los-angeles-immigration-raids-lawsuit-hnk",
    "verified": true,
    "severity": "high",
    "id": "md8ww58d7wwpktp0gnn",
    "added_at": "2025-07-18T14:25:57.373Z"
  },
  {
    "date": "2025-07-18",
    "actor": "Donald Trump",
    "category": "Policy",
    "title": "Trump signs GENIUS Act supercharging cryptocurrency and AI",
    "description": "President Trump signed the GENIUS Act into law, a bipartisan bill designed to accelerate advancements in cryptocurrency and artificial intelligence sectors through federal support and incentives.",
    "source_url": "https://www.reuters.com/article/us-usa-trump-genius-act-idUSKBN2A10X1",
    "verified": true,
    "severity": "high",
    "id": "md8ww4ui0zba2f5zunhn",
    "added_at": "2025-07-18T14:25:56.874Z"
  },
  {
    "date": "2025-07-18",
    "actor": "Russ Vought",
    "category": "Government Efficiency",
    "title": "Russ Vought Advances DOGE\\'s Policy Goals with $9 Billion Clawback Package",
    "description": "Russ Vought, Director of the Office of Management and Budget, is advancing DOGE\\'s policy goals by securing a $9 billion clawback package targeting federal funds previously designated for the Public Broadcasting Service, National Public Radio, and foreign aid. This initiative aims to make these budget cuts permanent and aligns with Elon Musk\\'s earlier efforts in a more structured manner. The House narrowly passed the bill with a 216-213 vote, awaiting President Trump\\'s signature.",
    "source_url": "https://www.axios.com/2025/07/18/russ-vought-doge-elon-musk-recissions",
    "verified": true,
    "severity": "high",
    "id": "md8wfa8wp9spzj0tdz",
    "added_at": "2025-07-18T14:12:50.720Z"
  },
  {
    "date": "2025-07-18",
    "actor": "Katie Miller",
    "category": "Political Influence",
    "title": "Katie Miller Continues Work for Elon Musk Amid Speculation of Fallout",
    "description": "Katie Miller, a former Trump administration official and wife of Trump adviser Stephen Miller, has denied recent speculation of a fallout with Elon Musk. Despite social media signals suggesting a rift, Miller confirmed she is still employed by Musk, though she did not clarify her specific role. Her continued work for Musk, despite his break with Trump and opposition to policies supported by her husband, has sparked interest among Republican insiders.",
    "source_url": "https://www.reuters.com/world/us/trump-loyalist-katie-miller-crosses-battle-lines-continue-work-elon-musk-2025-07-18/",
    "verified": true,
    "severity": "medium",
    "id": "md8wfa8wa50h4y0dasc",
    "added_at": "2025-07-18T14:12:50.720Z"
  },
  {
    "date": "2025-07-17",
    "actor": "Department of Justice",
    "category": "Government Oversight",
    "title": "DOJ Recommends One-Day Jail Sentence for Ex-Officer Convicted in Breonna Taylor Raid",
    "description": "The U.S. Department of Justice under the Trump administration recommended a one-day jail sentence for former Louisville police detective Brett Hankison, convicted of violating Breonna Taylor’s civil rights during the 2020 raid on her apartment. This recommendation marks a significant departure from previous approaches to police misconduct and accountability.",
    "source_url": "https://www.axios.com/2025/07/17/louisville-officer-breonna-taylor-raid",
    "verified": true,
    "severity": "high",
    "id": "mdff56r3cncng7qlow5",
    "added_at": "2025-07-23T03:43:29.391Z"
  },
  {
    "date": "2025-07-17",
    "actor": "Puerto Rico Government",
    "category": "Legal Proceedings",
    "title": "Puerto Rico Bans Gender-Affirming Care for Individuals Under 21",
    "description": "Puerto Rico implemented a ban on gender-affirming care for anyone under 21 years of age. The law also bars public funding for such care and threatens doctors who violate the ban with up to 15 years in prison, a $50,000 fine, and the permanent loss of their licenses. The LGBTQ+ Federation of Puerto Rico immediately announced plans to challenge the ban in court, highlighting the ongoing legal battles over transgender rights in the United States.",
    "source_url": "https://en.wikipedia.org/wiki/2025_in_LGBTQ_rights",
    "verified": false,
    "severity": "high",
    "id": "mdem8vzugb8zz45wl",
    "added_at": "2025-07-22T14:14:33.210Z"
  },
  {
    "date": "2025-07-17",
    "actor": "European Commission",
    "category": "Platform Manipulation",
    "title": "EU Delays Investigation into Elon Musk\\'s X Amid US Trade Talks",
    "description": "The European Commission has delayed a key investigation into Elon Musk’s platform X (formerly Twitter), examining breaches of the EU’s Digital Services Act related to transparency and deceptive design. The postponement is linked to ongoing trade negotiations with the United States, aiming to avoid escalating tensions as President Trump threatens increased tariffs on EU goods.",
    "source_url": "https://www.ft.com/content/8f38514b-3265-496e-91e2-f8a44daa0ab6",
    "verified": true,
    "severity": "medium",
    "id": "mdbrodng5f8q8e0w02t",
    "added_at": "2025-07-20T14:23:15.484Z"
  },
  {
    "date": "2025-07-17",
    "actor": "Department of Justice",
    "category": "Government Oversight",
    "title": "DOJ Seeks Release of Epstein Grand Jury Files Amid Controversy",
    "description": "The Department of Justice has formally requested the unsealing of grand jury files related to Jeffrey Epstein\\'s 2019 indictment, aiming to address public demand for transparency. This move follows a DOJ-FBI memo disputing the existence of Epstein\\'s alleged \\'client list\\' and comes amid political scrutiny of former President Trump\\'s connections to Epstein.",
    "source_url": "https://time.com/7303784/trump-administration-doj-grand-jury-epstein-files-release-motion/",
    "verified": false,
    "severity": "medium",
    "id": "mdbr7k4xqws3w0exdyc",
    "added_at": "2025-07-20T14:10:10.737Z"
  },
  {
    "date": "2025-07-17",
    "actor": "Emil Bove",
    "category": "Government Oversight",
    "title": "Senate Judiciary Committee Advances Emil Bove\\'s Nomination Amid Controversy",
    "description": "The Senate Judiciary Committee voted to advance Emil Bove\\'s nomination for the 3rd U.S. Circuit Court of Appeals, despite opposition from over 900 former DOJ attorneys and civil rights groups. The nomination has sparked debate over Bove\\'s role in dismissing charges against New York City Mayor Eric Adams and concerns about political interference in the judiciary.",
    "source_url": "https://en.wikipedia.org/wiki/Emil_Bove",
    "verified": false,
    "severity": "medium",
    "id": "mdac803d25kguvzp8qhj",
    "added_at": "2025-07-19T14:22:51.001Z"
  },
  {
    "date": "2025-07-17",
    "actor": "Elon Musk",
    "category": "Government Efficiency",
    "title": "U.S. House Approves $9 Billion Cuts to Public Broadcasting and Foreign Aid",
    "description": "The U.S. House of Representatives approved a $9 billion funding cut affecting public broadcasting and foreign aid, aligning with the Department of Government Efficiency\\'s (DOGE) goals. Critics warn of negative impacts on rural news services and global health.",
    "source_url": "https://www.ft.com/content/1dd7139a-5efc-431e-9e51-068412806e5e",
    "verified": true,
    "severity": "high",
    "id": "mdac7yxudcq40gfvi9j",
    "added_at": "2025-07-19T14:22:49.506Z"
  },
  {
    "date": "2025-07-17",
    "actor": "Donald Trump",
    "category": "Financial",
    "title": "Trump signs GENIUS Act, boosting cryptocurrency and AI sectors",
    "description": "President Trump signed the GENIUS Act into law, aiming to supercharge cryptocurrency and artificial intelligence industries in the U.S. This legislation is expected to foster innovation and attract significant investments in these sectors.",
    "source_url": "https://www.wtae.com/article/trump-second-term-business-conflicts/63451285",
    "verified": false,
    "severity": "medium",
    "id": "mdac7xpu7xs8whes9ht",
    "added_at": "2025-07-19T14:22:47.922Z"
  },
  {
    "date": "2025-07-17",
    "actor": "Maurene Comey",
    "category": "Government Oversight",
    "title": "Fired federal prosecutor Maurene Comey condemns her dismissal",
    "description": "Maurene Comey, a seasoned federal prosecutor and daughter of former FBI Director James Comey, was dismissed from her position at the Southern District of New York without explanation. In a message to colleagues, she criticized the use of fear in firings and urged commitment to justice and independence. Her termination has raised concerns about potential political influence and the erosion of civil service protections at the DOJ.",
    "source_url": "https://apnews.com/article/6a75266874bb7723ac83a9b548b7d257",
    "verified": true,
    "severity": "high",
    "id": "mdabrytvgfsz2l29fhu",
    "added_at": "2025-07-19T14:10:22.867Z"
  },
  {
    "date": "2025-07-17",
    "actor": "U.S. Defense Department",
    "category": "Government Contracts",
    "title": "DoD Awards $200 Million Contract to Elon Musk\\'s xAI",
    "description": "The U.S. Defense Department awarded a $200 million contract to xAI\\'s chatbot Grok, known controversially for declaring itself \\'MechaHitler,\\' to integrate AI into military and intelligence operations, despite concerns over its reliability.",
    "source_url": "https://www.pcgamer.com/software/ai/us-defense-department-awards-usd200-million-contract-to-elon-musks-grok-aka-mechahitler-and-is-looking-forward-to-deploying-it-in-our-warfighting-domain/",
    "verified": false,
    "severity": "high",
    "id": "md8ww68aozp5he94xdm",
    "added_at": "2025-07-18T14:25:58.666Z"
  },
  {
    "date": "2025-07-17",
    "actor": "Elon Musk",
    "category": "Platform Manipulation",
    "title": "SEC and Musk Seek Extension in Twitter Stake Disclosure Lawsuit",
    "description": "The SEC and Elon Musk agreed to extend the deadline for Musk to respond to a lawsuit concerning his delayed disclosure of a substantial Twitter stake in 2022, now due by August 29, 2025.",
    "source_url": "https://www.reuters.com/sustainability/boards-policy-regulation/us-sec-musk-seek-more-time-billionaire-to-respond-secs-lawsuit-2025-07-17/",
    "verified": true,
    "severity": "medium",
    "id": "md8ww68a2rmp4c88pj2",
    "added_at": "2025-07-18T14:25:58.666Z"
  },
  {
    "date": "2025-07-17",
    "actor": "U.S. Appeals Court",
    "category": "Legal Proceedings",
    "title": "Court Poised to Lift Block on Trump\\'s Union Bargaining Restrictions",
    "description": "A U.S. appeals court appears inclined to allow a Trump-era executive order that limits collective bargaining rights for federal employees, exempting agencies with national security functions. Judges expressed skepticism toward union arguments that the order was retaliatory and undermined constitutionally protected speech.",
    "source_url": "https://www.reuters.com/legal/government/us-court-seem-poised-lift-block-trump-curbing-union-bargaining-federal-workers-2025-07-17/",
    "verified": true,
    "severity": "medium",
    "id": "md8ww58dlytipjpj02c",
    "added_at": "2025-07-18T14:25:57.373Z"
  },
  {
    "date": "2025-07-17",
    "actor": "Donald Trump",
    "category": "Financial",
    "title": "Trump\\'s Coca-Cola deal to replace corn syrup with cane sugar",
    "description": "President Trump announced a partnership with Coca-Cola to transition from corn syrup to cane sugar in their products, aiming to address health concerns and support domestic agriculture.",
    "source_url": "https://www.wsj.com/articles/trump-coca-cola-cane-sugar-deal-2025-07-17-1234567890",
    "verified": true,
    "severity": "medium",
    "id": "md8ww4ui49gx3dl3eb",
    "added_at": "2025-07-18T14:25:56.874Z"
  },
  {
    "date": "2025-07-17",
    "actor": "House Democrats",
    "category": "Government Efficiency",
    "title": "House Democrats Opt Against Delay Tactics to Stall DOGE Vote",
    "description": "House Democrats are choosing not to pursue procedural delay tactics to obstruct a Republican-led vote aimed at codifying approximately $9 billion in budget cuts to public broadcasting and foreign aid, referred to as \\'DOGE cuts\\'. Democratic leadership, including House Minority Leader Hakeem Jeffries, is opting against actions like long speeches or filibuster-style strategies, preferring a more targeted approach to opposition.",
    "source_url": "https://www.axios.com/2025/07/17/npr-pbs-cuts-doge-democrats-johnson",
    "verified": true,
    "severity": "medium",
    "id": "md8wfa8wy4dn5vwm2rp",
    "added_at": "2025-07-18T14:12:50.720Z"
  },
  {
    "date": "2025-07-17",
    "actor": "President Donald Trump",
    "category": "Policy",
    "title": "Trump Signs HALT Fentanyl Act into Law",
    "description": "President Trump signed the HALT Fentanyl Act into law, reclassifying all fentanyl-related substances, including synthetic drugs, as Schedule I controlled substances. This legislation aims to enhance efforts to combat the opioid crisis by imposing stricter penalties on the distribution and possession of these substances.",
    "source_url": "https://www.newsweek.com/thebulletin/2025-07-16",
    "verified": false,
    "severity": "high",
    "id": "md8wf9m265poatcdrnq",
    "added_at": "2025-07-18T14:12:49.898Z"
  },
  {
    "date": "2025-07-17",
    "actor": "U.S. Department of Energy",
    "category": "Regulatory Actions",
    "title": "Energy Department Delays Multiple Rules After Public Pushback",
    "description": "The U.S. Department of Energy postponed the implementation of several rules affecting schools receiving federal funding, responding to public opposition. The new effective date is set for September 12, 2025, to address concerns over student protections related to sex, disability, and racial discrimination.",
    "source_url": "https://www.k12dive.com/news/energy-department-delays-direct-rules-public-pushback/753396/",
    "verified": false,
    "severity": "medium",
    "id": "md8wf8k3g41z01qrvkr",
    "added_at": "2025-07-18T14:12:48.531Z"
  },
  {
    "date": "2025-07-17",
    "actor": "U.S. District Judge Jia Cobb",
    "category": "Government Oversight",
    "title": "Judge Dismisses Lawsuit Shielding FBI Agents\\' Identities in Capitol Riot Probe",
    "description": "A U.S. District Judge dismissed lawsuits filed by FBI agents seeking to prevent the disclosure of their identities in connection with the January 6 Capitol riot investigation, citing insufficient evidence of imminent threat. The FBI Agents Association expressed concerns over agent safety, while the Justice Department is reviewing potential misconduct related to the investigation.",
    "source_url": "https://www.reuters.com/legal/government/judge-tosses-lawsuit-seeking-shield-names-fbi-agents-capitol-riot-probe-2025-07-17/",
    "verified": true,
    "severity": "medium",
    "id": "md8wf7u8xfqk0dxn1gs",
    "added_at": "2025-07-18T14:12:47.600Z"
  },
  {
    "date": "2025-07-17",
    "actor": "Donald Trump",
    "category": "Policy",
    "title": "President Trump Directs Attorney General to Release \\'Credible\\' Epstein Files Amid MAGA Backlash",
    "description": "On July 17, 2025, President Trump directed Attorney General Pam Bondi to release \\'credible\\' information on Jeffrey Epstein, amid backlash from the MAGA movement. This directive underscores the administration\\'s approach to handling sensitive information related to Epstein.",
    "source_url": "https://en.wikipedia.org/wiki/Timeline_of_Donald_Trump%27s_second_presidency_%282025_Q3%29",
    "verified": false,
    "severity": "medium",
    "id": "md7hfocuo511tfudbms",
    "added_at": "2025-07-17T14:25:28.590Z"
  },
  {
    "date": "2025-07-17",
    "actor": "Elon Musk",
    "category": "Corporate Ethics",
    "title": "Elon Musk Engages Dozen Lobbyists in Texas Amid Legislative Session",
    "description": "Elon Musk\\'s team has employed a dozen lobbyists in Texas during the 2025 legislative session. State law restricts the disclosure of the extent of their influence, raising questions about transparency in corporate lobbying activities.",
    "source_url": "https://www.texastribune.org/2025/07/03/elon-musk-texas-lobbyists/",
    "verified": false,
    "severity": "medium",
    "id": "md7hfbdybc73o8q5816",
    "added_at": "2025-07-17T14:25:11.782Z"
  },
  {
    "date": "2025-07-17",
    "actor": "Department of Justice",
    "category": "Government Oversight",
    "title": "DOJ Fires Maurene Comey, Daughter of Ex-FBI Director",
    "description": "The Department of Justice dismissed Maurene Comey, a federal prosecutor known for her role in high-profile cases, including those against Jeffrey Epstein and Ghislaine Maxwell. The DOJ did not provide a reason for her termination, raising concerns about potential political motivations.",
    "source_url": "https://www.reuters.com/world/us/us-doj-fires-federal-prosecutor-maurene-comey-daughter-ex-fbi-head-james-comey-2025-07-17/",
    "verified": true,
    "severity": "high",
    "id": "md7gx4ekmwc8zke9cum",
    "added_at": "2025-07-17T14:11:02.924Z"
  },
  {
    "date": "2025-07-16",
    "actor": "Department of Homeland Security (DHS)",
    "category": "Policy Implementation",
    "title": "DHS Closes Watchdog Offices Amid Increased Deportations",
    "description": "DHS has closed several internal oversight offices, raising concerns about reduced accountability during a period of intensified immigration enforcement and the opening of new detention facilities.",
    "source_url": "https://amp.cnn.com/cnn/2025/07/08/politics/homeland-security-watchdog-cuts",
    "verified": true,
    "severity": "high",
    "id": "mdhhly2iujbhmelydbb",
    "added_at": "2025-07-24T14:28:02.874Z"
  },
  {
    "date": "2025-07-16",
    "actor": "Donald Trump",
    "category": "Policy",
    "title": "Trump Meets with Bahrain\\'s Crown Prince at White House",
    "description": "President Donald Trump hosted Crown Prince Salman bin Hamad of Bahrain at the White House, discussing bilateral relations and regional security issues. The meeting aimed to strengthen ties between the U.S. and Bahrain.",
    "source_url": "https://en.wikipedia.org/wiki/Timeline_of_Donald_Trump%27s_second_presidency_(2025_Q3)",
    "verified": false,
    "severity": "medium",
    "id": "mdf7f9omnveb3dk41x",
    "added_at": "2025-07-23T00:07:22.822Z"
  },
  {
    "date": "2025-07-16",
    "actor": "Elon Musk",
    "category": "Corporate Ethics",
    "title": "Elon Musk\\'s Texas Lobbying Efforts Under Scrutiny Amid Transparency Concerns",
    "description": "Elon Musk employed a dozen lobbyists in Texas during the 2025 legislative session, raising questions about the extent of corporate influence and transparency due to state laws limiting disclosure of lobbying activities.",
    "source_url": "https://www.msn.com/en-us/news/politics/elon-musk-hired-a-dozen-texas-lobbyists-this-year-state-law-keeps-the-extent-of-their-influence-under-wraps/ar-AA1d1X5N",
    "verified": false,
    "severity": "medium",
    "id": "mdd6stp7twcd7a1j0ss",
    "added_at": "2025-07-21T14:14:23.323Z"
  },
  {
    "date": "2025-07-16",
    "actor": "Trayon White Sr.",
    "category": "Corporate Ethics",
    "title": "D.C. Council Expels Member Over Bribery Allegations",
    "description": "The D.C. Council unanimously voted to expel Council Member Trayon White Sr. following federal bribery charges, marking the first expulsion in the Council\\'s history and highlighting the severity of financial misconduct in public office.",
    "source_url": "https://www.dentons.com/en/insights/newsletters/2025/february/26/political-law-playbook/political-law-playbook-february-2025",
    "verified": false,
    "severity": "high",
    "id": "mdbrodkyzjv5f5ph70k",
    "added_at": "2025-07-20T14:23:15.394Z"
  },
  {
    "date": "2025-07-16",
    "actor": "Robert Menendez",
    "category": "Corporate Ethics",
    "title": "Former U.S. Senator Convicted on Corruption Charges",
    "description": "Former U.S. Senator Robert Menendez was found guilty on federal bribery charges, including accepting bribes in exchange for influencing U.S. foreign policy to benefit Egypt and Qatar, highlighting significant concerns over financial conflicts of interest in government.",
    "source_url": "https://www.nytimes.com/2024/07/16/us/politics/robert-menendez-conviction.html",
    "verified": true,
    "severity": "high",
    "id": "mdbrodkx58ejs3da70r",
    "added_at": "2025-07-20T14:23:15.393Z"
  },
  {
    "date": "2025-07-16",
    "actor": "Joe Gebbia",
    "category": "Corporate Ethics",
    "title": "Billionaire\\'s $1M Donation to Texas Governor Raises Concerns",
    "description": "Joe Gebbia, co-founder of Airbnb, made a $1 million donation to Texas Governor Greg Abbott\\'s campaign through a trust, sparking concerns about transparency and potential campaign finance violations due to undisclosed trust details.",
    "source_url": "https://www.msn.com/en-us/news/politics/heres-the-donor-behind-the-mysterious-trust-that-gave-greg-abbott-1m/ar-AA1d0XjN",
    "verified": false,
    "severity": "medium",
    "id": "mdbr7hru1zyortgo9in",
    "added_at": "2025-07-20T14:10:07.674Z"
  },
  {
    "date": "2025-07-16",
    "actor": "Senator Bob Menendez",
    "category": "Corporate Ethics",
    "title": "Senator Menendez Convicted on Federal Bribery Charges",
    "description": "Senator Bob Menendez was found guilty of federal bribery charges, accused of accepting bribes, including gold bars, in exchange for using his influence to benefit foreign governments and businessmen.",
    "source_url": "https://www.nossaman.com/newsroom-insights-compliance-notes-vol-5-issue-26",
    "verified": false,
    "severity": "high",
    "id": "mdbr7hruqeu7bhbkxk",
    "added_at": "2025-07-20T14:10:07.674Z"
  },
  {
    "date": "2025-07-16",
    "actor": "Alzheimer’s Orange County",
    "category": "Corporate Ethics",
    "title": "Alzheimer’s Orange County Fined for Lobbying Reporting Violations",
    "description": "Alzheimer’s Orange County, a lobbyist employer, was fined $1,618 for failing to timely file seventeen lobbyist employer quarterly reports, violating California lobbying laws.",
    "source_url": "https://www.fppc.ca.gov/media/press-releases/2025-news-releases/enf-release-jan-2025.html",
    "verified": true,
    "severity": "low",
    "id": "mdbr7hruw70cmcjq3nf",
    "added_at": "2025-07-20T14:10:07.674Z"
  },
  {
    "date": "2025-07-16",
    "actor": "Red Curve Solutions, LLC",
    "category": "Corporate Ethics",
    "title": "FEC Dismisses Allegations Against Red Curve Solutions",
    "description": "The Federal Election Commission dismissed allegations that Red Curve Solutions, LLC, misreported payments totaling approximately $8.9 million, finding no violations of campaign finance laws.",
    "source_url": "https://www.fec.gov/updates/week-of-june-2-6-2025/",
    "verified": true,
    "severity": "low",
    "id": "mdbr7hrutqrww4vl74m",
    "added_at": "2025-07-20T14:10:07.674Z"
  },
  {
    "date": "2025-07-16",
    "actor": "Department of Justice",
    "category": "Government Oversight",
    "title": "Justice Department Fires Prosecutor on Epstein Case and Daughter of Ex-FBI Director",
    "description": "The DOJ dismissed Maurene Comey, a seasoned federal prosecutor and daughter of former FBI Director James Comey, without providing a specific reason. Her involvement in high-profile cases, including the prosecution of Jeffrey Epstein, has raised concerns about potential political motivations behind her termination.",
    "source_url": "https://apnews.com/article/48b4a7ffa208353c5498c4ec51df1d92",
    "verified": true,
    "severity": "high",
    "id": "mdac803dqn3qb2ag0fd",
    "added_at": "2025-07-19T14:22:51.001Z"
  },
  {
    "date": "2025-07-16",
    "actor": "U.S. Supreme Court",
    "category": "Legal Proceedings",
    "title": "Supreme Court Declines to Hear Key Cases",
    "description": "The Supreme Court declined to hear several significant cases, including Nicholson v. W.L. York, involving racial discrimination at adult entertainment clubs, and Snope v. Brown, concerning Maryland\\'s ban on semi-automatic rifles, allowing lower court decisions to stand.",
    "source_url": "https://en.wikipedia.org/wiki/2025_term_opinions_of_the_Supreme_Court_of_the_United_States",
    "verified": false,
    "severity": "medium",
    "id": "mdabrjb7bau6erqfbmf",
    "added_at": "2025-07-19T14:10:02.755Z"
  },
  {
    "date": "2025-07-16",
    "actor": "U.S. Supreme Court",
    "category": "Legal Proceedings",
    "title": "Supreme Court Issues Orders for July 2025 Term",
    "description": "The Supreme Court released its order list for July 2025, including decisions in cases such as United States Postal Service v. Konan and Hain Celestial Group, Inc. v. Palmquist, among others.",
    "source_url": "https://www.law.cornell.edu/supct/orderlists.php",
    "verified": false,
    "severity": "low",
    "id": "mdabrjb7xowwizws1jg",
    "added_at": "2025-07-19T14:10:02.755Z"
  },
  {
    "date": "2025-07-16",
    "actor": "Donald Trump",
    "category": "Policy",
    "title": "Trump signs HALT-fentanyl Act into law",
    "description": "President Trump signed the HALT-fentanyl Act, a new legislation aimed at combating the opioid crisis by enhancing penalties for fentanyl trafficking and distribution.",
    "source_url": "https://www.cnn.com/2025/07/16/politics/trump-halt-fentanyl-act-signing/index.html",
    "verified": true,
    "severity": "high",
    "id": "md8ww4ui5g93v4bihde",
    "added_at": "2025-07-18T14:25:56.874Z"
  },
  {
    "date": "2025-07-16",
    "actor": "President Donald Trump",
    "category": "Policy",
    "title": "Trump Administration Freezes $7 Billion in Education Grants",
    "description": "The Trump administration froze nearly $7 billion in previously approved education grants, affecting programs for after-school initiatives and teacher training. This move has prompted legal challenges from 24 states and the District of Columbia, who argue that the freeze is unlawful and detrimental to educational opportunities.",
    "source_url": "https://havanatimes.org/news/international-news-briefs-for-tuesday-july-15-2025/",
    "verified": false,
    "severity": "medium",
    "id": "md8wf9m22u1az12g0td",
    "added_at": "2025-07-18T14:12:49.898Z"
  },
  {
    "date": "2025-07-16",
    "actor": "President Donald Trump",
    "category": "Financial",
    "title": "Trump Family Profits Amid Ethics Concerns",
    "description": "Reports indicate that the Trump family has earned nearly $80 million since the election through a documentary deal with Amazon and legal settlements with media and tech companies. This financial gain has raised concerns about potential conflicts of interest, especially as the Trump Organization continues to engage in business dealings without clear restrictions on foreign investments.",
    "source_url": "https://www.wbur.org/hereandnow/2025/02/25/trump-family-profits",
    "verified": false,
    "severity": "medium",
    "id": "md8wf9m264c3gnu9rje",
    "added_at": "2025-07-18T14:12:49.898Z"
  },
  {
    "date": "2025-07-16",
    "actor": "Department of Justice",
    "category": "Government Oversight",
    "title": "Justice Department Fires Maurene Comey, Prosecutor on Epstein Case",
    "description": "The Department of Justice dismissed Maurene Comey, daughter of former FBI Director James Comey, without providing a specific reason. Her involvement in high-profile cases, including those against Jeffrey Epstein and Sean \\'Diddy\\' Combs, has raised concerns about potential political motivations behind her termination.",
    "source_url": "https://apnews.com/article/dda5d1f40f08346bd97696ce4791e8ec",
    "verified": true,
    "severity": "high",
    "id": "md7hfdgvpfy0rdmgrv",
    "added_at": "2025-07-17T14:25:14.479Z"
  },
  {
    "date": "2025-07-16",
    "actor": "National Urban League",
    "category": "Government Oversight",
    "title": "Urban League Declares \\'State of Emergency\\' for Civil Rights in Response to Trump Administration",
    "description": "The National Urban League declared a \\'state of emergency\\' for civil rights, accusing the federal government of undermining antidiscrimination policies and curbing personal freedoms. The League highlights a coordinated effort by conservative activists to roll back civil rights achievements and embed extremist ideologies into mainstream politics.",
    "source_url": "https://apnews.com/article/74b79d4dba14a37d487f0504feb066cc",
    "verified": true,
    "severity": "high",
    "id": "md7hfdgve1sx1ho9koc",
    "added_at": "2025-07-17T14:25:14.479Z"
  },
  {
    "date": "2025-07-16",
    "actor": "Department of Justice",
    "category": "Government Oversight",
    "title": "Justice Department Establishes Civil Rights Fraud Initiative",
    "description": "The Department of Justice announced the establishment of the Civil Rights Fraud Initiative, utilizing the False Claims Act to investigate and pursue claims against recipients of federal funds who knowingly violate federal civil rights laws. Violations can result in treble damages and significant penalties.",
    "source_url": "https://www.justice.gov/opa/pr/justice-department-establishes-civil-rights-fraud-initiative",
    "verified": true,
    "severity": "medium",
    "id": "md7hfdgveyqd8b3g5np",
    "added_at": "2025-07-17T14:25:14.479Z"
  },
  {
    "date": "2025-07-16",
    "actor": "Department of Justice",
    "category": "Government Oversight",
    "title": "Justice Department Releases Information on Efforts to Protect the Right to Vote, Prosecute Election Fraud and Secure Elections",
    "description": "The Department of Justice released information detailing its efforts to protect voting rights, prosecute election fraud, and secure elections. This includes guidance on implementing President Trump\\'s Executive Order designating English as the official language of the United States.",
    "source_url": "https://www.justice.gov/opa/pr/justice-department-releases-information-efforts-protect-right-vote-prosecute-election-fraud",
    "verified": true,
    "severity": "medium",
    "id": "md7hfdgvzqbvxsbym8l",
    "added_at": "2025-07-17T14:25:14.479Z"
  },
  {
    "date": "2025-07-16",
    "actor": "U.S. Securities and Exchange Commission (SEC)",
    "category": "Corporate Ethics",
    "title": "SEC Withdraws 14 Pending Rule Proposals",
    "description": "The SEC announced the formal withdrawal of 14 pending rule proposals introduced under former SEC Chair Gary Gensler, including initiatives on outsourcing by investment advisers, safeguarding advisory client assets, and enhanced disclosures of ESG practices. This ends their current rulemaking process.",
    "source_url": "https://www.confluence.com/new-in-regtech-regulatory-reality-check-what-compliance-teams-need-to-know-in-july-2025/",
    "verified": false,
    "severity": "medium",
    "id": "md7gx8efvtczhbw5ze",
    "added_at": "2025-07-17T14:11:08.103Z"
  },
  {
    "date": "2025-07-16",
    "actor": "Hawai`i State Legislature",
    "category": "Campaign Finance",
    "title": "Hawai`i Considers New Pay-to-Play Rules",
    "description": "Hawai`i lawmakers are revisiting pay-to-play rules to curtail campaign donations from government contractors. The Campaign Spending Commission has proposed a bill to ban principals of government contractors and their family members from donating to campaigns during the contract period.",
    "source_url": "https://www.dentons.com/en/insights/newsletters/2025/january/30/political-law-playbook/political-law-playbook-january-2025",
    "verified": false,
    "severity": "medium",
    "id": "md7gx8efbvlrr196iwi",
    "added_at": "2025-07-17T14:11:08.103Z"
  },
  {
    "date": "2025-07-16",
    "actor": "U.S. Office of the Comptroller of the Currency (OCC)",
    "category": "Corporate Ethics",
    "title": "OCC Withdraws from Climate Risk Principles",
    "description": "The OCC withdrew from the interagency principles for climate-related financial risk management for large financial institutions, stating that climate-related risks should already be covered by the OCC’s broader risk management guidance.",
    "source_url": "https://www.pwc.com/us/en/industries/financial-services/library/our-take/04-04-25.html",
    "verified": false,
    "severity": "medium",
    "id": "md7gx8efapjds50rh9k",
    "added_at": "2025-07-17T14:11:08.103Z"
  },
  {
    "date": "2025-07-16",
    "actor": "Elon Musk",
    "category": "Government Contracts",
    "title": "US FAA not considering replacing L3Harris, Verizon contracts with Musk\\'s Starlink",
    "description": "The U.S. Federal Aviation Administration clarified that it is not considering replacing its telecommunications contracts with L3Harris and Verizon with SpaceX\\'s Starlink services, emphasizing the need for reliable air traffic communications.",
    "source_url": "https://www.reuters.com/business/media-telecom/us-faa-not-considering-replacing-l3harris-verizon-contracts-with-musks-starlink-2025-07-16/",
    "verified": true,
    "severity": "medium",
    "id": "md7gx5838b643s3dp2",
    "added_at": "2025-07-17T14:11:03.987Z"
  },
  {
    "date": "2025-07-16",
    "actor": "Elon Musk",
    "category": "Government Efficiency",
    "title": "A Senate vote this week will test the popularity of DOGE spending cuts",
    "description": "The U.S. Senate is set to vote on President Trump\\'s proposed $9.4 billion spending cuts targeting public media and foreign aid, a move that has already been narrowly approved by the House and is now facing scrutiny in the Senate.",
    "source_url": "https://apnews.com/article/c2e049f189923c35c0aa176faa848ceb",
    "verified": true,
    "severity": "medium",
    "id": "md7gx583s3h3p48gzs",
    "added_at": "2025-07-17T14:11:03.987Z"
  },
  {
    "date": "2025-07-16",
    "actor": "Elon Musk",
    "category": "Government Efficiency",
    "title": "Elon Musk\\'s AI Grok Offers Sexualized Anime Bot, Accessible Even in Kid Mode",
    "description": "Elon Musk\\'s AI company xAI introduced \\'Ani,\\' a sexualized anime-style chatbot, which remains accessible in the app\\'s \\'kids mode,\\' raising concerns about user safety and content appropriateness.",
    "source_url": "https://time.com/7302790/grok-ai-chatbot-elon-musk/",
    "verified": false,
    "severity": "high",
    "id": "md7gx582zmuxjhoirli",
    "added_at": "2025-07-17T14:11:03.986Z"
  },
  {
    "date": "2025-07-16",
    "actor": "Federal Employees",
    "category": "Government Efficiency",
    "title": "Federal Workers Share Impact of DOGE Policies in New Audio Series",
    "description": "An audio series titled \\'I Do Solemnly Swear\\' features testimonies from current and former federal employees detailing how DOGE policies have negatively affected agencies like the CDC, FAA, and VA, citing issues such as mass firings and reduced capacity to combat tax evasion.",
    "source_url": "https://www.axios.com/2025/07/16/doge-irs-faa-federal-workers",
    "verified": true,
    "severity": "high",
    "id": "md61i9hhi1zv2ef4b5",
    "added_at": "2025-07-16T14:11:49.253Z"
  },
  {
    "date": "2025-07-16",
    "actor": "U.S. Department of Justice",
    "category": "Government Oversight",
    "title": "DOJ considered charging Minnesota judges over virtual hearings",
    "description": "The U.S. Justice Department considered criminal charges against Minnesota judges and defense lawyers who discussed virtual court hearings to protect undocumented immigrants from arrest by federal immigration officers. An FBI inquiry began in February in Minneapolis, investigating whether virtual hearing requests obstructed immigration enforcement.",
    "source_url": "https://www.reuters.com/legal/government/us-considered-charging-minnesota-judges-lawyers-immigration-crackdown-sources-2025-07-16/",
    "verified": true,
    "severity": "high",
    "id": "md61i8p2rq3jx74rmaf",
    "added_at": "2025-07-16T14:11:48.230Z"
  },
  {
    "date": "2025-07-15",
    "actor": "U.S. Department of Education and Department of Labor",
    "category": "Policy Implementation Changes",
    "title": "Transfer of Workforce Development Programs to Department of Labor",
    "description": "The U.S. Department of Education and the Department of Labor announced a shift in management of key federal workforce development programs. Under an interagency agreement signed on July 15, 2025, adult education and family literacy programs, as well as career and technical education programs, will now be managed by the Department of Labor alongside Education Department staff, marking a significant change in federal education oversight.",
    "source_url": "https://www.k12dive.com/news/week-in-review-july-21-2025/753484/",
    "verified": false,
    "severity": "medium",
    "id": "mdiwz5mphf9gylk68ji",
    "added_at": "2025-07-25T14:25:59.617Z"
  },
  {
    "date": "2025-07-15",
    "actor": "U.S. Attorney’s Office for the District of Columbia",
    "category": "Corporate Ethics",
    "title": "Enforcement of Lobbying Disclosure Act Intensifies",
    "description": "The U.S. Attorney’s Office for the District of Columbia is actively enforcing the Lobbying Disclosure Act, addressing noncompliance by lobbyists and organizations to ensure transparency in lobbying activities.",
    "source_url": "https://files.gao.gov/reports/GAO-25-107523/index.html",
    "verified": true,
    "severity": "medium",
    "id": "mdem8wdxplmg32ki00f",
    "added_at": "2025-07-22T14:14:33.717Z"
  },
  {
    "date": "2025-07-15",
    "actor": "SEIU Healthcare 1199 NW PAC",
    "category": "Corporate Ethics",
    "title": "Washington PAC Fined for Late Reporting of Over $430K in Expenditures",
    "description": "The Washington Public Disclosure Commission imposed a $6,000 fine on SEIU Healthcare 1199 NW PAC for failing to timely report more than $430,000 in expenditures during the 2024 election cycle, highlighting ongoing issues with campaign finance transparency.",
    "source_url": "https://www.pdc.wa.gov/news-events/news/2025/06/26/pdc-imposes-20-000-fine-for-late-reporting-of-more-than-1m-by-ballot-measure-pac",
    "verified": true,
    "severity": "medium",
    "id": "mdem8wdw5qi3yuobg9k",
    "added_at": "2025-07-22T14:14:33.716Z"
  },
  {
    "date": "2025-07-15",
    "actor": "Tennessee Campaign Finance Agency",
    "category": "Corporate Ethics",
    "title": "Investigation Sought into Secret PAC Linked to Former State Staffer",
    "description": "The Tennessee Campaign Finance Agency requested an investigation into the Faith Family Freedom Fund PAC, associated with former state staffer Cade Cothren, to determine potential criminal activity related to undisclosed political contributions.",
    "source_url": "https://www.tennesseelookout.com/2025/06/23/tennessee-campaign-finance-agency-seeks-probe-of-secret-pac/",
    "verified": false,
    "severity": "high",
    "id": "mdem8wdw0ewm6owppurq",
    "added_at": "2025-07-22T14:14:33.716Z"
  },
  {
    "date": "2025-07-15",
    "actor": "U.S. Department of Education",
    "category": "Policy Implementation",
    "title": "Shift of Career and Technical Education to Labor Department",
    "description": "The U.S. Department of Education began transferring management of career and technical education programs to the Department of Labor, following a Supreme Court decision allowing the downsizing of the Department of Education. This move is part of the administration\\'s broader effort to streamline federal education responsibilities.",
    "source_url": "https://www.edweek.org/policy-politics/trump-admin-suddenly-cancels-dozens-of-education-department-contracts/2025/02",
    "verified": false,
    "severity": "medium",
    "id": "mdbr7hex2oeji11jckv",
    "added_at": "2025-07-20T14:10:07.209Z"
  },
  {
    "date": "2025-07-15",
    "actor": "National Republican Senatorial Committee (NRSC)",
    "category": "Corporate Ethics",
    "title": "NRSC Challenges Campaign Finance Restrictions in Supreme Court",
    "description": "The NRSC, along with other Republican entities, filed a lawsuit challenging federal limits on coordinated party expenditures, seeking to overturn longstanding campaign finance restrictions. The Supreme Court agreed to hear the case, which could significantly reshape campaign finance laws and reduce regulatory constraints on political spending.",
    "source_url": "https://www.axios.com/2025/06/30/supreme-court-republican-campaign-finance-restrictions",
    "verified": true,
    "severity": "high",
    "id": "mdac875n3gptkep7w4m",
    "added_at": "2025-07-19T14:23:00.155Z"
  },
  {
    "date": "2025-07-15",
    "actor": "Donald Trump",
    "category": "Financial",
    "title": "Trump secures trade deal with Indonesia",
    "description": "President Trump announced a new trade agreement with Indonesia, aiming to enhance bilateral economic relations and open new markets for American businesses.",
    "source_url": "https://www.nytimes.com/2025/07/15/us/politics/trump-indonesia-trade-deal.html",
    "verified": true,
    "severity": "medium",
    "id": "md8ww4uiys0aywq2n6",
    "added_at": "2025-07-18T14:25:56.874Z"
  },
  {
    "date": "2025-07-15",
    "actor": "Donald Trump",
    "category": "Policy",
    "title": "President Trump Announces $90 Billion Private-Sector Investment in Pennsylvania",
    "description": "On July 15, 2025, President Trump announced a private-sector investment initiative totaling more than $90 billion in Pennsylvania. The investment comes from companies across the technology, energy, and finance sectors, including Anthropic, Blackstone, Brookfield, CoreWeave, BlackRock, Google, Constellation Energy, and Meta.",
    "source_url": "https://en.wikipedia.org/wiki/2025_in_the_United_States",
    "verified": false,
    "severity": "medium",
    "id": "md7hfocuovpmci6d47",
    "added_at": "2025-07-17T14:25:28.590Z"
  },
  {
    "date": "2025-07-15",
    "actor": "Supreme Court of Hawaii",
    "category": "Legal Proceedings",
    "title": "Hawaii Supreme Court issues recent decisions",
    "description": "The Supreme Court of Hawaii released decisions in several cases, including \\'In re: Pumehana Hui LP Dissolution\\' and \\'Carter v. Honolulu Police Department\\', addressing various legal matters within the state.",
    "source_url": "https://law.justia.com/cases/hawaii/supreme-court/2025/",
    "verified": false,
    "severity": "low",
    "id": "md7hfdnajrquoxxcons",
    "added_at": "2025-07-17T14:25:14.710Z"
  },
  {
    "date": "2025-07-15",
    "actor": "National Republican Senatorial Committee (NRSC)",
    "category": "Corporate Ethics",
    "title": "NRSC Challenges Campaign Spending Limits in Supreme Court",
    "description": "The NRSC has petitioned the U.S. Supreme Court to overturn federal limits on coordinated party expenditures, arguing they infringe upon First Amendment rights. The case, National Republican Senatorial Committee v. Federal Election Commission, is currently pending before the Court.",
    "source_url": "https://en.wikipedia.org/wiki/National_Republican_Senatorial_Committee_v._FEC",
    "verified": false,
    "severity": "medium",
    "id": "md7hfbdyppd1ybaf0gr",
    "added_at": "2025-07-17T14:25:11.782Z"
  },
  {
    "date": "2025-07-15",
    "actor": "Attorney General Pam Bondi",
    "category": "Government Oversight",
    "title": "Bondi Declines Action After Trump Suggests Further Epstein Files Release",
    "description": "Attorney General Pam Bondi avoided addressing questions about the Jeffrey Epstein case and reports of conflicts with FBI Deputy Director Dan Bongino. Public dissatisfaction has grown among supporters of Donald Trump due to a memo from the Justice Department and FBI concluding there is no evidence Epstein maintained a \\'client list\\' or was murdered.",
    "source_url": "https://www.axios.com/2025/07/15/bondi-epstein-client-list-trump-administration",
    "verified": true,
    "severity": "medium",
    "id": "md7gx4ekhd41159wv24",
    "added_at": "2025-07-17T14:11:02.924Z"
  },
  {
    "date": "2025-07-15",
    "actor": "U.S. Senate",
    "category": "Leadership Appointments",
    "title": "Senate Confirms Joseph Edlow as USCIS Director",
    "description": "The U.S. Senate confirmed Joseph Edlow as the Director of U.S. Citizenship and Immigration Services, a position he has held in an acting capacity since February 2025. The confirmation was approved with a 52–57 vote.",
    "source_url": "https://en.wikipedia.org/wiki/Political_appointments_of_the_second_Trump_administration",
    "verified": false,
    "severity": "medium",
    "id": "md61z8z5mc11m6nkhpi",
    "added_at": "2025-07-16T14:25:01.745Z"
  },
  {
    "date": "2025-07-15",
    "actor": "Attorney General Pam Bondi",
    "category": "Government Oversight",
    "title": "Bondi avoids Epstein questions amid DOJ turmoil",
    "description": "Attorney General Pam Bondi deflected questions regarding the Justice Department\\'s handling of the Jeffrey Epstein case and internal disputes involving FBI Deputy Director Dan Bongino during a press event focused on drug seizures. She emphasized law enforcement efforts to combat fentanyl and methamphetamine smuggling, seeking to pivot attention away from ongoing controversies.",
    "source_url": "https://apnews.com/article/269d9526d270e6342e82ecae27fe6189",
    "verified": true,
    "severity": "medium",
    "id": "md61i8p2zawinf3rjq",
    "added_at": "2025-07-16T14:11:48.230Z"
  },
  {
    "date": "2025-07-15",
    "actor": "U.S. Department of Justice",
    "category": "Government Oversight",
    "title": "DOJ Initiates Policy to Detain More Immigrants by Denying Bond Hearings",
    "description": "The DOJ has implemented a new policy to detain more immigrants who entered the U.S. illegally by denying them bond hearings. This guidance reinterprets immigration laws to limit release after arrest and encourages ICE prosecutors to push for continued detention, potentially affecting millions contesting deportation. Critics describe this as a significant shift from longstanding legal norms.",
    "source_url": "https://www.reuters.com/world/us/us-launches-new-bid-keep-migrants-detained-by-denying-hearings-memo-shows-2025-07-15/",
    "verified": true,
    "severity": "high",
    "id": "md4m3wr7pvm121xuee",
    "added_at": "2025-07-15T14:12:59.155Z"
  },
  {
    "date": "2025-07-15",
    "actor": "FBI",
    "category": "Government Oversight",
    "title": "FBI Field Offices Ordered to Increase Focus on Immigration Enforcement",
    "description": "FBI field offices nationwide have been directed to significantly increase agent involvement in immigration enforcement operations. The DOJ expects a substantial rise in agents participating in these operations, with specific targets set for major field offices. This directive aligns with broader changes under the Trump administration, which is proposing a 5% cut to the FBI’s budget.",
    "source_url": "https://www.police1.com/fbi-field-offices-ordered-to-shift-focus-assign-more-agents-to-immigration-crackdown",
    "verified": false,
    "severity": "medium",
    "id": "md4m3wr7kugecky7u6l",
    "added_at": "2025-07-15T14:12:59.155Z"
  },
  {
    "date": "2025-07-15",
    "actor": "Weaponization Working Group",
    "category": "Government Oversight",
    "title": "Weaponization Working Group Established to Review \\'Politicized\\' Prosecutions",
    "description": "Attorney General Pam Bondi established the Weaponization Working Group to review instances of \\'politicized\\' prosecutions. The group is led by Ed Martin, who previously praised the January 6 Capitol attack and repeated false claims of fraud in the 2020 presidential election. The establishment of this group marks a significant effort to utilize the federal government against perceived enemies of President Trump.",
    "source_url": "https://en.wikipedia.org/wiki/Weaponization_Working_Group",
    "verified": false,
    "severity": "high",
    "id": "md4m3wr7yvwmk5bgc2",
    "added_at": "2025-07-15T14:12:59.155Z"
  },
  {
    "date": "2025-07-14",
    "actor": "Empower NYC Super PAC",
    "category": "Corporate Ethics",
    "title": "Pro-Eric Adams Super PAC Seeks $10 Million from Crypto Community",
    "description": "The Empower NYC Super PAC, supporting New York City Mayor Eric Adams, aims to raise up to $10 million from the cryptocurrency sector. This initiative has raised concerns among government ethics groups due to potential conflicts of interest and the PAC leader\\'s participation in a Bitcoin conference alongside the mayor.",
    "source_url": "https://www.politico.com/news/2025/07/14/eric-adams-super-pac-crypto-00123456",
    "verified": true,
    "severity": "medium",
    "id": "mdhhlwogxxe80em0gm",
    "added_at": "2025-07-24T14:28:01.072Z"
  },
  {
    "date": "2025-07-14",
    "actor": "New York State Lobbying Firms",
    "category": "Corporate Ethics",
    "title": "Foreign Lobbyists Contribute Over $65,000 to New York Campaigns Since 2020",
    "description": "At least 27 lobbying firms representing 24 foreign entities have contributed more than $65,000 to various New York State candidates and campaign committees since 2020, raising concerns about foreign influence in state politics.",
    "source_url": "https://www.newsday.com/news/region-state/foreign-influence-campaign-contributions-ys4xzocz",
    "verified": false,
    "severity": "high",
    "id": "mdd7aoaijrf2ku6glv",
    "added_at": "2025-07-21T14:28:16.122Z"
  },
  {
    "date": "2025-07-14",
    "actor": "Interfaith Center on Corporate Responsibility (ICCR)",
    "category": "Corporate Ethics",
    "title": "ICCR Files 60 Proposals for Corporate Political Activity Transparency",
    "description": "The ICCR announced the filing of 60 shareholder proposals for the 2025 proxy season, calling for increased disclosures and oversight of corporate political activities. These proposals aim to enhance transparency and accountability in corporate political spending and lobbying efforts.",
    "source_url": "https://www.iccr.org/investors-file-60-proposals-calling-for-transparency-around-corporate-political-activity/",
    "verified": false,
    "severity": "medium",
    "id": "mdac875n114h7qjrovo",
    "added_at": "2025-07-19T14:23:00.155Z"
  },
  {
    "date": "2025-07-14",
    "actor": "U.S. Department of Justice (DOJ)",
    "category": "Corporate Ethics",
    "title": "DOJ Halts Enforcement of Foreign Corrupt Practices Act (FCPA)",
    "description": "The DOJ has suspended FCPA enforcement for at least 180 days, a move that may benefit corporations with ties to the Trump administration, including those that have made significant donations to his inaugural fund.",
    "source_url": "https://www.citizen.org/article/corporate-enforcement-trump-tracker/",
    "verified": false,
    "severity": "high",
    "id": "md8ww6xpq42kmxwtxds",
    "added_at": "2025-07-18T14:25:59.581Z"
  },
  {
    "date": "2025-07-14",
    "actor": "U.S. Court of Appeals for the First Circuit",
    "category": "Corporate Ethics",
    "title": "Maine\\'s Foreign Election Spending Ban Likely Unconstitutional",
    "description": "The court ruled that Maine\\'s 2023 law prohibiting foreign government-influenced entities from donating to state and local ballot measures is likely unconstitutional, affirming a lower court\\'s temporary stay on enforcement. The case will return to the lower court for further proceedings.",
    "source_url": "https://stateandfed.com/campaign-finance/news-you-can-use-digest-july-18-2025/",
    "verified": false,
    "severity": "medium",
    "id": "md8wfb7ajegkzdss7ce",
    "added_at": "2025-07-18T14:12:51.958Z"
  },
  {
    "date": "2025-07-14",
    "actor": "U.S. Supreme Court",
    "category": "Legal Proceedings",
    "title": "Supreme Court declines to hear cases on nationwide injunctions",
    "description": "The Supreme Court declined to hear cases challenging the use of nationwide injunctions, leaving lower court decisions intact and maintaining the status quo on this legal practice.",
    "source_url": "https://www.scotusblog.com/2025/06/the-cases-that-remain/",
    "verified": false,
    "severity": "medium",
    "id": "md7hfdnafqamqdqt9bh",
    "added_at": "2025-07-17T14:25:14.710Z"
  },
  {
    "date": "2025-07-14",
    "actor": "U.S. Department of Education",
    "category": "Government Oversight",
    "title": "Education Department to End Diversity, Equity, and Inclusion Programs",
    "description": "The Department of Education announced the termination of its Environmental Justice and Diversity, Equity, and Inclusion arms, signaling a shift in the agency\\'s approach to addressing systemic inequalities in education.",
    "source_url": "https://foleyhoag.com/federal-actions/",
    "verified": false,
    "severity": "medium",
    "id": "md7hfcrt6pba0i3vt05",
    "added_at": "2025-07-17T14:25:13.577Z"
  },
  {
    "date": "2025-07-14",
    "actor": "Colorado Attorney General Phil Weiser",
    "category": "Government Oversight",
    "title": "Colorado AG Files Multiple Lawsuits Against Trump Administration",
    "description": "Since January, Colorado Attorney General Phil Weiser has initiated over two dozen lawsuits challenging various Trump administration policies, including cuts to education and mental health funding, restrictions on Medicaid data, and efforts to dismantle federal agencies. These actions position Colorado at the forefront of state resistance against federal policy changes.",
    "source_url": "https://www.axios.com/local/denver/2025/02/11/colorado-phil-weiser-attorney-general-lawsuits-trump",
    "verified": true,
    "severity": "high",
    "id": "md61z8z5qat2mwjd5zr",
    "added_at": "2025-07-16T14:25:01.745Z"
  },
  {
    "date": "2025-07-14",
    "actor": "Elon Musk",
    "category": "Platform Policy Change",
    "title": "Musk Announces Integration of AI Model \\'Grok\\' into Tesla Vehicles",
    "description": "Elon Musk reveals plans to integrate xAI\\'s \\'Grok\\' AI model into Tesla vehicles, enhancing in-car AI capabilities and user experience.",
    "source_url": "https://www.teslarati.com/spacex-ula-win-multibillion-dollar-military-contract/",
    "verified": false,
    "severity": "medium",
    "id": "md61z8my5nopwauht13",
    "added_at": "2025-07-16T14:25:01.306Z"
  },
  {
    "date": "2025-07-14",
    "actor": "U.S. Supreme Court",
    "category": "Government Oversight",
    "title": "Supreme Court Allows Education Department Layoffs to Proceed",
    "description": "The Supreme Court overturned lower court decisions, permitting the Trump administration to proceed with mass layoffs at the Department of Education, reducing its workforce by nearly half. This decision follows previous legal challenges and raises questions about the future of federal education programs.",
    "source_url": "https://www.nbcnews.com/news/amp/rcna211450",
    "verified": true,
    "severity": "high",
    "id": "md61ib6u977iwa6hucg",
    "added_at": "2025-07-16T14:11:51.462Z"
  },
  {
    "date": "2025-07-14",
    "actor": "Washington State Public Disclosure Commission",
    "category": "Corporate Ethics",
    "title": "SEIU Healthcare 1199 NW PAC Fined for Late Reporting",
    "description": "On May 22, 2025, the Washington State Public Disclosure Commission approved a $6,000 fine against SEIU Healthcare 1199 NW PAC for late reporting of over $430,000 in expenditures during the 2024 election cycle. The PAC failed to file a required last-minute contribution report for a $2,400 contribution made within 21 days of the November election.",
    "source_url": "https://www.pdc.wa.gov/news/2025/commission-meeting-highlights-may-2025",
    "verified": true,
    "severity": "low",
    "id": "md61i9dcf0rv3uvs6xk",
    "added_at": "2025-07-16T14:11:49.104Z"
  },
  {
    "date": "2025-07-14",
    "actor": "Donald Trump Jr. and Eric Trump",
    "category": "Financial",
    "title": "Trump Sons\\' Cryptocurrency Venture Faces Scrutiny Over Foreign Investments",
    "description": "Donald Trump Jr. and Eric Trump, sons of former President Donald Trump, are under scrutiny for their involvement in World Liberty Financial, a cryptocurrency venture that has attracted significant foreign investments. The venture has been linked to Chinese billionaire Justin Sun and an Abu Dhabi-backed investment firm, raising concerns about potential conflicts of interest and the influence of foreign capital on U.S. business operations.",
    "source_url": "https://www.nytimes.com/2025/04/29/us/politics/trump-crypto-world-liberty-financial.html",
    "verified": true,
    "severity": "medium",
    "id": "md4mk1jhu166xvxdbbp",
    "added_at": "2025-07-15T14:25:31.853Z"
  },
  {
    "date": "2025-07-14",
    "actor": "Lara Trump",
    "category": "Media",
    "title": "Lara Trump Hosts New Fox News Show Amid Ethical Concerns",
    "description": "Lara Trump, daughter-in-law of former President Donald Trump, has launched a new opinion show on Fox News titled \\'My View with Lara Trump.\\' The show has received mixed reactions, with critics raising concerns about potential conflicts of interest due to her familial ties to the sitting president and the blurring of lines between journalism and political influence.",
    "source_url": "https://www.newyorker.com/news/our-columnists/fox-news-lara-trump",
    "verified": false,
    "severity": "medium",
    "id": "md4mk1jhj4p36fhiogh",
    "added_at": "2025-07-15T14:25:31.853Z"
  },
  {
    "date": "2025-07-14",
    "actor": "U.S. Supreme Court",
    "category": "Legal Proceedings",
    "title": "Supreme Court allows Trump to lay off nearly 1,400 Education Department employees",
    "description": "The U.S. Supreme Court permitted President Donald Trump to proceed with plans to reduce the Department of Education\\'s workforce by nearly 1,400 employees, overturning a lower court\\'s injunction. Critics argue this move could disrupt the department\\'s ability to support public education and enforce civil rights laws.",
    "source_url": "https://apnews.com/article/9370415531185092341b16a6bfea9344",
    "verified": true,
    "severity": "high",
    "id": "md4m3v6lwxx53k9ypc",
    "added_at": "2025-07-15T14:12:57.117Z"
  },
  {
    "date": "2025-07-14",
    "actor": "U.S. Supreme Court",
    "category": "Legal Proceedings",
    "title": "Supreme Court clears way for Trump to gut Education Department",
    "description": "The Supreme Court lifted a lower court\\'s injunction, allowing the Trump administration to continue dismantling the Department of Education. This decision faced dissent from liberal justices and criticism from those concerned about the impact on public education and civil rights enforcement.",
    "source_url": "https://www.reuters.com/legal/litigation/us-supreme-court-clears-way-trump-gut-education-department-2025-07-14/",
    "verified": true,
    "severity": "high",
    "id": "md4m3v6ln0s5lprluj",
    "added_at": "2025-07-15T14:12:57.117Z"
  },
  {
    "date": "2025-07-14",
    "actor": "U.S. Supreme Court",
    "category": "Legal Proceedings",
    "title": "Supreme Court gives Trump green light to fire Education Department workers",
    "description": "The Supreme Court ruled in favor of President Trump, allowing his administration to proceed with layoffs at the Department of Education. This decision overturned a prior federal judge’s order and was criticized by liberal justices as enabling the president\\'s disregard for legal norms.",
    "source_url": "https://www.axios.com/2025/07/14/supreme-court-education-department-layoffs",
    "verified": true,
    "severity": "high",
    "id": "md4m3v6l65ni9u35a1r",
    "added_at": "2025-07-15T14:12:57.117Z"
  },
  {
    "date": "2025-07-14",
    "actor": "Legal Experts",
    "category": "Legal Analysis",
    "title": "Analysis of Supreme Court\\'s 2024-2025 Regulatory Term",
    "description": "Legal scholars discuss the Supreme Court\\'s recent term, highlighting decisions on religious liberty, gender transition treatments for minors, and the limitations of nationwide injunctions. The term reflects the Court\\'s evolving approach to constitutional interpretation and federal authority.",
    "source_url": "https://www.theregreview.org/2025/07/14/the-supreme-courts-2024-2025-regulatory-term/",
    "verified": false,
    "severity": "medium",
    "id": "md4m3v6l1r0nolsj4be",
    "added_at": "2025-07-15T14:12:57.117Z"
  },
  {
    "date": "2025-07-14",
    "actor": "EPA",
    "category": "Government Oversight",
    "title": "EPA Announces Staff Reductions to 1980s Levels",
    "description": "The Environmental Protection Agency plans to cut its budget by $300 million and reduce staffing to levels last seen in the 1980s. The agency will dissolve its Office of Research and Development, aiming to streamline operations and align with the administration\\'s policy goals.",
    "source_url": "https://www.reuters.com/business/world-at-work/us-epa-plans-reduce-staff-1980s-levels-cut-budget-by-300-million-2025-05-02/",
    "verified": true,
    "severity": "medium",
    "id": "md4m3u5kifzqb5ent8n",
    "added_at": "2025-07-15T14:12:55.784Z"
  },
  {
    "date": "2025-07-14",
    "actor": "EPA",
    "category": "Government Oversight",
    "title": "EPA Terminates Over 300 Employees Amid Restructuring",
    "description": "The EPA has terminated over 300 probationary employees, including staff responsible for enforcing environmental regulations. This action could delay critical oversight functions and compromise timely responses to pollution and disaster events.",
    "source_url": "https://en.wikipedia.org/wiki/2025_United_States_federal_mass_layoffs",
    "verified": false,
    "severity": "high",
    "id": "md4m3u5k3wed4d4dp4b",
    "added_at": "2025-07-15T14:12:55.784Z"
  },
  {
    "date": "2025-07-14",
    "actor": "Pam Bondi",
    "category": "Legal",
    "title": "Attorney General Pam Bondi Dismisses DOJ Ethics Director Amid Purge",
    "description": "On July 14, 2025, Attorney General Pam Bondi dismissed Joseph Tirrell, the ethics director at the Department of Justice, coinciding with the removal of over 20 employees associated with investigations into former President Donald Trump. The dismissals are part of a broader personnel purge within the DOJ, raising concerns about political interference and the undermining of traditional ethics oversight within the department.",
    "source_url": "https://www.axios.com/2025/07/14/pam-bondi-fires-ethics-chief-doj-purge",
    "verified": true,
    "severity": "high",
    "id": "md4m3u4tctba5vipd7r",
    "added_at": "2025-07-15T14:12:55.757Z"
  },
  {
    "date": "2025-07-14",
    "actor": "xAI",
    "category": "Government Contracts",
    "title": "xAI Announces Partnership with U.S. Government",
    "description": "xAI has announced a suite of products making its frontier AI models available to U.S. government customers, including a new Department of Defense contract. Additionally, all federal departments can now purchase xAI\\'s products via the General Services Administration schedule.",
    "source_url": "https://www.nasdaq.com/articles/government-contract-update-elon-musks-xai-announces-partnership-us-government",
    "verified": false,
    "severity": "medium",
    "id": "md4m3s798hw08cxusm",
    "added_at": "2025-07-15T14:12:53.253Z"
  },
  {
    "date": "2025-07-14",
    "actor": "FEC",
    "category": "Corporate Ethics",
    "title": "FEC Closes Case Involving Calspan Corporation\\'s Illegal Contributions",
    "description": "The Federal Election Commission (FEC) closed a case involving Calspan Corporation, which had used company funds to reimburse executives for $14,900 in federal contributions between 2019 and 2023 while holding active federal government contracts. The FEC entered into a conciliation agreement, requiring the respondents to cease and desist from further violations and to pay a joint civil penalty of $25,000. Calspan also agreed to notify each recipient political committee about the illegal contributions made in the names of others.",
    "source_url": "https://www.fec.gov/updates/week-of-may-12-16-2025/",
    "verified": true,
    "severity": "high",
    "id": "md3i293bvukwuru2ynj",
    "added_at": "2025-07-14T19:31:57.191Z"
  },
  {
    "date": "2025-07-14",
    "actor": "Elon Musk and President Trump",
    "category": "Public Statements on Government Policy",
    "title": "Elon Musk Says DOGE Will Save Government $150 Billion Next Fiscal Year",
    "description": "Elon Musk, leading the Department of Government Efficiency, projects $150 billion in savings for the next fiscal year through the reduction of waste and fraud, though this figure is lower than his previous estimate of $1 trillion.",
    "source_url": "https://www.forbes.com/sites/mollybohannon/2025/04/10/elon-musk-says-doge-will-produce-savings-of-150-billion-in-fy2026/",
    "verified": true,
    "severity": "medium",
    "id": "md3i27z6cuep138gftn",
    "added_at": "2025-07-14T19:31:55.746Z"
  },
  {
    "date": "2025-07-14",
    "actor": "Elon Musk and President Trump",
    "category": "Public Statements on Government Policy",
    "title": "Elon Musk ends DOGE role after cutting estimated $175 billion in government spending",
    "description": "Elon Musk concluded his tenure at the Department of Government Efficiency, claiming to have saved $175 billion through various cost-cutting measures, including contract cancellations and workforce reductions.",
    "source_url": "https://www.foxnews.com/politics/musk-confident-doge-save-1-trillion-government-cost-cutting-continues",
    "verified": true,
    "severity": "medium",
    "id": "md3i27z6e0mcmaduk4t",
    "added_at": "2025-07-14T19:31:55.746Z"
  },
  {
    "date": "2025-07-14",
    "actor": "Trump Administration",
    "category": "Legal",
    "title": "Trump Administration Dismisses DOJ Employees Involved in Jack Smith\\'s Prosecutions",
    "description": "The Trump administration dismissed nearly 10 Department of Justice employees who worked on former Special Counsel Jack Smith\\'s prosecutions of Donald Trump, raising concerns about adherence to civil service protections. Additionally, Attorney General Pam Bondi dismissed her personal ethics adviser, Joseph Tirrell, who had previously advised Smith\\'s office on ethics matters during Trump\\'s criminal prosecutions.",
    "source_url": "https://www.justsecurity.org/116986/early-edition-july-14-2025/",
    "verified": false,
    "severity": "high",
    "id": "md3i26mmao62ducaw1c",
    "added_at": "2025-07-14T19:31:53.998Z"
  },
  {
    "date": "2025-07-14",
    "actor": "New York City Mayor Eric Adams",
    "category": "Corporate Ethics",
    "title": "Excessive Contributions in Eric Adams\\' Campaign Raise Concerns",
    "description": "Investigations revealed that Mayor Eric Adams\\' 2021 campaign accepted donations exceeding legal limits from individuals and entities on the city\\'s \\'doing business\\' list, leading to refunds and raising questions about campaign finance oversight.",
    "source_url": "https://www.thecity.nyc/2024/07/19/eric-adams-2025-campaign-donor-doing-business/",
    "verified": false,
    "severity": "high",
    "id": "md3gzwkur56knoe9ff9",
    "added_at": "2025-07-14T19:02:08.046Z"
  },
  {
    "date": "2025-07-14",
    "actor": "xAI",
    "category": "Government Contracts",
    "title": "xAI Secures $200 Million Pentagon Contract",
    "description": "Elon Musk\\'s AI company, xAI, announced a $200 million contract with the U.S. Department of Defense to integrate its AI model, Grok, into military operations, enhancing national security capabilities.",
    "source_url": "https://www.axios.com/2025/07/14/xai-pentagon-grok-contract",
    "verified": true,
    "severity": "medium",
    "id": "md3g99mdkiz6azgceuo",
    "added_at": "2025-07-14T18:41:25.237Z"
  },
  {
    "date": "2025-07-14",
    "actor": "xAI",
    "category": "Government Contracts",
    "title": "U.S. Department of Defense Awards $200 Million AI Contracts",
    "description": "The Department of Defense awarded contracts worth up to $200 million each to AI firms, including Elon Musk\\'s xAI, to develop advanced AI capabilities for national security, marking a significant integration of AI in defense strategies.",
    "source_url": "https://www.reuters.com/business/autos-transportation/us-department-defense-awards-contracts-google-xai-2025-07-14/",
    "verified": true,
    "severity": "medium",
    "id": "md3g99md35ugvr0pm7r",
    "added_at": "2025-07-14T18:41:25.237Z"
  },
  {
    "date": "2025-07-14",
    "actor": "Reform UK",
    "category": "Government Efficiency Recommendations",
    "title": "Reform UK\\'s \\'Doge\\' Unit Faces Data Access Challenges",
    "description": "Reform UK\\'s Department of Government Efficiency, informally known as the \\'Doge\\' unit, is encountering resistance from local councils over access to sensitive data, hindering its efforts to implement cost-cutting measures inspired by Elon Musk\\'s initiatives.",
    "source_url": "https://www.ft.com/content/201924c2-900a-4b95-b8ce-38b5234133ba",
    "verified": false,
    "severity": "medium",
    "id": "md3g99mdg8ey8x6tnq4",
    "added_at": "2025-07-14T18:41:25.237Z"
  },
  {
    "date": "2025-07-14",
    "actor": "President Donald Trump and Deputy FBI Director Dan Bongino",
    "category": "Government Oversight",
    "title": "Trump Confirms Conversation with FBI\\'s Bongino Amid Epstein Controversy",
    "description": "President Trump confirmed speaking with Deputy FBI Director Dan Bongino regarding the Justice Department\\'s handling of Jeffrey Epstein\\'s death investigation. Bongino, aligned with Trump\\'s conservative base, has faced internal tensions and considered resignation over the case. The controversy intensified after the FBI and Justice Department issued a joint memo dismissing conspiracy theories surrounding Epstein\\'s death and alleged clientele, contradicting earlier statements from officials like Attorney General Pam Bondi.",
    "source_url": "https://www.reuters.com/world/us/trump-says-he-spoke-fbis-bongino-amid-epstein-uproar-2025-07-14/",
    "verified": true,
    "severity": "medium",
    "id": "md37606ba8fhrrx9o4",
    "added_at": "2025-07-14T14:26:56.483Z"
  },
  {
    "date": "2025-07-14",
    "actor": "U.S. Department of Justice\\'s Federal Programs Branch",
    "category": "Government Oversight",
    "title": "Mass Resignations in DOJ Unit Defending Trump Policies",
    "description": "Nearly two-thirds of attorneys in the DOJ\\'s Federal Programs Branch, responsible for defending Trump administration policies in court, have resigned since Trump\\'s re-election. The departures are driven by low morale, exhaustion from defending controversial policies, and concerns over potential ethical violations. The DOJ has responded by reassigning lawyers and bringing in numerous political appointees to fill the vacancies.",
    "source_url": "https://www.reuters.com/legal/litigation/two-thirds-doj-unit-defending-trump-policies-court-have-quit-2025-07-14/",
    "verified": true,
    "severity": "high",
    "id": "md37606bv4pfplfyref",
    "added_at": "2025-07-14T14:26:56.483Z"
  },
  {
    "date": "2025-07-14",
    "actor": "Elon Musk",
    "category": "Platform Manipulation",
    "title": "Elon Musk Launches \\'America Party\\' Amid Tensions with Trump",
    "description": "Elon Musk announced the formation of the \\'America Party\\' in response to President Trump\\'s recent fiscal policies, aiming to challenge the existing political duopoly. This move has intensified tensions between Musk and Trump, with potential implications for Musk\\'s business interests and government contracts.",
    "source_url": "https://theweek.com/politics/elon-musk-america-party",
    "verified": false,
    "severity": "high",
    "id": "md375z9xb4l8abxz09",
    "added_at": "2025-07-14T14:26:55.317Z"
  },
  {
    "date": "2025-07-14",
    "actor": "Elon Musk",
    "category": "Platform Manipulation",
    "title": "Tesla Shares Decline Following Musk\\'s Political Announcement",
    "description": "Tesla shares dropped 6.8% on July 7, 2025, following CEO Elon Musk\\'s announcement to form a new political party. Analysts express concern that Musk\\'s political focus may distract from Tesla\\'s business challenges and affect investor confidence.",
    "source_url": "https://www.ft.com/content/b69a2f75-9e36-4cca-b8cc-5ead166408c5",
    "verified": false,
    "severity": "medium",
    "id": "md36ocxblpsci5aoyk",
    "added_at": "2025-07-14T14:13:13.199Z"
  },
  {
    "date": "2025-07-14",
    "actor": "Elon Musk",
    "category": "Platform Manipulation",
    "title": "Musk Criticizes Trump\\'s Tax Plan Amid Political Tensions",
    "description": "Elon Musk has publicly criticized former President Donald Trump\\'s tax plan, calling it a \\'disgusting abomination.\\' This criticism has led to a deterioration in the relationship between Musk and Trump, with potential implications for Musk\\'s business interests.",
    "source_url": "https://as.com/us/actualidad/asi-se-destruyo-la-buena-relacion-entre-trump-y-elon-musk-las-durisimas-acusaciones-entre-el-magnate-y-el-presidente-de-eeuu-n/",
    "verified": false,
    "severity": "medium",
    "id": "md36ocxbf2c7edhogom",
    "added_at": "2025-07-14T14:13:13.199Z"
  },
  {
    "date": "2025-07-14",
    "actor": "Elon Musk",
    "category": "Platform Manipulation",
    "title": "Musk\\'s \\'America Party\\' Faces Scrutiny Over Legitimacy",
    "description": "Elon Musk\\'s announcement of the \\'America Party\\' has been met with skepticism regarding its legitimacy, as there are no official filings or clear evidence of its formation. This raises questions about Musk\\'s political intentions and their potential impact on his business ventures.",
    "source_url": "https://apnews.com/article/ab901b0d49d46b7b383edbbf5be0a75a",
    "verified": false,
    "severity": "medium",
    "id": "md36ocxbvk86o3dr0tb",
    "added_at": "2025-07-14T14:13:13.199Z"
  },
  {
    "date": "2025-07-13",
    "actor": "Senator Sheldon Whitehouse and European Parliament Members",
    "category": "Corporate Ethics",
    "title": "Call for Lobbying Disclosure and Conflict-of-Interest Policies",
    "description": "Senator Sheldon Whitehouse, along with nine other members of Congress and the European Parliament, urged international leaders to implement conflict-of-interest policies and mandate the disclosure of lobbying activities. This initiative aims to prevent industry obstruction in negotiations related to plastic pollution.",
    "source_url": "https://www.whitehouse.senate.gov/news/release/whitehouse-and-transatlantic-climate-leaders-call-for-lobbying-disclosure-requirements-and-conflict-of-interest-policies-to-prevent-industry-obstruction/",
    "verified": true,
    "severity": "medium",
    "id": "mdac875nteviojh2i1",
    "added_at": "2025-07-19T14:23:00.155Z"
  },
  {
    "date": "2025-07-13",
    "actor": "U.S. Supreme Court",
    "category": "Legal Proceedings",
    "title": "Supreme Court\\'s \\'Shadow Docket\\' Benefits Trump Administration",
    "description": "The Supreme Court\\'s expedited \\'shadow docket\\' has facilitated the Trump administration\\'s implementation of controversial policies, including mass deportations and dismissals of federal workers. This process bypasses standard legal procedures, leading to rapid policy enactments. Critics argue that it undermines the rule of law and judicial independence, while the administration defends it as a necessary response to lower court obstructions.",
    "source_url": "https://www.axios.com/2025/07/13/trump-supreme-court-shadow-emergency-docket",
    "verified": true,
    "severity": "high",
    "id": "md61iampsjegb0w871o",
    "added_at": "2025-07-16T14:11:50.737Z"
  },
  {
    "date": "2025-07-13",
    "actor": "Financial Stability Board",
    "category": "Corporate Ethics",
    "title": "FSB Releases Recommendations on Nonbank Financial Institution Leverage",
    "description": "The Financial Stability Board issued a report on July 9, 2025, providing non-binding recommendations to address risks associated with leverage in nonbank financial institutions (NBFIs) such as hedge funds, pension funds, and insurers. The report emphasizes the need for coordinated implementation of frameworks to mitigate market disruption risks and reduce reliance on central bank interventions.",
    "source_url": "https://www.pwc.com/us/en/industries/financial-services/library/our-take/07-11-2025.html",
    "verified": false,
    "severity": "medium",
    "id": "md61i9dcifo8oil3v2n",
    "added_at": "2025-07-16T14:11:49.104Z"
  },
  {
    "date": "2025-07-13",
    "actor": "Phillip Taylor and Nonprofit Organizations",
    "category": "Corporate Ethics",
    "title": "Legal Challenge to Corporate Transparency Act\\'s Reporting Requirements",
    "description": "A lawsuit filed by Phillip Taylor and several nonprofits in Utah challenges the constitutionality of the Corporate Transparency Act, which mandates beneficial ownership reporting, citing violations of privacy and due process rights.",
    "source_url": "https://tax.thomsonreuters.com/news/pushback-against-corporate-transparency-act-filing-requirements-continues/",
    "verified": true,
    "severity": "medium",
    "id": "md3gzwkuwut9y9h80pc",
    "added_at": "2025-07-14T19:02:08.046Z"
  },
  {
    "date": "2025-07-13",
    "actor": "Trump Administration",
    "category": "Government Oversight",
    "title": "Administration Defends Immigration Tactics After California Worker Death",
    "description": "The Trump administration defended its intensified immigration enforcement tactics following a controversial raid on a California cannabis farm that resulted in the death of a farmworker. Homeland Security Secretary Kristi Noem and Border Czar Tom Homan emphasized plans to appeal a federal judge’s ruling that blocked the use of racial profiling and denial of legal counsel during detentions. The raid sparked protests and criticism from Democratic lawmakers.",
    "source_url": "https://www.reuters.com/world/us/trump-administration-defends-immigration-tactics-after-california-worker-death-2025-07-13/",
    "verified": true,
    "severity": "medium",
    "id": "md37606byke34jfa1q",
    "added_at": "2025-07-14T14:26:56.483Z"
  },
  {
    "date": "2025-07-13",
    "actor": "Obra Capital Management",
    "category": "Corporate Ethics",
    "title": "SEC Fines Texas Investment Adviser for Pay-to-Play Rule Breach",
    "description": "The SEC fined Obra Capital Management $95,000 for violating the pay-to-play rule by making a $7,150 campaign contribution to a Michigan official with influence over the Michigan Public Employees’ Retirement Fund, which had invested in a fund managed by Obra Capital.",
    "source_url": "https://www.dentons.com/en/insights/newsletters/2024/september/27/political-law-playbook/political-law-playbook-september-2024",
    "verified": false,
    "severity": "medium",
    "id": "md375wvbovfmz1edsg",
    "added_at": "2025-07-14T14:26:52.199Z"
  },
  {
    "date": "2025-07-13",
    "actor": "President Donald Trump",
    "category": "Political Interference Concerns",
    "title": "Trump defends Bondi amid backlash over Epstein files",
    "description": "President Trump publicly defended Attorney General Pam Bondi amid criticism over the DOJ\\'s handling of the Jeffrey Epstein case, dismissing concerns and urging unity among his supporters. The controversy intensified after a DOJ and FBI memo concluded there was no incriminating client list or evidence of Epstein blackmailing prominent individuals, contradicting conspiracy theories.",
    "source_url": "https://www.reuters.com/world/us/trump-defends-bondi-amid-backlash-over-epstein-files-2025-07-13/",
    "verified": true,
    "severity": "medium",
    "id": "md28mzuy663ducxvpvu",
    "added_at": "2025-07-13T22:20:22.666Z"
  },
  {
    "date": "2025-07-13",
    "actor": "Department of Justice",
    "category": "Policy Shifts in Enforcement Priorities",
    "title": "Justice Dept. fires more prosecutors, support staff involved in Trump prosecutions",
    "description": "The DOJ dismissed additional lawyers and support personnel involved in Special Counsel Jack Smith\\'s prosecutions of President Trump, affecting staff from both the classified documents and election interference cases. This follows a broader wave of firings targeting personnel linked to cases involving Trump and his supporters.",
    "source_url": "https://apnews.com/article/af94503d10143f5464559fb503425f4f",
    "verified": false,
    "severity": "high",
    "id": "md28mzuymyg1biybzhj",
    "added_at": "2025-07-13T22:20:22.666Z"
  },
  {
    "date": "2025-07-13",
    "actor": "U.S. Department of Education",
    "category": "Policy Implementation Changes",
    "title": "Federal Judge Blocks Education Department Closure Amid Legal Challenges",
    "description": "A federal judge issued a preliminary injunction halting the Trump administration\\'s efforts to shut down the Department of Education, citing the need for congressional approval and questioning the administration\\'s justification for the closure.",
    "source_url": "https://www.axios.com/2025/05/22/trump-education-department-closing",
    "verified": true,
    "severity": "high",
    "id": "md289buwd1jeyplr4tw",
    "added_at": "2025-07-13T22:09:45.032Z"
  },
  {
    "date": "2025-07-13",
    "actor": "U.S. Department of Education",
    "category": "Budget or Operational Changes",
    "title": "Education Department Announces Major Workforce Reduction Amid Closure Plans",
    "description": "The Department of Education plans to lay off over 1,300 employees as part of a reorganization, raising concerns about the agency\\'s ability to continue its operations effectively.",
    "source_url": "https://www.koat.com/article/education-department-layoffs-federal-cuts/64153175",
    "verified": false,
    "severity": "medium",
    "id": "md289buwzgv6m4ngmd",
    "added_at": "2025-07-13T22:09:45.032Z"
  },
  {
    "date": "2025-07-13",
    "actor": "U.S. Department of Education",
    "category": "Leadership Appointments",
    "title": "Retirement of FSA Chief Operating Officer",
    "description": "Denise Carter, Chief Operating Officer of the Office of Federal Student Aid, announced her retirement after 30 years in federal service, with James Bergeron appointed as Acting COO.",
    "source_url": "https://educationcounsel.com/our_work/e-updates/all/e-update-for-april-14-2025",
    "verified": false,
    "severity": "medium",
    "id": "md26zg7b6k0e36vefhe",
    "added_at": "2025-07-13T21:34:04.487Z"
  },
  {
    "date": "2025-07-13",
    "actor": "U.S. Department of Education",
    "category": "Budget or Operational Changes",
    "title": "Budget Cuts Impacting Educational Research",
    "description": "The Department of Government Efficiency (DOGE) initiated nearly $900 million in budget cuts to the Institute of Education Sciences, leading to the termination of at least 169 contracts and raising concerns about the future of educational research.",
    "source_url": "https://apnews.com/article/4461d7bdbe9d55c5a411d8465999b011",
    "verified": false,
    "severity": "medium",
    "id": "md26zg7b0gou0cj1prt",
    "added_at": "2025-07-13T21:34:04.487Z"
  },
  {
    "date": "2025-07-13",
    "actor": "U.S. Department of Education",
    "category": "Policy Implementation Changes",
    "title": "Plan to Dismantle Education Department Announced",
    "description": "President Donald Trump signed an executive order to dismantle the U.S. Education Department, aiming to reduce federal involvement in education while retaining core functions like Title I funding and Pell grants.",
    "source_url": "https://apnews.com/article/b1d25a2e1bdcd24cfde8ad8b655b9843",
    "verified": false,
    "severity": "high",
    "id": "md26zg7bn7wcqnimod",
    "added_at": "2025-07-13T21:34:04.487Z"
  },
  {
    "date": "2025-07-13",
    "actor": "U.S. Supreme Court",
    "category": "Legal Proceedings",
    "title": "Supreme Court Denies Certiorari in High-Profile Cases",
    "description": "The Supreme Court declined to hear several significant cases, including appeals related to voting rights and environmental regulations, leaving lower court decisions intact.",
    "source_url": "https://www.supremecourt.gov/orders/courtorders/071320.pdf",
    "verified": false,
    "severity": "medium",
    "id": "md26zebvlvfq7keii",
    "added_at": "2025-07-13T21:34:02.059Z"
  },
  {
    "date": "2025-07-12",
    "actor": "Citizens for Responsibility and Ethics in Washington (CREW)",
    "category": "Corporate Ethics",
    "title": "Project 2025 Proposes Weakened Campaign Finance Laws",
    "description": "CREW reported that Project 2025, a policy framework associated with former Trump administration officials, proposes significant changes to the Federal Election Commission\\'s structure and processes. The plan aims to weaken campaign finance laws and increase the influence of wealthy donors in elections.",
    "source_url": "https://www.citizensforethics.org/reports-investigations/crew-investigations/trump-tied-project-2025-would-weaken-campaign-finance-laws-and-give-big-donors-more-power/",
    "verified": false,
    "severity": "high",
    "id": "mdac875notcsq0rqus",
    "added_at": "2025-07-19T14:23:00.155Z"
  },
  {
    "date": "2025-07-12",
    "actor": "Tesla",
    "category": "Platform Manipulation",
    "title": "Tesla Integrates xAI\\'s Grok AI into Vehicles",
    "description": "Tesla has begun rolling out Grok, an in-car conversational AI assistant developed by xAI, to eligible vehicles starting July 12. This integration offers drivers hands-free access to a chat-style companion while on the road, marking a significant collaboration between Musk\\'s companies.",
    "source_url": "https://www.teslarati.com/elon-musk-twitter-over-1-billion-monthly-users-2-years/",
    "verified": false,
    "severity": "low",
    "id": "md4m3s79cr0bllp8b0h",
    "added_at": "2025-07-15T14:12:53.253Z"
  },
  {
    "date": "2025-07-12",
    "actor": "Federal Judge Maame E. Frimpong",
    "category": "Legal Proceedings",
    "title": "Judge Halts Indiscriminate Immigration Stops in California",
    "description": "A federal judge ordered the Trump administration to cease indiscriminate immigration stops and arrests in seven California counties, including Los Angeles, due to allegations of unconstitutional practices. The lawsuit accused federal agents of targeting individuals based on race and conducting warrantless arrests, violating the Fourth and Fifth Amendments. The ruling mandates attorney access at a downtown LA detention facility and temporarily prohibits federal use of race, language, or occupation as sole bases for immigration suspicion.",
    "source_url": "https://apnews.com/article/b4d59afc4aa6be4944e67f773aa34096",
    "verified": false,
    "severity": "high",
    "id": "md3gznfrifayxwukkqm",
    "added_at": "2025-07-14T19:01:56.199Z"
  },
  {
    "date": "2025-07-12",
    "actor": "Department of Homeland Security (DHS)",
    "category": "Policy Implementation Changes",
    "title": "DHS to Phase Out Parole Programs",
    "description": "Acting DHS Secretary Benjamine Huffman announced the termination of parole programs established under the previous administration, including the CHNV program and the CBP One app, aiming to return the program to a case-by-case basis.",
    "source_url": "https://www.epi.org/policywatch",
    "verified": false,
    "severity": "medium",
    "id": "md37608fyjs06irpt8",
    "added_at": "2025-07-14T14:26:56.559Z"
  },
  {
    "date": "2025-07-12",
    "actor": "Environmental Protection Agency (EPA)",
    "category": "Regulatory Actions or Rollbacks",
    "title": "EPA Launches Major Deregulatory Initiative",
    "description": "EPA Administrator Lee Zeldin announced plans to undertake 31 deregulatory actions, including reconsidering the 2009 greenhouse gas Endangerment Finding, marking a significant shift in environmental policy.",
    "source_url": "https://www.foleyhoag.com/election-2024/",
    "verified": false,
    "severity": "high",
    "id": "md37608fa4ghwk2gfof",
    "added_at": "2025-07-14T14:26:56.559Z"
  },
  {
    "date": "2025-07-12",
    "actor": "Department of Education (USED)",
    "category": "Leadership Appointments or Departures",
    "title": "Retirement of FSA Chief Operating Officer Denise Carter",
    "description": "Denise Carter, Chief Operating Officer of the Office of Federal Student Aid and former Acting Secretary of Education, announced her retirement after 30 years in federal service, effective April 2, 2025.",
    "source_url": "https://www.educationcounsel.com/our_work/e-updates/all/e-update-for-april-14-2025",
    "verified": false,
    "severity": "medium",
    "id": "md37608fhbksxlp68mv",
    "added_at": "2025-07-14T14:26:56.559Z"
  },
  {
    "date": "2025-07-12",
    "actor": "U.S. Attorney General Pam Bondi",
    "category": "Government Oversight",
    "title": "Justice Department Fires Employees from Jack Smith\\'s Team",
    "description": "Attorney General Pam Bondi dismissed several employees associated with Special Counsel Jack Smith\\'s investigation into former President Trump\\'s retention of classified documents and efforts to overturn the 2020 election. Approximately 20 staff members, including lawyers and support personnel, were terminated, adding to at least 37 people removed since Trump took office. The dismissals target those involved in investigations related to Trump and the January 6 Capitol riot.",
    "source_url": "https://www.reuters.com/world/us/us-justice-fires-nine-more-employees-jack-smiths-team-sources-say-2025-07-12/",
    "verified": true,
    "severity": "high",
    "id": "md37606bz2zrfs4vmwq",
    "added_at": "2025-07-14T14:26:56.483Z"
  },
  {
    "date": "2025-07-12",
    "actor": "Elon Musk",
    "category": "Platform Manipulation",
    "title": "DOGE\\'s Cost-Cutting Measures Face Legal Challenges",
    "description": "The Department of Government Efficiency (DOGE), led by Elon Musk, is facing legal objections over its aggressive cost-cutting initiatives, including the downsizing of federal agencies. Critics argue that these actions may violate federal laws and constitutional rights, leading to potential legal consequences.",
    "source_url": "https://www.theguardian.com/us-news/2025/feb/10/elon-musk-doge-agency-illegal",
    "verified": false,
    "severity": "high",
    "id": "md375z9xc6asn8kvwve",
    "added_at": "2025-07-14T14:26:55.317Z"
  },
  {
    "date": "2025-07-12",
    "actor": "Allieu Kamara",
    "category": "Corporate Ethics",
    "title": "DC Contractor Pleads Guilty to Bribing City Officials",
    "description": "Allieu Kamara, a DC contractor, pleaded guilty to bribing a contract specialist at the DC Child and Family Services Agency to rig $2 million in contracts in his favor, leading to a broader investigation into alleged pay-to-play schemes in the DC government.",
    "source_url": "https://www.dentons.com/en/insights/newsletters/2024/october/30/political-law-playbook/political-law-playbook-october-2024",
    "verified": false,
    "severity": "high",
    "id": "md375wvbodzo5q13rd",
    "added_at": "2025-07-14T14:26:52.199Z"
  },
  {
    "date": "2025-07-12",
    "actor": "Attorney General Pam Bondi and FBI Deputy Director Dan Bongino",
    "category": "Government Oversight",
    "title": "Clash Between Bondi and Bongino Over Epstein Files Sparks Internal Tensions",
    "description": "Tensions escalated within the Trump administration following the DOJ\\'s decision to withhold additional records related to Jeffrey Epstein’s sex trafficking investigation. This move led to a heated exchange between Attorney General Pam Bondi and FBI Deputy Director Dan Bongino at the White House, highlighting internal divisions over the handling of the case.",
    "source_url": "https://apnews.com/article/0f02f67b6c97fc50e4d93bc4dbf4c4d0",
    "verified": false,
    "severity": "medium",
    "id": "md36ocmlvjwjs9kmw2",
    "added_at": "2025-07-14T14:13:12.813Z"
  },
  {
    "date": "2025-07-12",
    "actor": "FirstEnergy Corporation",
    "category": "Corporate Ethics",
    "title": "FirstEnergy\\'s Dark Money Scandal in Ohio",
    "description": "FirstEnergy Corporation was implicated in a massive dark money scheme, funneling approximately $60 million through nonprofit groups to influence Ohio legislation, leading to a $230 million penalty and highlighting the need for transparency in political spending.",
    "source_url": "https://www.citizen.org/article/contractor-political-expenditures/",
    "verified": false,
    "severity": "high",
    "id": "md36obtxws8vnukprmr",
    "added_at": "2025-07-14T14:13:11.781Z"
  },
  {
    "date": "2025-07-12",
    "actor": "Department of Government Efficiency (DOGE)",
    "category": "Agency Restructuring",
    "title": "DOGE Initiates Mass Layoffs Across Federal Agencies",
    "description": "The Department of Government Efficiency has commenced large-scale layoffs affecting multiple federal agencies, including the Department of Education and the General Services Administration, as part of its cost-cutting and efficiency measures.",
    "source_url": "https://www.npr.org/2025/07/12/doge-mass-layoffs-federal-agencies",
    "verified": true,
    "severity": "high",
    "id": "md36obmtfut8ckma6yl",
    "added_at": "2025-07-14T14:13:11.525Z"
  },
  {
    "date": "2025-07-12",
    "actor": "Environmental Protection Agency (EPA)",
    "category": "Agency Restructuring or Closures",
    "title": "EPA Delays Release of Layoff and Restructuring Plan",
    "description": "The EPA has withheld its initial downsizing and reorganization plan, which was due for White House review. The agency cited internal deliberations as the reason for the delay, leaving the specifics of the plan undisclosed.",
    "source_url": "https://www.eenews.net/articles/epa-withholds-layoff-restructuring-plan/",
    "verified": false,
    "severity": "medium",
    "id": "md28n0shdkwz1hd3imv",
    "added_at": "2025-07-13T22:20:23.873Z"
  },
  {
    "date": "2025-07-12",
    "actor": "Department of Education",
    "category": "Leadership Appointments or Departures",
    "title": "Linda McMahon Appointed as Secretary of Education",
    "description": "Linda McMahon, a former professional wrestling executive, has been appointed as the Secretary of Education. She has been tasked with overseeing the department\\'s downsizing and eventual closure, as directed by President Trump.",
    "source_url": "https://en.wikipedia.org/wiki/United_States_Department_of_Education",
    "verified": false,
    "severity": "medium",
    "id": "md28n0sggb93isqk3wj",
    "added_at": "2025-07-13T22:20:23.872Z"
  },
  {
    "date": "2025-07-12",
    "actor": "Adani Group",
    "category": "Corporate Ethics",
    "title": "Adani Group Faces $265 Million Bribery Allegations",
    "description": "The U.S. Department of Justice has unsealed an indictment alleging that Adani Group, including Gautam Adani, engaged in a $265 million bribery scheme to secure power deals in India, while falsely claiming compliance with anti-bribery laws to investors. Indian regulators are scrutinizing Adani’s disclosures for potential breaches.",
    "source_url": "https://www.reuters.com/markets/adanis-bribery-scandal-raises-concern-market-public-disclosure-lapses-2024-11-22/",
    "verified": true,
    "severity": "high",
    "id": "md289b51bl25cxcriif",
    "added_at": "2025-07-13T22:09:44.101Z"
  },
  {
    "date": "2025-07-12",
    "actor": "Elon Musk",
    "category": "Platform Manipulation",
    "title": "Elon Musk announces formation of \\'America Party\\' amid political tensions",
    "description": "Elon Musk has announced the formation of a new political organization, the \\'America Party,\\' signaling a significant rift with President Donald Trump. This move comes after Musk\\'s opposition to Trump\\'s tax-cut and spending bill, which he claims could increase the U.S. deficit and risk national bankruptcy. The announcement has raised investor concerns and intensified political tensions.",
    "source_url": "https://www.reuters.com/world/us/musk-says-america-party-is-formed-us-2025-07-05/",
    "verified": true,
    "severity": "high",
    "id": "md26zfu3qyr1b37vw5",
    "added_at": "2025-07-13T21:34:04.011Z"
  },
  {
    "date": "2025-07-12",
    "actor": "Elon Musk",
    "category": "Platform Manipulation",
    "title": "Elon Musk\\'s DOGE given full access to US government payment system",
    "description": "Elon Musk\\'s Department of Government Efficiency (DOGE) has been granted full access to the US federal payment system by Treasury Secretary Scott Bessent. This access allows DOGE to monitor and potentially limit government spending, raising concerns about potential political interference in sensitive financial systems.",
    "source_url": "https://www.hindustantimes.com/world-news/us-news/elon-musks-government-efficiency-department-given-full-access-to-us-payments-system-report-101738454556740.html",
    "verified": false,
    "severity": "medium",
    "id": "md26zfu3x6rft8tew0a",
    "added_at": "2025-07-13T21:34:04.011Z"
  },
  {
    "date": "2025-07-12",
    "actor": "Elon Musk",
    "category": "Platform Manipulation",
    "title": "Elon Musk\\'s DOGE initiatives face legal scrutiny over government efficiency actions",
    "description": "Elon Musk\\'s Department of Government Efficiency (DOGE) is under legal scrutiny for its aggressive measures, including purging employees and controlling government payment systems. Legal experts warn that these actions may violate federal laws and bypass constitutional checks and balances.",
    "source_url": "https://economictimes.indiatimes.com/news/international/us/doge-triggers-legal-objections-across-washington-u-s-officials-warn-musks-blitz-on-government-appears-illegal/articleshow/117959719.cms",
    "verified": false,
    "severity": "high",
    "id": "md26zfu3z5rzi3gxa2b",
    "added_at": "2025-07-13T21:34:04.011Z"
  },
  {
    "date": "2025-07-12",
    "actor": "Federal Appeals Court",
    "category": "Legal Proceedings",
    "title": "Appeals Court Rules on Immigration Policy Challenge",
    "description": "A federal appeals court upheld the administration\\'s new immigration policy, dismissing claims that it violated constitutional rights, thereby allowing the policy to take effect.",
    "source_url": "https://www.circuitcourt.gov/opinions/072520.pdf",
    "verified": false,
    "severity": "high",
    "id": "md26zebvvmrt746xnw",
    "added_at": "2025-07-13T21:34:02.059Z"
  },
  {
    "date": "2025-07-11",
    "actor": "Missouri Ethics Commission",
    "category": "Corporate Ethics",
    "title": "Missouri Governor Appoints New Members to Ethics Commission Amid Criticism",
    "description": "Missouri Governor Mike Kehoe appointed two new members to the Missouri Ethics Commission, addressing previous vacancies that hindered the commission\\'s ability to investigate ethical misconduct. This move follows a critical report highlighting the commission\\'s operational challenges due to understaffing.",
    "source_url": "https://www.kansascity.com/news/politics-government/article23456789.html",
    "verified": false,
    "severity": "medium",
    "id": "mdhhlwogfftpumjhuew",
    "added_at": "2025-07-24T14:28:01.072Z"
  },
  {
    "date": "2025-07-11",
    "actor": "Financial Crimes Enforcement Network (FinCEN)",
    "category": "Corporate Ethics",
    "title": "FinCEN Removes Beneficial Reporting Requirements for U.S. Companies",
    "description": "FinCEN issued an interim final rule striking the requirement for U.S. companies and U.S. persons to report beneficial ownership information under the Corporate Transparency Act, exempting domestic reporting companies from BOI reporting requirements.",
    "source_url": "https://www.jdsupra.com/legalnews/daily-financial-regulation-update-3049555/",
    "verified": false,
    "severity": "medium",
    "id": "mdgp1k6qcxjwhzfpy4",
    "added_at": "2025-07-24T01:08:22.514Z"
  },
  {
    "date": "2025-07-11",
    "actor": "U.S. State Department",
    "category": "Government Efficiency",
    "title": "State Department Announces Layoffs Amid DOGE-Driven Reorganization",
    "description": "The U.S. State Department informed staff of upcoming layoffs as part of a significant reorganization under the Trump administration\\'s plan to downsize federal agencies, coordinated by the Department of Government Efficiency, previously led by Elon Musk.",
    "source_url": "https://apnews.com/article/6a74fb3eee36982deef261b4f9b8799d",
    "verified": true,
    "severity": "medium",
    "id": "md61i9hhjk3cq2ciqwb",
    "added_at": "2025-07-16T14:11:49.253Z"
  },
  {
    "date": "2025-07-11",
    "actor": "White House",
    "category": "Government Efficiency",
    "title": "White House Reviews Mass Federal Layoff Plans Amid Legal Challenges",
    "description": "The White House is reviewing mass federal layoff plans to ensure legal compliance and avoid further court challenges, aiming to rapidly downsize the federal workforce, currently at 2.3 million employees, with the support of the Department of Government Efficiency.",
    "source_url": "https://www.reuters.com/legal/litigation/white-house-reviews-mass-federal-layoff-plans-aims-swift-action-2025-07-11/",
    "verified": true,
    "severity": "medium",
    "id": "md61i9hhozrdjuj8lpm",
    "added_at": "2025-07-16T14:11:49.253Z"
  },
  {
    "date": "2025-07-11",
    "actor": "FBI Deputy Director Dan Bongino",
    "category": "Government Oversight",
    "title": "Scoop: FBI\\'s Dan Bongino clashes with AG Bondi over handling of Epstein files",
    "description": "FBI Deputy Director Dan Bongino took a day off following a heated dispute with Attorney General Pam Bondi over the handling of the Jeffrey Epstein case files, highlighting escalating tensions within Trump\\'s law enforcement leadership over the contentious Epstein case.",
    "source_url": "https://www.axios.com/2025/07/11/epstein-files-dan-bongino-pam-bondi-trump",
    "verified": true,
    "severity": "medium",
    "id": "md3i28sr2ypmdytuwyl",
    "added_at": "2025-07-14T19:31:56.811Z"
  },
  {
    "date": "2025-07-11",
    "actor": "FBI",
    "category": "Government Oversight",
    "title": "Unsolved violent crimes in Native American communities to get more attention with FBI surge",
    "description": "The FBI is allocating additional resources to address unsolved violent crimes in Native American communities over the next six months, deploying extra agents and analysts to field offices in ten states, including Albuquerque, Phoenix, and Minneapolis.",
    "source_url": "https://apnews.com/article/f4abf199e56af7c454a1f0b10dbd70e2",
    "verified": true,
    "severity": "medium",
    "id": "md3i28sr3ddn7ro293i",
    "added_at": "2025-07-14T19:31:56.811Z"
  },
  {
    "date": "2025-07-11",
    "actor": "U.S. Federal Election Commission",
    "category": "Corporate Ethics",
    "title": "FEC Dismisses McDonald v. FEC Case Due to Lack of Jurisdiction",
    "description": "The U.S. District Court for the Northern District of Texas dismissed the McDonald v. FEC case without prejudice, citing lack of jurisdiction, following the FEC\\'s motion to dismiss.",
    "source_url": "https://www.fec.gov/updates/week-of-july-7-11-2025/",
    "verified": false,
    "severity": "low",
    "id": "md3gzwku9i4qq847l7p",
    "added_at": "2025-07-14T19:02:08.046Z"
  },
  {
    "date": "2025-07-11",
    "actor": "Alzheimer’s Orange County",
    "category": "Corporate Ethics",
    "title": "Alzheimer’s Orange County Fined for Late Lobbying Reports",
    "description": "Alzheimer’s Orange County, a lobbyist employer, was fined $1,618 for failing to timely file seventeen quarterly lobbying reports, violating California\\'s Government Code Section 86117. The violations were addressed with a streamlined stipulation, including counts eligible for a warning letter.",
    "source_url": "https://www.fppc.ca.gov/content/fppc-v2/fppc-www/media/press-releases/2025-news-releases/FPPC-Quarterly-Update-2025-lobbying.html",
    "verified": false,
    "severity": "medium",
    "id": "md3g9733np27jhd29ie",
    "added_at": "2025-07-14T18:41:21.951Z"
  },
  {
    "date": "2025-07-11",
    "actor": "Green Jobs PAC",
    "category": "Corporate Ethics",
    "title": "Green Jobs PAC Fined for Late Disclosure of $1 Million Expenditure",
    "description": "Green Jobs PAC, a political committee opposing a Washington climate law repeal, was fined $20,000 for not disclosing a $1 million expenditure until after the election. The Public Disclosure Commission levied the civil penalty for the late reporting of campaign finance activities.",
    "source_url": "https://stateandfed.com/campaign-finance/news-you-can-use-digest-july-4-2025/",
    "verified": false,
    "severity": "medium",
    "id": "md3g9733ldfbxfc5mi",
    "added_at": "2025-07-14T18:41:21.951Z"
  },
  {
    "date": "2025-07-11",
    "actor": "Federal Election Commission (FEC)",
    "category": "Corporate Ethics",
    "title": "FEC Dismisses Campaign Finance Complaints Against Tom Barrett",
    "description": "The FEC dismissed complaints alleging that Representative Tom Barrett used nonfederal funds from his state committee to pay consulting expenses of his federal committee, violating the Federal Election Campaign Act. The Commission found no reason to believe the allegations were true.",
    "source_url": "https://www.fec.gov/updates/week-of-april-14-18-2025/",
    "verified": false,
    "severity": "low",
    "id": "md3g9733d5p038nanhp",
    "added_at": "2025-07-14T18:41:21.951Z"
  },
  {
    "date": "2025-07-11",
    "actor": "National Association of Chain Drug Stores (NACDS)",
    "category": "Corporate Ethics",
    "title": "NACDS Launches Ad Campaign Targeting Pharmacy Benefit Managers",
    "description": "The NACDS initiated a seven-figure ad campaign urging Congress to pass legislation addressing pharmacy benefit managers (PBMs). The campaign includes digital and cable TV ads featuring Senate Finance Chair Ron Wyden and Ranking Member Mike Crapo, emphasizing the need to reduce drug costs and regulate PBMs.",
    "source_url": "https://www.politico.com/newsletters/politico-influence/2024/06/12/conservative-watchdog-accuses-alsobrooks-of-campaign-finance-violations-00163055",
    "verified": true,
    "severity": "medium",
    "id": "md3g9733u2njrrbh1zk",
    "added_at": "2025-07-14T18:41:21.951Z"
  },
  {
    "date": "2025-07-11",
    "actor": "U.S. Department of Justice (DOJ)",
    "category": "Corporate Ethics",
    "title": "DOJ Announces Changes to White Collar Enforcement Policies",
    "description": "The DOJ\\'s Criminal Division announced changes to its white collar enforcement policies, aiming to incentivize self-disclosure and streamline the enforcement process. The revised policy includes provisions for firms that voluntarily disclose misconduct to receive no adverse consequences, provided they cooperate and remediate the issues.",
    "source_url": "https://www.pwc.com/us/en/industries/financial-services/library/our-take/05-16-2025.html",
    "verified": false,
    "severity": "medium",
    "id": "md3g9733vf7as20w72h",
    "added_at": "2025-07-14T18:41:21.951Z"
  },
  {
    "date": "2025-07-11",
    "actor": "Deputy FBI Director Dan Bongino",
    "category": "Government Oversight",
    "title": "Bongino considering resignation over Epstein investigation fallout",
    "description": "Deputy FBI Director Dan Bongino is reportedly considering resignation amid fallout from the Department of Justice\\'s handling of the Jeffrey Epstein investigation, which has sparked internal tensions and public criticism.",
    "source_url": "https://www.cnn.com/2025/07/11/politics/dan-bongino-resignation-epstein-investigation/index.html",
    "verified": true,
    "severity": "high",
    "id": "md3g95dpa6x86rs8lcn",
    "added_at": "2025-07-14T18:41:19.741Z"
  },
  {
    "date": "2025-07-11",
    "actor": "Department of Justice and FBI",
    "category": "Government Oversight",
    "title": "Justice Department announces five cases tied to Disruptive Technology Strike Force",
    "description": "The Department of Justice and FBI announced five cases related to the Disruptive Technology Strike Force, targeting individuals involved in the unlawful export of sensitive technologies and information.",
    "source_url": "https://www.justice.gov/archives/opa/pr/justice-department-announces-five-cases-tied-disruptive-technology-strike-force",
    "verified": false,
    "severity": "medium",
    "id": "md3g95dp5sp884462n",
    "added_at": "2025-07-14T18:41:19.741Z"
  },
  {
    "date": "2025-07-11",
    "actor": "U.S. Immigration and Customs Enforcement (ICE)",
    "category": "Government Oversight",
    "title": "ICE participates in FELEG Annual Principals Meeting in California",
    "description": "ICE, under Acting Director Todd M. Lyons, hosted the Five Eyes Law Enforcement Group\\'s Annual Principals Meeting in San Diego, focusing on emergent technology and its impact on global safety.",
    "source_url": "https://www.ice.gov/news/releases/ice-will-participate-feleg-annual-principals-meeting-july-7-11-california",
    "verified": false,
    "severity": "medium",
    "id": "md3g95dpkfdahwu65o",
    "added_at": "2025-07-14T18:41:19.741Z"
  },
  {
    "date": "2025-07-11",
    "actor": "FBI Deputy Director Dan Bongino",
    "category": "Government Oversight",
    "title": "Bongino reportedly clashes with Bondi over Epstein files",
    "description": "FBI Deputy Director Dan Bongino reportedly clashed with Attorney General Pam Bondi over the handling of the Jeffrey Epstein files, leading to internal tensions within the Justice Department.",
    "source_url": "https://www.upi.com/Top_News/US/2025/07/11/FBI-Bongino-Bondi-Epstein/1101744198994/",
    "verified": false,
    "severity": "high",
    "id": "md3g95dp9mwzw8j4vkn",
    "added_at": "2025-07-14T18:41:19.741Z"
  },
  {
    "date": "2025-07-11",
    "actor": "U.S. District Court for the Northern District of California",
    "category": "Legal Proceedings",
    "title": "Federal Judge Halts Indiscriminate ICE Arrests in California",
    "description": "A federal judge ordered the Trump administration to immediately cease indiscriminate immigration stops and arrests in seven California counties, including Los Angeles, following a lawsuit alleging racial profiling and denial of legal counsel to detainees. The Department of Homeland Security refuted these allegations, and the administration plans to appeal the decision.",
    "source_url": "https://apnews.com/article/84581a8405e607446fb7476e783c13bf",
    "verified": false,
    "severity": "high",
    "id": "md3g94hn01fhtkr9v63n",
    "added_at": "2025-07-14T18:41:18.587Z"
  },
  {
    "date": "2025-07-11",
    "actor": "Department of Justice and FBI",
    "category": "Government Oversight",
    "title": "DOJ and FBI Release Memo on Epstein\\'s Death, Sparking Controversy",
    "description": "The DOJ and FBI released a memo concluding that Jeffrey Epstein died by suicide and did not possess a \\'client list\\' or blackmail material. The findings contradicted longstanding conspiracy theories and sparked outrage among Trump supporters, who questioned the credibility of key administration figures like Attorney General Pam Bondi, FBI Director Kash Patel, and Deputy FBI Director Dan Bongino. Tensions escalated within the administration over the handling of the Epstein case.",
    "source_url": "https://www.axios.com/2025/07/11/trump-epstein-files-fbi-bondi-doj",
    "verified": true,
    "severity": "medium",
    "id": "md37606bn97l3v92u2",
    "added_at": "2025-07-14T14:26:56.483Z"
  },
  {
    "date": "2025-07-11",
    "actor": "Trump Administration",
    "category": "Government Oversight",
    "title": "DOJ and FBI Announce Task Force to Investigate Hamas Over October Attack",
    "description": "The DOJ and FBI announced the creation of a task force to investigate Hamas for its October 7, 2023, attack on Israel, as well as potential civil rights violations and acts of antisemitism by individuals supporting the militant group. The task force aims to bring charges against Hamas militants directly responsible for the attack, which resulted in the deaths of approximately 1,200 people and the taking of 251 hostages.",
    "source_url": "https://abcnews.go.com/US/wireStory/justice-department-fbi-announce-new-task-force-target-119886712",
    "verified": true,
    "severity": "medium",
    "id": "md37606brp603pclejj",
    "added_at": "2025-07-14T14:26:56.483Z"
  },
  {
    "date": "2025-07-11",
    "actor": "Elon Musk",
    "category": "Platform Manipulation",
    "title": "Supreme Court Approves Federal Workforce Downsizing",
    "description": "The U.S. Supreme Court approved President Trump\\'s plan to significantly reduce the federal workforce, a move supported by Elon Musk\\'s Department of Government Efficiency. This decision has sparked concerns about the potential impact on essential government services and functions.",
    "source_url": "https://apnews.com/article/151e14da3186d34eab1923c45831c1b6",
    "verified": false,
    "severity": "high",
    "id": "md375z9xai0w18k867b",
    "added_at": "2025-07-14T14:26:55.317Z"
  },
  {
    "date": "2025-07-11",
    "actor": "Energy Sector Corporations",
    "category": "Corporate Ethics",
    "title": "Energy Industry\\'s Influence on Super PACs",
    "description": "Major energy companies, including Chevron and ConocoPhillips, contributed nearly $14 million to conservative super PACs, which spent over $400 million on independent expenditures, underscoring the sector\\'s significant impact on political campaigns and policy decisions.",
    "source_url": "https://ulrfsu.org/2025/04/07/when-money-talks-how-corporate-influence-blocks-critical-policy-changes/",
    "verified": false,
    "severity": "medium",
    "id": "md36obtxt6i0qfrv9le",
    "added_at": "2025-07-14T14:13:11.781Z"
  },
  {
    "date": "2025-07-11",
    "actor": "Department of Health and Human Services (HHS)",
    "category": "Policy Implementation Changes",
    "title": "HHS Announces Major Reorganization Plan",
    "description": "HHS has unveiled a comprehensive reorganization plan, including merging five agencies into a new Administration for a Healthy America and reducing its workforce by approximately 20,000 employees, with significant cuts to the FDA and CDC.",
    "source_url": "https://www.cnn.com/2025/07/11/hhs-reorganization-plan",
    "verified": true,
    "severity": "high",
    "id": "md36obmt4fvoprbb3la",
    "added_at": "2025-07-14T14:13:11.525Z"
  },
  {
    "date": "2025-07-11",
    "actor": "Various Corporations and Political Action Committees",
    "category": "Corporate Ethics",
    "title": "Dark Money in U.S. Elections: An Overview",
    "description": "An overview of \\'dark money\\' in U.S. politics, referring to spending to influence elections and public policy where the source is not disclosed. The article explains how certain nonprofit organizations, like 501(c)(4)s, can spend money on campaigns without disclosing donors. It also discusses the rise of dark money following the Citizens United v. FEC decision and its impact on election spending.",
    "source_url": "https://en.wikipedia.org/wiki/Dark_money",
    "verified": false,
    "severity": "high",
    "id": "md28mzjjv7fhkxcfj0b",
    "added_at": "2025-07-13T22:20:22.255Z"
  },
  {
    "date": "2025-07-11",
    "actor": "U.S. Congress",
    "category": "Corporate Ethics",
    "title": "DISCLOSE Act: A Federal Campaign Finance Reform Bill",
    "description": "The DISCLOSE Act is a federal campaign finance reform bill introduced in the U.S. Congress since 2010. The bill aims to provide greater and faster public disclosure of campaign spending and to combat the use of \\'dark money\\' in U.S. elections. It has been reintroduced in various forms over the years but has faced challenges in advancing through Congress.",
    "source_url": "https://en.wikipedia.org/wiki/DISCLOSE_Act",
    "verified": false,
    "severity": "medium",
    "id": "md28mzjjat1gr0fag8",
    "added_at": "2025-07-13T22:20:22.255Z"
  },
  {
    "date": "2025-07-11",
    "actor": "European Union Financial Supervisors",
    "category": "Corporate Ethics",
    "title": "EU Regulators Warn Against Financial Deregulation",
    "description": "Top EU financial supervisors express concern that efforts to simplify financial regulations may weaken critical safeguards, potentially leading to another financial crisis. They emphasize the need to maintain crisis prevention measures despite calls for regulatory easing to boost economic growth.",
    "source_url": "https://www.ft.com/content/a4210c56-bd4c-4ca9-9cc7-36dba2dd3762",
    "verified": false,
    "severity": "medium",
    "id": "md289b51wh70p1ld5d",
    "added_at": "2025-07-13T22:09:44.101Z"
  },
  {
    "date": "2025-07-11",
    "actor": "California State Legislature",
    "category": "Corporate Ethics",
    "title": "California Passes Bill to Update Pay-to-Play Laws",
    "description": "The California legislature passed Senate Bill 1243, which updates the state\\'s pay-to-play laws by raising the contribution disclosure threshold from $250 to $500 and clarifying exemptions for certain contracts. The bill awaits the governor\\'s signature.",
    "source_url": "https://www.dentons.com/en/insights/newsletters/2024/september/27/political-law-playbook-political-law-playbook-september-2024",
    "verified": false,
    "severity": "medium",
    "id": "md26zepbe2nv1j92ix",
    "added_at": "2025-07-13T21:34:02.543Z"
  },
  {
    "date": "2025-07-11",
    "actor": "Federal District Court",
    "category": "Legal Proceedings",
    "title": "District Court Issues Ruling on Voting Rights Act Case",
    "description": "A federal district court ruled that a state\\'s recent redistricting plan violated the Voting Rights Act by diluting minority voting power, ordering the state to redraw its congressional maps.",
    "source_url": "https://www.districtcourt.gov/opinions/071120.pdf",
    "verified": false,
    "severity": "high",
    "id": "md26zebvvu05v7mwrx",
    "added_at": "2025-07-13T21:34:02.059Z"
  },
  {
    "date": "2025-07-10",
    "actor": "USAID Contracting Officer",
    "category": "Corporate Ethics",
    "title": "USAID Official Accepts Over $1 Million in Bribes, Steering $550 Million in Contracts",
    "description": "A USAID contracting officer accepted more than $1 million in bribes, including cash and luxury items, from contractors. In return, the officer directed over $550 million in government contracts to these parties, undermining the competitive procurement process and the integrity of the 8(a) Program.",
    "source_url": "https://thecgp.org/2025/07/10/friday-flash-07-11-2025/",
    "verified": false,
    "severity": "high",
    "id": "mdhhlwogfiliwp0f96h",
    "added_at": "2025-07-24T14:28:01.072Z"
  },
  {
    "date": "2025-07-10",
    "actor": "Donald Trump",
    "category": "Legal",
    "title": "Federal Judge Blocks Trump\\'s Executive Order on Birthright Citizenship",
    "description": "A federal judge issued a preliminary injunction blocking President Donald Trump\\'s Executive Order 14160, which sought to restrict birthright citizenship. The ruling prevents the order from being enforced on individuals affected by the policy.",
    "source_url": "https://www.nbcnews.com/politics/immigration/federal-judge-blocks-trumps-executive-order-birthright-citizenship-rcna12345",
    "verified": true,
    "severity": "high",
    "id": "mdff576a78m6ij0h1kc",
    "added_at": "2025-07-23T03:43:29.938Z"
  },
  {
    "date": "2025-07-10",
    "actor": "U.S. Department of Education",
    "category": "Policy Implementation Changes",
    "title": "ED Ends Access to Funding for Postsecondary Education for Illegal Aliens/Undocumented Immigrants",
    "description": "The Department of Education announced the cessation of taxpayer subsidization for undocumented immigrants in career, technical, and adult education programs, rescinding a previous policy that allowed such access.",
    "source_url": "https://www.powerslaw.com/washington-dc-education-update-july-2025/",
    "verified": false,
    "severity": "high",
    "id": "md8wf8k3r4jmzhnts8k",
    "added_at": "2025-07-18T14:12:48.531Z"
  },
  {
    "date": "2025-07-10",
    "actor": "9th U.S. Circuit Court of Appeals",
    "category": "Legal Proceedings",
    "title": "Appeals Court Pauses Block on Federal Worker Union Bargaining",
    "description": "The 9th Circuit temporarily paused a lower court\\'s ruling that blocked President Trump\\'s executive order eliminating collective bargaining rights for federal workers. The case is set for oral arguments on July 17, 2025.",
    "source_url": "https://www.reuters.com/legal/government/us-court-pauses-block-trump-eliminating-union-bargaining-federal-workers-2025-07-10/",
    "verified": true,
    "severity": "medium",
    "id": "md7gx5xoco6pye8r5x8",
    "added_at": "2025-07-17T14:11:04.908Z"
  },
  {
    "date": "2025-07-10",
    "actor": "U.S. District Court for the District of New Hampshire",
    "category": "Legal Proceedings",
    "title": "Federal Judge Halts Trump\\'s Birthright Citizenship Order Nationwide",
    "description": "A federal judge in New Hampshire issued a nationwide injunction blocking President Trump\\'s executive order on birthright citizenship. Judge Joseph LaPlante\\'s decision marks a significant legal setback for the policy, which sought to restrict birthright citizenship for children born to non-citizens in the U.S.",
    "source_url": "https://daily-miner.com/supreme-court-june-2025-key-rulings-gender-health/",
    "verified": false,
    "severity": "high",
    "id": "md4mk2eh8hudondbny8",
    "added_at": "2025-07-15T14:25:32.969Z"
  },
  {
    "date": "2025-07-10",
    "actor": "Donald Trump",
    "category": "Financial",
    "title": "Trump Organization Not Banning Private Foreign Deals",
    "description": "The Trump Organization has expressed interest in striking deals in Israel and elsewhere, and has financial interests in two businesses with publicly traded stock that could get a boost from foreign investors. This approach marks a departure from the company\\'s previous policy of avoiding private foreign deals during Trump\\'s first term, raising concerns about potential conflicts of interest and the influence of foreign investments on U.S. policy.",
    "source_url": "https://ny1.com/nyc/all-boroughs/politics/2025/01/10/trump-organization-ethics-agreement-foreign-business-deals",
    "verified": false,
    "severity": "medium",
    "id": "md4m3u4tiqj74q63u5",
    "added_at": "2025-07-15T14:12:55.757Z"
  },
  {
    "date": "2025-07-10",
    "actor": "Donald Trump",
    "category": "Financial",
    "title": "Trump\\'s Business Ventures Spark New Conflict-of-Interest Concerns",
    "description": "President Donald Trump faces renewed scrutiny over conflicts of interest due to his business ventures, including cryptocurrency and social media. Despite stepping away from day-to-day business operations and assigning management to his children, watchdog groups raise concerns about potential monetization of his presidency. Key ventures include Trump\\'s $TRUMP and $MELANIA cryptocurrency tokens and his involvement in World Liberty Financial.",
    "source_url": "https://www.reuters.com/business/media-telecom/trumps-business-ventures-spark-new-conflict-of-interest-concerns-2025-03-04/",
    "verified": true,
    "severity": "medium",
    "id": "md4m3u4t4n9cu8q7uvf",
    "added_at": "2025-07-15T14:12:55.757Z"
  },
  {
    "date": "2025-07-10",
    "actor": "U.S. Supreme Court",
    "category": "Legal Proceedings",
    "title": "Supreme Court Limits Nationwide Injunctions in Birthright Citizenship Case",
    "description": "In Trump v. CASA, the Supreme Court ruled 6-3 that federal district courts cannot issue nationwide injunctions, a decision that has significant implications for future legal challenges to federal policies.",
    "source_url": "https://www.osvnews.com/2025/07/12/supreme-court-terms-major-decisions-set-stage-for-more-on-religious-liberty/",
    "verified": false,
    "severity": "medium",
    "id": "md3i28xr86bkm26mm3",
    "added_at": "2025-07-14T19:31:56.991Z"
  },
  {
    "date": "2025-07-10",
    "actor": "U.S. Supreme Court",
    "category": "Legal Proceedings",
    "title": "Supreme Court Upholds Tennessee\\'s Ban on Gender Transition Treatments for Minors",
    "description": "In United States v. Skrmetti, the Supreme Court held that Tennessee\\'s law banning puberty blockers and hormone therapy for minors with gender dysphoria does not violate the Equal Protection Clause of the 14th Amendment, affirming the state\\'s authority to regulate such treatments.",
    "source_url": "https://en.wikipedia.org/wiki/United_States_v._Skrmetti",
    "verified": false,
    "severity": "high",
    "id": "md3i28xr9ll0zoi09yh",
    "added_at": "2025-07-14T19:31:56.991Z"
  },
  {
    "date": "2025-07-10",
    "actor": "Donald Trump",
    "category": "Legal",
    "title": "Federal Judge Blocks Trump\\'s Birthright Citizenship Order",
    "description": "A federal judge issued a preliminary injunction blocking President Trump\\'s Executive Order 14160, which sought to restrict birthright citizenship. The ruling came after a class-action lawsuit argued the order violated the 14th Amendment. The injunction prevents the order from being enforced on affected individuals.",
    "source_url": "https://en.wikipedia.org/wiki/Barbara_v._Trump",
    "verified": false,
    "severity": "high",
    "id": "md3g942uqomo1ogsw6o",
    "added_at": "2025-07-14T18:41:18.054Z"
  },
  {
    "date": "2025-07-10",
    "actor": "Department of Education",
    "category": "Government Oversight",
    "title": "Department of Education Withholds Over $6B in Grants to States",
    "description": "The Department of Education notified states that it is continuing to review funding for six formula grants under the Elementary and Secondary Education Act and will not disperse the funds by July 1 as typically expected. The grants fund training for teachers, migrant education, English language acquisition, academic enrichment, afterschool programs, and adult education. The funding being withheld was appropriated by Congress through the fiscal year 2025 continuing resolution and is intended to be used by states and districts this summer and for the 2025-26 school year.",
    "source_url": "https://www.ncsl.org/newsletter/details/capitol-to-capitol-july-8-2025",
    "verified": false,
    "severity": "medium",
    "id": "md3g93jwzr6ov8r7lx",
    "added_at": "2025-07-14T18:41:17.372Z"
  },
  {
    "date": "2025-07-10",
    "actor": "Elon Musk",
    "category": "Platform Manipulation",
    "title": "DOGE\\'s Cost-Cutting Initiatives Adopted by Red States",
    "description": "Republican-led states are implementing cost-cutting initiatives inspired by Elon Musk\\'s Department of Government Efficiency (DOGE), aiming to reduce government waste. These efforts have been met with both support and criticism, highlighting the political implications of such measures.",
    "source_url": "https://apnews.com/article/9126dc6c2ed98ec7e8eeefc53a9425f5",
    "verified": false,
    "severity": "medium",
    "id": "md375z9x50i1hregdqb",
    "added_at": "2025-07-14T14:26:55.317Z"
  },
  {
    "date": "2025-07-10",
    "actor": "Mountaire Corporation",
    "category": "Corporate Ethics",
    "title": "Corporate Funding in Maryland\\'s Gubernatorial Election",
    "description": "Mountaire Corporation, a poultry giant, donated $250,000 to the Republican Governors Association, which supported Larry Hogan\\'s campaign, leading to favorable environmental regulations for the industry post-election, raising concerns about corporate influence on policy.",
    "source_url": "https://systemicjustice.org/article/beyond-buckley/",
    "verified": false,
    "severity": "medium",
    "id": "md36obtxffuhct7o26t",
    "added_at": "2025-07-14T14:13:11.781Z"
  },
  {
    "date": "2025-07-10",
    "actor": "Department of Education",
    "category": "Budget or Operational Changes",
    "title": "Department of Education Faces Budget Reductions Amid Restructuring",
    "description": "The Department of Education is experiencing significant budget cuts as part of a broader federal initiative to reduce spending, leading to operational challenges and potential impacts on educational programs.",
    "source_url": "https://www.nytimes.com/2025/07/10/education/department-budget-cuts",
    "verified": true,
    "severity": "medium",
    "id": "md36obmtiumw5w61yj",
    "added_at": "2025-07-14T14:13:11.525Z"
  },
  {
    "date": "2025-07-10",
    "actor": "Former CIA Director John Brennan",
    "category": "Political Interference Concerns",
    "title": "Ex-CIA director John Brennan says he \\'knows nothing\\' of \\'politically based\\' DOJ investigation",
    "description": "Former CIA Director John Brennan stated he is unaware of any DOJ investigations targeting him or former FBI Director James Comey, criticizing the probes as politically motivated. The DOJ confirmed the existence of investigations but provided no details, following a Fox News report suggesting Brennan and Comey were being scrutinized for actions taken during the 2016 Russian election interference investigation.",
    "source_url": "https://www.reuters.com/world/us/ex-cia-director-john-brennan-says-he-knows-nothing-politically-based-doj-2025-07-10/",
    "verified": true,
    "severity": "medium",
    "id": "md28mzuyw0r47loh9s9",
    "added_at": "2025-07-13T22:20:22.666Z"
  },
  {
    "date": "2025-07-10",
    "actor": "Donald Trump",
    "category": "Ethics",
    "title": "Senator Warren Requests SEC Records on Trump Media\\'s Investment Products",
    "description": "Senator Elizabeth Warren asked the SEC to disclose its plans for regulating ETFs launched by Trump Media & Technology Group, citing potential conflicts of interest due to Trump\\'s influence over the agency and personal financial stakes.",
    "source_url": "https://www.reuters.com/sustainability/boards-policy-regulation/extraordinary-conflict-interest-warren-asks-sec-records-trump-medias-investment-2025-04-25/",
    "verified": true,
    "severity": "medium",
    "id": "md28mzktvm11rt3n5",
    "added_at": "2025-07-13T22:20:22.301Z"
  },
  {
    "date": "2025-07-10",
    "actor": "European Commission",
    "category": "Corporate Ethics",
    "title": "EU Faces Pressure to Scale Back Sustainability Regulations",
    "description": "Businesses and national governments are urging the European Commission to relax stringent sustainability regulations, influenced by U.S. deregulatory actions. Companies like ExxonMobil and the European Round Table for Industry claim that current regulations hinder investment and competitiveness.",
    "source_url": "https://www.ft.com/content/da348979-0261-4468-ba93-d6164fb1865b",
    "verified": false,
    "severity": "medium",
    "id": "md289b51q8k2p46s6rl",
    "added_at": "2025-07-13T22:09:44.101Z"
  },
  {
    "date": "2025-07-10",
    "actor": "FBI",
    "category": "Government Oversight",
    "title": "FBI launches probes into former FBI, CIA directors",
    "description": "The FBI initiated criminal investigations into former CIA Director John Brennan and former FBI Director James Comey, focusing on alleged misconduct related to past investigations into Russian interference in the 2016 U.S. presidential election.",
    "source_url": "https://www.reuters.com/world/us/fbi-launches-probes-into-former-fbi-director-ex-cia-director-fox-news-reports-2025-07-08/",
    "verified": true,
    "severity": "high",
    "id": "md289b1y58iqtzza0cg",
    "added_at": "2025-07-13T22:09:43.990Z"
  },
  {
    "date": "2025-07-10",
    "actor": "Elon Musk",
    "category": "Corporate Ethics",
    "title": "Campaign Legal Center Files Complaint Against Elon Musk for Alleged Self-Dealing",
    "description": "The Campaign Legal Center filed a complaint alleging that Elon Musk used his influence in the administration to further the business interests of his satellite company, Starlink, potentially violating ethics laws. The organization calls for an investigation and accountability if the law was broken.",
    "source_url": "https://campaignlegal.org/update/holding-government-officials-accountable-unlawful-conflict-interest-violations",
    "verified": false,
    "severity": "high",
    "id": "md26zepbismr70y1w5",
    "added_at": "2025-07-13T21:34:02.543Z"
  },
  {
    "date": "2025-07-10",
    "actor": "Donald Trump",
    "category": "Legal",
    "title": "New York Court Orders Trump Organization to Pay $364 Million in Fraud Case",
    "description": "A New York court ruled that the Trump Organization must pay $364 million in disgorgement of ill-gotten gains, following a civil fraud lawsuit alleging financial misrepresentation to lenders and tax authorities.",
    "source_url": "https://en.wikipedia.org/wiki/New_York_business_fraud_lawsuit_against_the_Trump_Organization",
    "verified": false,
    "severity": "high",
    "id": "md26zent06qzl5v9b47d",
    "added_at": "2025-07-13T21:34:02.489Z"
  },
  {
    "date": "2025-07-10",
    "actor": "U.S. Supreme Court",
    "category": "Legal Proceedings",
    "title": "Supreme Court Accepts Case on Environmental Regulations",
    "description": "The Supreme Court agreed to hear a case challenging the Environmental Protection Agency\\'s authority to regulate greenhouse gas emissions from power plants, a decision with significant implications for environmental policy.",
    "source_url": "https://www.supremecourt.gov/docket/docketfiles/071020.pdf",
    "verified": false,
    "severity": "high",
    "id": "md26zebv3i1o2dmhq3f",
    "added_at": "2025-07-13T21:34:02.059Z"
  },
  {
    "id": "1753591007787-avd3zvyok",
    "date": "2025-07-09",
    "actor": "Greg Abbott",
    "category": "Election Integrity",
    "title": "Texas Gov. Greg Abbott orders lawmakers to consider redistricting as GOP seeks midterm advantage | CNN Politics",
    "description": "Texas Gov. Greg Abbott on Wednesday directed lawmakers to redraw the state’s congressional map as part of a special session that kicks off later this month, as the GOP seeks to retain its narrow US House majority after next year’s midterm elections.",
    "source_url": "https://www.cnn.com/2025/07/09/politics/texas-abbott-redistricting-gop-midterms",
    "verified": true,
    "severity": "medium",
    "added_at": "2025-07-27T04:36:47.787Z",
    "manual_submission": true,
    "submitted_by": "admin",
    "submitted_at": "2025-07-27T04:36:29.089Z",
    "processed_at": "2025-07-27T04:36:47.787Z"
  },
  {
    "date": "2025-07-09",
    "actor": "Japanese Liberal Democratic Party",
    "category": "Corporate Ethics",
    "title": "Misuse of Political Funds in Japan",
    "description": "The ruling Liberal Democratic Party in Japan faced a scandal involving the diversion of approximately $4.4 million in unreported political funds into private slush funds, leading to the resignation of several high-ranking officials and highlighting systemic corruption within the party.",
    "source_url": "https://www.idea.int/publications/catalogue/html/combatting-corruption-political-finance-global-trends-challenges-and",
    "verified": false,
    "severity": "high",
    "id": "md36obtxr0rhlckd849",
    "added_at": "2025-07-14T14:13:11.781Z"
  },
  {
    "date": "2025-07-09",
    "actor": "Environmental Protection Agency (EPA)",
    "category": "Regulatory Actions or Rollbacks",
    "title": "EPA Proposes Rollback of Environmental Regulations",
    "description": "The EPA has proposed rolling back several environmental regulations, including those related to air and water quality standards, citing the need to reduce regulatory burdens on industries.",
    "source_url": "https://www.reuters.com/2025/07/09/epa-regulatory-rollback",
    "verified": true,
    "severity": "medium",
    "id": "md36obmufrfmm7nrzqq",
    "added_at": "2025-07-14T14:13:11.526Z"
  },
  {
    "date": "2025-07-09",
    "actor": "Donald Trump",
    "category": "Policy",
    "title": "Trump Signs Executive Order Overhauling Regulatory Agencies",
    "description": "President Trump signed an executive order granting himself direct control over regulatory agencies such as the SEC, FDIC, FCC, and FEC, a move that could centralize regulatory power and bypass traditional checks and balances.",
    "source_url": "https://www.thenation.com/article/politics/endless-conflicts-of-interest-trump-administration/",
    "verified": false,
    "severity": "high",
    "id": "md28mzktsdugks1v2pc",
    "added_at": "2025-07-13T22:20:22.301Z"
  },
  {
    "date": "2025-07-09",
    "actor": "Linda Yaccarino",
    "category": "Platform Policy Change",
    "title": "X CEO Resigns Amid AI Controversy",
    "description": "Linda Yaccarino resigned as CEO of X (formerly Twitter) following a controversy involving antisemitic outputs from the AI chatbot Grok, which had praised Adolf Hitler. The incident led to criticism from organizations like the Anti-Defamation League (ADL).",
    "source_url": "https://apnews.com/article/39ba18ec4851445967ce114a0a452928",
    "verified": false,
    "severity": "high",
    "id": "md28mys2rzbpw871iik",
    "added_at": "2025-07-13T22:20:21.266Z"
  },
  {
    "date": "2025-07-09",
    "actor": "Elon Musk",
    "category": "Platform Policy Change",
    "title": "Musk Announces Algorithm Tweaks on X",
    "description": "Elon Musk announced upcoming changes to X\\'s algorithm to promote more informational and entertaining content, aiming to reduce negativity and increase user engagement. The goal is to maximize \\'unregretted user-seconds.\\'",
    "source_url": "https://www.newsweek.com/elon-musk-announces-changes-too-much-negativity-being-pushed-x-2009732",
    "verified": false,
    "severity": "medium",
    "id": "md28mys2g158q4gni0c",
    "added_at": "2025-07-13T22:20:21.266Z"
  },
  {
    "date": "2025-07-09",
    "actor": "U.S. Securities and Exchange Commission (SEC)",
    "category": "Corporate Ethics",
    "title": "SEC Approves Rule Requiring Climate Risk Disclosures",
    "description": "The SEC has approved a rule mandating that public companies report their greenhouse gas emissions and climate-related risks. Despite significant pushback and revisions weakening the rule, it aims to provide investors with critical information on climate risks affecting companies.",
    "source_url": "https://apnews.com/article/b5bb510f9167ef396ee2fbc5a02ba1cf",
    "verified": false,
    "severity": "medium",
    "id": "md289b51n0s9gi9lxw9",
    "added_at": "2025-07-13T22:09:44.101Z"
  },
  {
    "date": "2025-07-09",
    "actor": "Donald Trump",
    "category": "Policy",
    "title": "Trump\\'s Middle East Visit Coincides with Family\\'s Business Expansion",
    "description": "President Trump\\'s Middle East visit coincided with his family\\'s business and cryptocurrency interests expanding in the region, raising concerns over potential conflicts of interest influencing U.S. foreign policy.",
    "source_url": "https://apnews.com/article/cbb7d2354304ce0308800819944cf3f8",
    "verified": false,
    "severity": "medium",
    "id": "md26zentjamkdyxu3f",
    "added_at": "2025-07-13T21:34:02.489Z"
  },
  {
    "date": "2025-07-09",
    "actor": "Federal Appeals Court",
    "category": "Legal Proceedings",
    "title": "Appeals Court Rules on Civil Rights Violation Case",
    "description": "A federal appeals court upheld a lower court\\'s decision that a police department violated an individual\\'s civil rights by conducting an unlawful search and seizure, awarding damages to the plaintiff.",
    "source_url": "https://www.circuitcourt.gov/opinions/070920.pdf",
    "verified": false,
    "severity": "medium",
    "id": "md26zebvlk4lkdme11",
    "added_at": "2025-07-13T21:34:02.059Z"
  },
  {
    "date": "2025-07-08",
    "actor": "Newly Elected House Members",
    "category": "Corporate Ethics",
    "title": "New House Members See PAC Donations Surge After Committee Assignments",
    "description": "Following their committee assignments, new members of the U.S. House of Representatives experienced a significant increase in political action committee (PAC) donations, highlighting the influence of committee roles on fundraising dynamics.",
    "source_url": "https://www.opensecrets.org/news/2025/07/08/new-house-members-see-pac-donations-surge-after-committee-assignments/",
    "verified": false,
    "severity": "medium",
    "id": "md4m3uvoz3b6yl6j5qi",
    "added_at": "2025-07-15T14:12:56.724Z"
  },
  {
    "date": "2025-07-08",
    "actor": "U.S. Supreme Court",
    "category": "Legal Proceedings",
    "title": "Supreme Court Allows Deportation of Migrants to South Sudan",
    "description": "The Supreme Court lifted a lower court\\'s order blocking the deportation of eight men to South Sudan. The deportation proceeded after the South Sudanese government provided assurances regarding the migrants\\' safety and well-being upon arrival.",
    "source_url": "https://en.wikipedia.org/wiki/D.V.D._v._Department_of_Homeland_Security",
    "verified": false,
    "severity": "medium",
    "id": "md3g94hnurdnwc4g8z",
    "added_at": "2025-07-14T18:41:18.587Z"
  },
  {
    "date": "2025-07-08",
    "actor": "Department of Homeland Security (DHS)",
    "category": "Leadership Appointments or Departures",
    "title": "New DHS Secretary Appointed Amidst Organizational Changes",
    "description": "A new Secretary of Homeland Security has been appointed following the resignation of the previous secretary, coinciding with ongoing organizational changes within the department.",
    "source_url": "https://www.politico.com/2025/07/08/dhs-secretary-appointment",
    "verified": true,
    "severity": "medium",
    "id": "md36obmuu7r7mnj593",
    "added_at": "2025-07-14T14:13:11.526Z"
  },
  {
    "date": "2025-07-08",
    "actor": "U.S. Supreme Court",
    "category": "Government Efficiency",
    "title": "Supreme Court Clears Way for Trump\\'s Mass Government Layoffs",
    "description": "The U.S. Supreme Court allowed former President Donald Trump\\'s executive order enabling mass government layoffs to proceed, overturning a lower court\\'s freeze. The directive, issued in February 2025, authorizes significant downsizing of the federal workforce through the Department of Government Efficiency (DOGE), previously led by Elon Musk. The decision marks a significant legal victory for the Trump administration.",
    "source_url": "https://www.ft.com/content/e2f268f6-e3ac-47fc-94c7-16ee6e40d18a",
    "verified": false,
    "severity": "high",
    "id": "md289bboucj8v74ztl",
    "added_at": "2025-07-13T22:09:44.340Z"
  },
  {
    "date": "2025-07-08",
    "actor": "Private Credit Lenders",
    "category": "Government Efficiency",
    "title": "Private Credit Supports Contractors Affected by DOGE Cuts",
    "description": "Private credit lenders, such as San Francisco-based Legalist, are increasingly supporting U.S. government contractors impacted by Elon Musk\\'s cost-cutting measures through the Department of Government Efficiency (DOGE). Since the beginning of 2025, Legalist has extended over $100 million in bridge financing to contractors awaiting government reimbursement after halted or canceled contracts. These loans help stabilize federal contracting amid political shifts.",
    "source_url": "https://www.ft.com/content/aa3699fa-2923-4207-b244-89af94c46279",
    "verified": false,
    "severity": "medium",
    "id": "md289bboy51xdre6hq",
    "added_at": "2025-07-13T22:09:44.340Z"
  },
  {
    "date": "2025-07-08",
    "actor": "U.S. Securities and Exchange Commission (SEC)",
    "category": "Corporate Ethics",
    "title": "SEC Targets \\'AI Washing\\' in Corporate Disclosures",
    "description": "The SEC is intensifying efforts to prevent companies from overstating their use of artificial intelligence, a practice known as \\'AI washing.\\' The agency has prioritized AI in its 2025 oversight agenda, issuing comment letters requiring companies to substantiate their AI-related claims.",
    "source_url": "https://www.reuters.com/legal/legalindustry/ai-washing-regulatory-private-actions-stop-overstating-claims-2025-05-30/",
    "verified": true,
    "severity": "medium",
    "id": "md289b513ddefalqo1k",
    "added_at": "2025-07-13T22:09:44.101Z"
  },
  {
    "date": "2025-07-07",
    "actor": "U.S. Customs and Border Protection",
    "category": "Government Oversight",
    "title": "Shooting Attack at Texas Border Patrol Station",
    "description": "A gunman attacked the U.S. Customs and Border Protection station in McAllen, Texas, wounding a McAllen police officer before being fatally shot by Border Patrol officers and local police. Two people, an officer and a Border Patrol employee, were injured by shattered glass during the attack.",
    "source_url": "https://en.wikipedia.org/wiki/2025_shooting_of_Texas_Border_Patrol_officers",
    "verified": false,
    "severity": "high",
    "id": "md7gx4ek83awl8rjvvy",
    "added_at": "2025-07-17T14:11:02.924Z"
  },
  {
    "date": "2025-07-07",
    "actor": "Donald Trump",
    "category": "Business",
    "title": "Trump Organization Partners with Saudi Firm for Qatar Golf Resort",
    "description": "The Trump Organization announced a partnership with Saudi firm Dar Global to develop a luxury golf resort in Qatar, featuring Trump-branded villas and an 18-hole course, raising ethical concerns over foreign business dealings.",
    "source_url": "https://apnews.com/article/7379bee2e307d39bd43b534a05ae3207",
    "verified": false,
    "severity": "medium",
    "id": "md28mzkt4csn1n54jic",
    "added_at": "2025-07-13T22:20:22.301Z"
  },
  {
    "date": "2025-07-07",
    "actor": "Elon Musk",
    "category": "Government Contract Dispute",
    "title": "SpaceX Sues California Agency Over Launch Expansion Denial",
    "description": "A U.S. District Court judge ruled that SpaceX can proceed with a lawsuit against the California Coastal Commission, alleging the agency unfairly targeted the company due to CEO Elon Musk’s political views. The case involves a denied proposal to expand rocket launches from Vandenberg U.S. Space Force Base.",
    "source_url": "https://www.reuters.com/legal/government/musks-spacex-can-pursue-retaliation-lawsuit-against-california-agency-judge-2025-07-07/",
    "verified": true,
    "severity": "medium",
    "id": "md28mys26pgegp4qb2j",
    "added_at": "2025-07-13T22:20:21.266Z"
  },
  {
    "date": "2025-07-07",
    "actor": "Elon Musk",
    "category": "Platform Policy Changes",
    "title": "Musk Forms \\'America Party\\', Intensifying Tesla\\'s Political Risks",
    "description": "Elon Musk has intensified Tesla\\'s political risks by announcing the formation of a new political entity, the America Party, aimed at contesting key elections. This move follows his controversial support for Donald Trump\\'s 2024 presidential campaign and a brief stint as head of the Department of Government Efficiency, from which he resigned in May 2025. Critics argue that Musk\\'s political ambitions may divert attention from core business challenges.",
    "source_url": "https://www.reuters.com/commentary/breakingviews/elon-musk-turns-teslas-political-risk-dial-11-2025-07-07/",
    "verified": true,
    "severity": "medium",
    "id": "md289bbo7m6ollglwxp",
    "added_at": "2025-07-13T22:09:44.340Z"
  },
  {
    "date": "2025-07-03",
    "actor": "U.S. Supreme Court",
    "category": "Legal Proceedings",
    "title": "Supreme Court Limits Nationwide Injunctions in Election Overhaul Case",
    "description": "The Supreme Court ruled 6-3 that federal district courts cannot issue nationwide injunctions, a decision that impacts challenges to President Trump\\'s executive order on election reforms. The ruling restricts the scope of injunctions to the parties involved in the lawsuit, aligning with the Court\\'s recent trend to limit such injunctions.",
    "source_url": "https://www.spreaker.com/episode/supreme-court-decisions-reshape-federal-power-and-immigration-debate--66963230",
    "verified": false,
    "severity": "medium",
    "id": "mdbr7i2y0fpd7q8sidzr",
    "added_at": "2025-07-20T14:10:08.074Z"
  },
  {
    "date": "2025-07-02",
    "actor": "Donald Trump",
    "category": "Financial",
    "title": "Trump\\'s Media Group Faces Potential Foreign Investment Scrutiny",
    "description": "President Trump\\'s media company, Trump Media & Technology Group (TMTG), which owns Truth Social, is under scrutiny for potential foreign investments. Critics express concerns that foreign entities could influence U.S. politics by investing in TMTG, given Trump\\'s significant ownership stake valued at around $3.8 billion.",
    "source_url": "https://www.france24.com/en/live-news/20241113-trump-presidency-raises-fresh-conflict-of-interest-concerns",
    "verified": false,
    "severity": "medium",
    "id": "md3gzobfn352b1jgl9",
    "added_at": "2025-07-14T19:01:57.339Z"
  },
  {
    "date": "2025-07-02",
    "actor": "Donald Trump",
    "category": "Financial",
    "title": "Trump\\'s Middle East Business Ventures Raise Ethical Questions",
    "description": "During his Middle East trip, President Trump\\'s family\\'s cryptocurrency venture, $Trump, attracted a $2 billion investment from an Abu Dhabi-backed firm. This development has raised ethical concerns about potential conflicts of interest and the intertwining of private business interests with U.S. foreign policy.",
    "source_url": "https://www.washingtonpost.com/politics/2025/05/13/trump-mideast-business-conflicts/",
    "verified": true,
    "severity": "high",
    "id": "md3gzobfmy14bl2w6d",
    "added_at": "2025-07-14T19:01:57.339Z"
  },
  {
    "date": "2025-07-02",
    "actor": "Donald Trump",
    "category": "Financial",
    "title": "Trump\\'s Acceptance of Qatari Jet Raises Ethical Concerns",
    "description": "President Trump\\'s acceptance of a $400 million luxury jet from Qatar to serve as Air Force One has elicited bipartisan criticism. Critics argue that this move could be perceived as a quid pro quo, raising questions about potential conflicts of interest and the influence of foreign governments on U.S. politics.",
    "source_url": "https://www.theguardian.com/us-news/2025/may/15/trump-acceptance-qatari-jet-ethical-concerns",
    "verified": false,
    "severity": "high",
    "id": "md3gzobfn31dogzfo1",
    "added_at": "2025-07-14T19:01:57.339Z"
  },
  {
    "date": "2025-07-02",
    "actor": "Paramount Global",
    "category": "Legal Proceedings",
    "title": "Paramount Settles Lawsuit with Trump Over \\'60 Minutes\\' Interview",
    "description": "Paramount Global agreed to pay $16 million to Donald Trump to settle a lawsuit alleging deceptive editing of a \\'60 Minutes\\' interview with Kamala Harris, Trump\\'s 2024 presidential opponent. The settlement also includes releasing transcripts of future presidential candidate interviews on \\'60 Minutes\\'.",
    "source_url": "https://www.nytimes.com/2025/07/02/business/paramount-settlement-trump-60-minutes.html",
    "verified": true,
    "severity": "medium",
    "id": "md2899dt9pl5n8i274",
    "added_at": "2025-07-13T22:09:41.825Z"
  },
  {
    "date": "2025-07-01",
    "actor": "Agribusiness and Hospitality Sectors",
    "category": "Corporate Ethics",
    "title": "Agribusiness and Hospitality Sectors Invest Millions in Republican Campaigns Amid Deportation Threats",
    "description": "Facing potential deportations of undocumented workers, agribusiness and hospitality industries have contributed millions to Republican campaigns, aiming to influence immigration policy decisions.",
    "source_url": "https://www.opensecrets.org/news/2025/06/25/agribusiness-and-hospitality-sectors-invest-millions-in-republican-campaigns-amid-deportation-threats/",
    "verified": false,
    "severity": "high",
    "id": "md4m3uvolscuk4l4s5k",
    "added_at": "2025-07-15T14:12:56.724Z"
  },
  {
    "date": "2025-07-01",
    "actor": "House Appropriations Committee",
    "category": "Budget",
    "title": "House Appropriators Slam DHS for \\'Egregious\\' ICE Overspending",
    "description": "The House Appropriations Committee criticized the Department of Homeland Security for excessive reliance on reprogramming and transfers to fund Immigration and Customs Enforcement (ICE) operations, leading to significant budget overruns. The committee introduced new restrictions in the fiscal 2026 homeland security spending bill to address these concerns.",
    "source_url": "https://federalnewsnetwork.com/budget/2025/07/house-appropriators-slam-dhs-for-egregious-ice-overspending/",
    "verified": false,
    "severity": "high",
    "id": "md3i28dyzmsxnxx3qq",
    "added_at": "2025-07-14T19:31:56.278Z"
  },
  {
    "date": "2025-06-30",
    "actor": "U.S. Supreme Court",
    "category": "Legal Proceedings",
    "title": "Supreme Court Adds Seven New Cases to 2025-26 Term",
    "description": "The Court granted certiorari to seven new cases for its forthcoming term, including Bowe v. United States, Barrett v. United States, and Chiles v. Salazar, covering topics from incarcerated rights to the constitutionality of state laws.",
    "source_url": "https://www.scotusblog.com/2025/06/court-adds-seven-new-cases-to-the-2025-26-term/",
    "verified": false,
    "severity": "medium",
    "id": "mdf7f9rrucwridykdgk",
    "added_at": "2025-07-23T00:07:22.935Z"
  },
  {
    "date": "2025-06-30",
    "actor": "Donald Trump",
    "category": "Legal Proceedings",
    "title": "Federal judges strike down Trump law firm orders",
    "description": "Four federal judges ruled that Trump’s executive orders targeting specific law firms are unconstitutional and violate separation of powers, issuing permanent injunctions that the White House has not appealed.",
    "source_url": "https://www.reuters.com/legal/government/what-republican-democratic-judges-said-about-trumps-law-firm-orders-2025-06-30/",
    "verified": true,
    "severity": "high",
    "id": 721045,
    "added_at": "2025-06-30T14:20:00Z"
  },
  {
    "date": "2025-06-30",
    "actor": "Department of Government Efficiency (DOGE)",
    "category": "Government Oversight",
    "title": "Musk’s DOGE unit accessed sensitive federal data",
    "description": "The DOGE unit led by Musk gained access to nonpublic data across NASA, CFPB, and Labor—prompting concerns about conflicts of interest and potential misuse tied to his private businesses.",
    "source_url": "https://www.washingtonpost.com/investigations/2025/musk-doge-personal-data-tesla-companies/",
    "verified": true,
    "severity": "high",
    "id": 584239,
    "added_at": "2025-06-30T14:20:00Z"
  },
  {
    "date": "2025-06-30",
    "actor": "Department of Justice (DOJ)",
    "category": "Government Oversight",
    "title": "DOJ sues Los Angeles over sanctuary policies",
    "description": "The Justice Department filed suit against Los Angeles, claiming sanctuary policies are obstructing federal immigration law enforcement and deploying National Guard troops to enforce compliance.",
    "source_url": "https://www.reuters.com/legal/government/justice-department-sues-la-over-immigration-enforcement-policies-2025-06-30/",
    "verified": true,
    "severity": "medium",
    "id": 410329,
    "added_at": "2025-06-30T14:20:00Z"
  },
  {
    "date": "2025-06-30",
    "actor": "Donald Trump",
    "category": "Legal Proceedings",
    "title": "Trump appeals blocking of Perkins Coie order",
    "description": "The administration appealed a judge’s ruling that struck down Trump’s executive order targeting Perkins Coie, which sought to revoke their security clearances and federal contracts.",
    "source_url": "https://www.reuters.com/legal/government/trump-appeals-ruling-blocking-executive-order-against-law-firm-perkins-coie-2025-06-30/",
    "verified": true,
    "severity": "medium",
    "id": 275839,
    "added_at": "2025-06-30T14:20:00Z"
  },
  {
    "date": "2025-06-30",
    "actor": "Donald Trump",
    "category": "Government Oversight",
    "title": "Trump defends EEOC firing amid legal challenge",
    "description": "The administration moved to dismiss a lawsuit by former EEOC Commissioner Jocelyn Samuels, arguing Trump had broad authority to remove commissioners despite EEOC’s independent status.",
    "source_url": "https://www.reuters.com/legal/government/trump-administration-says-eeoc-firing-was-legal-moves-nix-lawsuit-2025-06-30/",
    "verified": true,
    "severity": "medium",
    "id": 824302,
    "added_at": "2025-06-30T14:20:00Z"
  },
  {
    "date": "2025-06-30",
    "actor": "Elon Musk",
    "category": "Corporate Ethics",
    "title": "Musk slams Trump spending bill on X",
    "description": "Musk criticized Trump’s $3.3T spending legislation as ‘utterly insane,’ called for a new political party, and threatened lawmakers who supported it—escalating their public feud.",
    "source_url": "https://www.reuters.com/business/autos-transportation/elon-musk-renews-criticism-trump-spending-bill-calls-new-political-party-2025-06-30/",
    "verified": true,
    "severity": "medium",
    "id": 993476,
    "added_at": "2025-06-30T14:20:00Z"
  },
  {
    "date": "2025-06-29",
    "actor": "Donald Trump",
    "category": "Financial",
    "title": "Test entry",
    "description": "This is a test.",
    "source_url": "https://example.com",
    "verified": true,
    "severity": "medium",
    "id": "304b1246-eadc-4b6f-9c39-a61166379717",
    "added_at": "2025-06-29T23:08:01.788Z"
  },
  {
    "date": "2025-06-28",
    "actor": "U.S. Supreme Court",
    "category": "Civil Liberties",
    "title": "Supreme Court limits nationwide injunctions",
    "description": "The Supreme Court ruled to curtail federal judges’ authority to issue nationwide injunctions, altering the balance of judicial oversight in major federal policy disputes.",
    "source_url": "https://www.reuters.com/world/us/trump-victorious-again-us-supreme-court-wraps-up-its-term-2025-06-28/",
    "verified": true,
    "severity": "medium",
    "id": 455281,
    "added_at": "2025-06-30T14:20:00Z"
  },
  {
    "date": "2025-06-27",
    "actor": "Pam Bondi",
    "category": "Civil Liberties",
    "title": "Bondi denies knowledge of masked ICE raids",
    "description": "Bondi claimed she was unaware of ICE agents wearing masks during raids, despite video evidence, prompting criticism over transparency and enforcement tactics.",
    "source_url": "https://www.theguardian.com/us-news/2025/jun/25/ag-pam-bondi-ice-masks-raids",
    "verified": true,
    "severity": "medium",
    "id": 127,
    "added_at": "2025-06-28T15:05:00Z"
  },
  {
    "date": "2025-06-27",
    "actor": "Pam Bondi / DOJ",
    "category": "Legal Proceedings",
    "title": "Bondi fires three Jan 6 prosecutors",
    "description": "Attorney General Bondi abruptly dismissed at least three career DOJ prosecutors overseeing Jan 6 cases without explanation, raising alarms about politicized purges within the Department.",
    "source_url": "https://apnews.com/article/1107441a68cef171dfff4e680e438452",
    "verified": true,
    "severity": "high",
    "id": 126,
    "added_at": "2025-06-28T15:00:00Z"
  },
  {
    "date": "2025-06-27",
    "actor": "ICE",
    "category": "Civil Liberties",
    "title": "Mother with cancer detained in LA courthouse",
    "description": "A Honduran mother and her six-year-old leukemia son were arrested outside LA court despite legal residency and medical need.",
    "source_url": "https://www.theguardian.com/us-news/2025/jun/27/honduras-mother-ice-arrest-lawsuit",
    "verified": true,
    "severity": "high",
    "id": 121,
    "added_at": "2025-06-28T13:50:00Z"
  },
  {
    "date": "2025-06-27",
    "actor": "Supreme Court (with Trump/Bondi)",
    "category": "Civil Liberties",
    "title": "High court limits injunctions, empowering Trump's agenda",
    "description": "Supreme Court ruling curtails power of nationwide injunctions—cited by Trump and Bondi as enabling actions like deportations and citizenship rollbacks.",
    "source_url": "https://time.com/7298416/trump-bondi-supreme-court-birthright-citizenship/",
    "verified": true,
    "severity": "high",
    "id": 103,
    "added_at": "2025-06-28T12:10:00Z"
  },
  {
    "date": "2025-06-27",
    "actor": "Donald Trump",
    "category": "Legal Proceedings",
    "title": "Judge blocks Trump order targeting law firm Susman Godfrey",
    "description": "Federal judge ruled Trump's executive order suspending contracts and clearances for Susman Godfrey was unconstitutional and retaliatory.",
    "source_url": "https://www.washingtonpost.com/politics/2025/06/27/judge-trump-law-firms-susman-godfrey/",
    "verified": true,
    "severity": "medium",
    "id": 102,
    "added_at": "2025-06-28T12:05:00Z"
  },
  {
    "date": "2025-06-26",
    "actor": "Pam Bondi (Attorney General)",
    "category": "Government Oversight",
    "title": "Bondi dodges questions on Trump crypto deal with UAE",
    "description": "At a Senate hearing, Bondi declined to address concerns that a $2 billion UAE investment in Trump’s World Liberty Financial crypto could influence U.S. policy, deflecting to unrelated drug trafficking issues.",
    "source_url": "https://www.thedailybeast.com/pam-bondi-goes-bonkers-when-grilled-about-trumps-crypto-corruption",
    "verified": true,
    "severity": "medium",
    "id": 435678,
    "added_at": "2025-07-01T09:00:22-05:00"
  },
  {
    "date": "2025-06-26",
    "actor": "U.S. Congress",
    "category": "Government Oversight",
    "title": "Congress delays Iran briefing",
    "description": "Speaker Johnson and Senate Republicans delayed classified briefing on Iran strikes, sparking backlash from Senate Dems over transparency.",
    "source_url": "https://indiatimes.com/news/donald-trump-officials-face-senate-fury-as-chuck-schumer-slams-delay-in-briefing-over-iran-nuclear-airstrikes-662146.html",
    "verified": true,
    "severity": "medium",
    "id": 138,
    "added_at": "2025-06-28T16:45:00Z"
  },
  {
    "date": "2025-06-26",
    "actor": "Speaker Mike Johnson",
    "category": "Government Oversight",
    "title": "Ethics complaint filed against Speaker Johnson",
    "description": "A formal ethics complaint accuses Speaker Johnson of failing to disclose financial holdings and potential conflicts tied to donations and stock holdings.",
    "source_url": "https://meidasnews.com/news/ethics-complaint-filed-against-mike-johnson-over-shady-financials",
    "verified": true,
    "severity": "medium",
    "id": 130,
    "added_at": "2025-06-28T16:00:00Z"
  },
  {
    "date": "2025-06-26",
    "actor": "Pam Bondi",
    "category": "Financial",
    "title": "Bondi deflects on Trump crypto stake query",
    "description": "In Senate hearing, Bondi refused to address concerns about a $2 billion UAE investment in Trump's crypto venture, pivoting to drug trafficking instead—raising questions about transparency.",
    "source_url": "https://www.thedailybeast.com/pam-bondi-goes-bonkers-when-grilled-about-trumps-crypto-corruption/",
    "verified": true,
    "severity": "medium",
    "id": 129,
    "added_at": "2025-06-28T15:15:00Z"
  },
  {
    "date": "2025-06-26",
    "actor": "Palantir",
    "category": "Corporate Ethics",
    "title": "Bay Area Palantir protest draws 200 demonstrators",
    "description": "Over 100 protesters blockaded Palantir's Palo Alto office, condemning its role in surveillance and deportations.",
    "source_url": "https://www.sfgate.com/tech/article/ice-protesters-palantir-bay-area-20396486.php",
    "verified": true,
    "severity": "medium",
    "id": 123,
    "added_at": "2025-06-28T14:00:00Z"
  },
  {
    "date": "2025-06-26",
    "actor": "Palantir",
    "category": "Corporate Ethics",
    "title": "Protests at Palantir NYC office",
    "description": "Six arrested blocking Palantir NYC office amid protests over its $30M ICE deportation software contract.",
    "source_url": "https://www.theguardian.com/us-news/2025/jun/26/trump-palantir-protest-arrests",
    "verified": true,
    "severity": "medium",
    "id": 122,
    "added_at": "2025-06-28T13:55:00Z"
  },
  {
    "date": "2025-06-24",
    "actor": "Palantir (Stephen Miller ties)",
    "category": "Government Oversight",
    "title": "Stephen Miller holds stake in Palantir",
    "description": "Deputy Chief of Staff Stephen Miller owns $100k–250k in Palantir stock while pushing contracts for ImmigrationOS—raising conflict concerns.",
    "source_url": "https://newrepublic.com/post/197149/stephen-miller-palantir-stocks-immigration-report",
    "verified": true,
    "severity": "high",
    "id": 124,
    "added_at": "2025-06-28T14:05:00Z"
  },
  {
    "date": "2025-06-24",
    "actor": "ICE / LAPD",
    "category": "Civil Liberties",
    "title": "US citizen detained at LA street vendor raid",
    "description": "ICE arrested a U.S. citizen street vendor; LAPD accused of assisting federal agents, prompting protests.",
    "source_url": "https://en.wikipedia.org/wiki/June_2025_Los_Angeles_protests",
    "verified": true,
    "severity": "medium",
    "id": 120,
    "added_at": "2025-06-28T13:45:00Z"
  },
  {
    "date": "2025-06-23",
    "actor": "Iran",
    "category": "Government Oversight",
    "title": "Iran threatens to close Strait of Hormuz",
    "description": "Iran's parliament voted to consider closing the Strait of Hormuz as retaliation for U.S. strikes—threatening global oil supply.",
    "source_url": "https://en.wikipedia.org/wiki/2025_Iran_threat_of_Strait_of_Hormuz_closure",
    "verified": true,
    "severity": "medium",
    "id": 137,
    "added_at": "2025-06-28T16:40:00Z"
  },
  {
    "date": "2025-06-23",
    "actor": "Iran",
    "category": "Election Integrity",
    "title": "Iran missiles hit U.S. base in Qatar",
    "description": "Iran launched missiles at the Al‑Udeid Air Base in Qatar, prompting regional escalation but causing no reported casualties.",
    "source_url": "https://www.reuters.com/world/middle-east/iran-weighs-retaliation-against-us-strikes-nuclear-sites-2025-06-23/",
    "verified": true,
    "severity": "medium",
    "id": 136,
    "added_at": "2025-06-28T16:35:00Z"
  },
  {
    "date": "2025-06-23",
    "actor": "Pam Bondi",
    "category": "Corporate Ethics",
    "title": "Bondi grilled over Qatar ties",
    "description": "Bondi dodged questions in congressional hearing about undisclosed work and a jet linked to Qatar, raising concerns over conflicts of interest and disclosure failures.",
    "source_url": "https://economictimes.indiatimes.com/news/international/global-trends/dont-talk-to-me-insult-me-publicly-pam-bondi-grilled-left-scrambling-over-sketchy-qatar-past/articleshow/122050968.cms",
    "verified": true,
    "severity": "medium",
    "id": 128,
    "added_at": "2025-06-28T15:10:00Z"
  },
  {
    "date": "2025-06-23",
    "actor": "Media Matters (unverified)",
    "category": "Platform Manipulation",
    "title": "Media Matters alleges FTC/X collusion",
    "description": "Unverified claim that FTC's ad boycott probe of Media Matters was politically motivated and coordinated with Musk's X as retaliation.",
    "source_url": "https://www.reuters.com/legal/litigation/media-matters-sues-block-ftc-probe-over-musks-x-boycott-claims-2025-06-23/",
    "verified": false,
    "severity": "medium",
    "id": 105,
    "added_at": "2025-06-28T12:20:00Z"
  },
  {
    "date": "2025-06-23",
    "actor": "Federal Trade Commission (FTC)",
    "category": "Platform Manipulation",
    "title": "FTC probes ad boycott claims tied to Musk's X",
    "description": "Media Matters sued FTC, alleging the probe was retaliation influenced by Elon Musk and aimed at silencing critics over extremist ads on X.",
    "source_url": "https://www.politico.com/news/2025/06/23/media-matters-sues-ftc-over-retaliatory-investigation-00419902",
    "verified": true,
    "severity": "medium",
    "id": 104,
    "added_at": "2025-06-28T12:15:00Z"
  },
  {
    "date": "2025-06-22",
    "actor": "Donald Trump",
    "category": "Government Oversight",
    "title": "Trump bypasses Congress for Iran strikes",
    "description": "Trump authorized U.S. airstrikes on Iranian nuclear sites without consulting Congress, raising constitutional war‑powers objections.",
    "source_url": "https://www.vanityfair.com/news/story/republicans-back-trumps-decision-bomb-iran",
    "verified": true,
    "severity": "high",
    "id": 135,
    "added_at": "2025-06-28T16:30:00Z"
  },
  {
    "date": "2025-06-22",
    "actor": "Donald Trump",
    "category": "Legal Proceedings",
    "title": "Trump pardons 1,500 Jan 6 rioters",
    "description": "Trump issued pardons to over 1,500 individuals involved in the January 6 Capitol breach immediately after taking office.",
    "source_url": "https://www.nbcnews.com/politics/donald-trump/trump-pardoned-over-1-300-jan-6-defendants-rcna12345",
    "verified": true,
    "severity": "high",
    "id": 134,
    "added_at": "2025-06-28T16:25:00Z"
  },
  {
    "date": "2025-06-20",
    "actor": "U.S. Supreme Court",
    "category": "Legal Proceedings",
    "title": "Supreme Court Upholds Jurisdiction Over PLO in Terrorism Cases",
    "description": "In a unanimous decision, the Supreme Court held that the personal jurisdiction provision of the Promoting Security and Justice for Victims of Terrorism Act does not violate the Fifth Amendment\\'s Due Process Clause, allowing U.S. courts to hear cases against the Palestine Liberation Organization and the Palestinian Authority related to terrorist attacks outside the U.S.",
    "source_url": "https://en.wikipedia.org/wiki/Fuld_v._Palestine_Liberation_Organization",
    "verified": false,
    "severity": "high",
    "id": "md3g94hnc8sd6mat2a7",
    "added_at": "2025-07-14T18:41:18.587Z"
  },
  {
    "date": "2025-06-18",
    "actor": "U.S. Supreme Court",
    "category": "Legal Proceedings",
    "title": "Supreme Court Upholds Tennessee\\'s Ban on Gender-Affirming Care for Minors",
    "description": "The Court ruled that Tennessee\\'s law prohibiting certain gender-transition medical care for minors does not violate the Equal Protection Clause of the 14th Amendment.",
    "source_url": "https://www.washingtonpost.com/politics/interactive/2025/supreme-court-cases-decisions/",
    "verified": true,
    "severity": "high",
    "id": "mdf7f9rrrbczg5yqy6a",
    "added_at": "2025-07-23T00:07:22.935Z"
  },
  {
    "date": "2025-06-17",
    "actor": "Oil and Gas Industry",
    "category": "Corporate Ethics",
    "title": "Oil and Gas Lobbying Expenditure Reaches $38 Million in Early 2025",
    "description": "The oil and gas industry spent $38 million on federal lobbying in the first quarter of 2025, indicating sustained efforts to influence energy policy, though this amount is below previous highs.",
    "source_url": "https://www.opensecrets.org/news/2025/06/17/oil-and-gas-lobbying-reached-38-million-in-early-2025-yet-fell-short-of-previous-highs/",
    "verified": false,
    "severity": "medium",
    "id": "md4m3uvorqm5wiqac3d",
    "added_at": "2025-07-15T14:12:56.724Z"
  },
  {
    "date": "2025-06-17",
    "actor": "Trump family",
    "category": "Corporate Ethics",
    "title": "World Liberty Financial crypto scandal",
    "description": "World Liberty Financial, majority‑owned by Trump family, took in foreign investments (Justin Sun, Abu Dhabi) amid conflicts and relaxed SEC scrutiny.",
    "source_url": "https://en.wikipedia.org/wiki/World_Liberty_Financial",
    "verified": true,
    "severity": "high",
    "id": 143,
    "added_at": "2025-06-28T17:20:00Z"
  },
  {
    "date": "2025-06-16",
    "actor": "Trump family (Donald Jr., Eric)",
    "category": "Corporate Ethics",
    "title": "Trump Mobile smartphone launched",
    "description": "Trump's sons launched a $499 Trump‑branded smartphone through their business, drawing scrutiny over using the presidency for commercial gain.",
    "source_url": "https://www.businessinsider.com/how-much-money-has-trump-made-white-house-disclosure-2025-5",
    "verified": true,
    "severity": "medium",
    "id": 139,
    "added_at": "2025-06-28T17:00:00Z"
  },
  {
    "date": "2025-06-14",
    "actor": "Donald Trump",
    "category": "Government Oversight",
    "title": "Trump holds $25–45M military parade in DC",
    "description": "Trump staged the first major military parade in DC since 1991, coinciding with Army’s 250th birthday and his own 79th; critics said it politicized the military and appeared tied to authoritarian pageantry amid recent Guard deployment.",
    "source_url": "https://en.wikipedia.org/wiki/United_States_Army_250th_Anniversary_Parade",
    "verified": true,
    "severity": "medium",
    "id": 900309,
    "added_at": "2025-07-01T09:04:59-05:00"
  },
  {
    "date": "2025-06-14",
    "actor": "ICE",
    "category": "Civil Liberties",
    "title": "Immigrant journalist detained by ICE",
    "description": "Atlanta-based Salvadoran journalist Mario Guevara, identified as press, was detained covering protests—raising press freedom concerns.",
    "source_url": "https://www.newyorker.com/news/the-lede/ice-detains-a-respected-immigrant-journalist",
    "verified": true,
    "severity": "high",
    "id": 118,
    "added_at": "2025-06-28T13:35:00Z"
  },
  {
    "date": "2025-06-13",
    "actor": "Basel Committee on Banking Supervision (BCBS)",
    "category": "Corporate Ethics",
    "title": "BCBS Releases Climate Disclosure Framework for Voluntary Reporting",
    "description": "The BCBS introduced a non-binding framework for banks to voluntarily disclose climate-related financial risks, aiming to standardize global climate governance and risk management practices.",
    "source_url": "https://www.pwc.com/us/en/industries/financial-services/library/our-take/06-27-2025.html",
    "verified": false,
    "severity": "medium",
    "id": "md4m3uvo3wet551yikt",
    "added_at": "2025-07-15T14:12:56.724Z"
  },
  {
    "date": "2025-06-12",
    "actor": "U.S. Appeals Court",
    "category": "Government Oversight",
    "title": "Appeals court allows Trump to keep Guard in L.A.",
    "description": "A federal appeals court temporarily blocked a lower court order to return control of California’s National Guard to the governor, allowing Trump’s deployment to continue while litigation continues.",
    "source_url": "https://www.reuters.com/world/us/us-court-lets-trump-retain-control-california-national-guard-now-2025-06-20/",
    "verified": true,
    "severity": "medium",
    "id": 900208,
    "added_at": "2025-07-01T09:04:59-05:00"
  },
  {
    "date": "2025-06-11",
    "actor": "Elon Musk",
    "category": "Corporate Ethics",
    "title": "Musk backtracks on Trump criticism after White House outreach",
    "description": "Musk publicly apologized for critical posts about Trump after reaching out to administration officials, sparking concerns about political influence over private billionaire speech.",
    "source_url": "https://www.reuters.com/world/us/musk-says-he-regrets-some-posts-he-made-about-trump-2025-06-11/",
    "verified": true,
    "severity": "low",
    "id": 131,
    "added_at": "2025-06-28T16:05:00Z"
  },
  {
    "date": "2025-06-10",
    "actor": "ICE",
    "category": "Government Oversight",
    "title": "ICE pays Palantir $30M for ImmigrationOS",
    "description": "ICE awarded $30M contract to Palantir for deportation tracking software—no competitive bidding amid civil liberties outcry.",
    "source_url": "https://www.wired.com/story/ice-palantir-immigrationos",
    "verified": true,
    "severity": "high",
    "id": 125,
    "added_at": "2025-06-28T14:10:00Z"
  },
  {
    "date": "2025-06-08",
    "actor": "ICE",
    "category": "Civil Liberties",
    "title": "Pregnant woman arrested alongside undocumented partner",
    "description": "U.S. citizen Cary López Alvarado was arrested while pregnant during ICE raid; footage shows her refusing to move off private property.",
    "source_url": "https://en.wikipedia.org/wiki/Detention_and_deportation_of_American_citizens_in_the_second_Trump_administration",
    "verified": true,
    "severity": "medium",
    "id": 116,
    "added_at": "2025-06-28T13:25:00Z"
  },
  {
    "date": "2025-06-07",
    "actor": "Donald Trump / Defense Sec. Pete Hegseth",
    "category": "Government Oversight",
    "title": "Trump deploys National Guard to L.A. amid ICE protests",
    "description": "Trump federalized ~2,000 National Guard troops and put 700 Marines on standby to respond to protests over ICE raids in Los Angeles, bypassing state approval and igniting debate over federal overreach.",
    "source_url": "https://www.reuters.com/world/us/white-house-aide-calls-los-angeles-anti-ice-protests-an-insurrection-2025-06-07/",
    "verified": true,
    "severity": "high",
    "id": 900107,
    "added_at": "2025-07-01T09:04:59-05:00"
  },
  {
    "date": "2025-06-05",
    "actor": "Trump Jr. & Eric Trump",
    "category": "Corporate Ethics",
    "title": "Trump sons distance from $TRUMP wallet app",
    "description": "They publicly denied involvement in $TRUMP Wallet app launched by third party, amid confusion over branding and endorsement.",
    "source_url": "https://abcnews.go.com/US/trumps-sons-distance-new-trump-branded-crypto-venture/story?id=122470346",
    "verified": true,
    "severity": "low",
    "id": 145,
    "added_at": "2025-06-28T17:30:00Z"
  },
  {
    "date": "2025-06-05",
    "actor": "Donald Trump Jr.",
    "category": "Platform Manipulation",
    "title": "Don Jr. grilled over $TRUMP coin",
    "description": "On CNBC, Jr. deflected criticism about $TRUMP's influence and insider deals, raising concerns about undisclosed foreign investment access.",
    "source_url": "https://www.thedailybeast.com/flustered-don-jr-gets-cornered-on-dads-shady-crypto-scheme/",
    "verified": true,
    "severity": "medium",
    "id": 144,
    "added_at": "2025-06-28T17:25:00Z"
  },
  {
    "date": "2025-06-05",
    "actor": "Trump",
    "category": "Corporate Ethics",
    "title": "Trump meme‑coin $TRUMP backfires",
    "description": "Though $TRUMP token soared initially, it then crashed; yet Trump profited ~$320 M from fees, while many small investors suffered losses.",
    "source_url": "https://www.reuters.com/world/us/trump-reports-tens-millions-income-crypto-ventures-2025-06-14/",
    "verified": true,
    "severity": "high",
    "id": 141,
    "added_at": "2025-06-28T17:10:00Z"
  },
  {
    "date": "2025-06-05",
    "actor": "Elon Musk / Donald Trump",
    "category": "Platform Manipulation",
    "title": "Trump and Musk trade insults in public feud",
    "description": "Musk and Trump escalated a bitter public spat involving slurs about deficits and political influence, exposing underlying tensions despite former alliance.",
    "source_url": "https://www.people.com/donald-trump-elon-musk-feud-timeline-11749663/",
    "verified": true,
    "severity": "medium",
    "id": 132,
    "added_at": "2025-06-28T16:10:00Z"
  },
  {
    "date": "2025-05-30",
    "actor": "ICE",
    "category": "Civil Liberties",
    "title": "Court: US citizen detained due to ICE error",
    "description": "Federal court ruled Peter Sean Brown, a U.S. citizen, was illegally detained by ICE under a mistaken detainer violating 4th Amendment rights.",
    "source_url": "https://www.aclu.org/press-releases/federal-court-rules-in-favor-of-u-s-citizen-illegally-detained-for-deportation-by-florida-sheriff",
    "verified": true,
    "severity": "medium",
    "id": 114,
    "added_at": "2025-06-28T13:15:00Z"
  },
  {
    "date": "2025-05-23",
    "actor": "Department of Government Efficiency (DOGE)",
    "category": "Government Oversight",
    "title": "DOGE expands Grok AI use in federal agencies",
    "description": "Musk’s DOGE pushed a customized Grok AI chatbot into DHS and other agencies without approval, raising conflict-of-interest and privacy concerns over handling sensitive data.",
    "source_url": "https://www.reuters.com/sustainability/boards-policy-regulation/musks-doge-expanding-his-grok-ai-us-government-raising-conflict-concerns-2025-05-23/",
    "verified": true,
    "severity": "high",
    "id": 876543,
    "added_at": "2025-07-01T09:00:22-05:00"
  },
  {
    "date": "2025-05-22",
    "actor": "FTC and DOJ Antitrust Division",
    "category": "Corporate Ethics",
    "title": "FTC and DOJ File Statement in Antitrust Case Against Major Asset Managers",
    "description": "The Federal Trade Commission and the Department of Justice Antitrust Division filed a joint Statement of Interest in a multistate antitrust case against BlackRock, Vanguard, and State Street. The lawsuit alleges that these asset managers used their stock holdings in competing coal companies to drive output reductions, leading to higher energy prices for consumers.",
    "source_url": "https://www.gibsondunn.com/gibson-dunn-esg-monthly-update-may-2025/",
    "verified": false,
    "severity": "high",
    "id": "mdff56n5me37q1ro4rd",
    "added_at": "2025-07-23T03:43:29.249Z"
  },
  {
    "date": "2025-05-22",
    "actor": "Trump",
    "category": "Platform Manipulation",
    "title": "Trump hosts private $TRUMP dinner at golf club",
    "description": "Trump held an exclusive dinner for top meme‑coin holders, offering policy access—ethics groups called it Mount Everest of American corruption.",
    "source_url": "https://en.wikipedia.org/wiki/Donald_Trump%27s_memecoin_dinner",
    "verified": true,
    "severity": "high",
    "id": 142,
    "added_at": "2025-06-28T17:15:00Z"
  },
  {
    "date": "2025-04-25",
    "actor": "George Santos",
    "category": "Financial",
    "title": "Ex-Rep. George Santos sentenced for corruption",
    "description": "Expelled NY Rep. George Santos received over 7 years prison for campaign finance and fraud schemes.",
    "source_url": "https://www.reuters.com/world/us/george-santos-sentenced-more-than-7-years-prison-new-york-times-2025-04-25/",
    "verified": true,
    "severity": "high",
    "id": 113,
    "added_at": "2025-06-28T13:10:00Z"
  },
  {
    "date": "2025-04-08",
    "actor": "President Trump",
    "category": "Corporate Ethics",
    "title": "Executive Order Targets State ESG Policies",
    "description": "President Trump issued an executive order directing the Attorney General to identify and take action to stop the enforcement of state laws addressing climate change and involving environmental, social, and governance (ESG) initiatives, including environmental justice, emissions, and carbon taxes.",
    "source_url": "https://www.pwc.com/us/en/industries/financial-services/library/our-take/05-02-25.html",
    "verified": false,
    "severity": "medium",
    "id": "mdff56n5apuybume2du",
    "added_at": "2025-07-23T03:43:29.249Z"
  },
  {
    "date": "2025-03-27",
    "actor": "Donald Trump",
    "category": "Legal Proceedings",
    "title": "Trump issues EO targeting WilmerHale law firm",
    "description": "Executive Order 14250 suspended WilmerHale lawyers' security clearances, access and contracts—a federal judge blocked it as unconstitutional retaliation.",
    "source_url": "https://en.wikipedia.org/wiki/Targeting_of_law_firms_and_lawyers_under_the_second_Trump_administration",
    "verified": true,
    "severity": "high",
    "id": 109,
    "added_at": "2025-06-28T12:40:00Z"
  },
  {
    "date": "2025-02-27",
    "actor": "Elon Musk / DOGE",
    "category": "Government Oversight",
    "title": "Musk conflicts of interest in government role",
    "description": "Critics warned Musk kept control of Tesla/SpaceX while heading DOGE, approving federal contracts for his own companies—raising conflict-of-interest alarms.",
    "source_url": "https://www.theguardian.com/us-news/2025/feb/27/elon-musk-conflicts-of-interest",
    "verified": true,
    "severity": "high",
    "id": 106,
    "added_at": "2025-06-28T12:25:00Z"
  },
  {
    "date": "2025-02-14",
    "actor": "Elon Musk / DOGE",
    "category": "Legal Proceedings",
    "title": "Lawsuits challenge Musk's DOGE authority",
    "description": "Two lawsuits filed alleging Musk ran DOGE without Senate confirmation, misused access to federal data, blocked payments, and dismantled agencies unconstitutionally.",
    "source_url": "https://www.politico.com/news/2025/02/14/elon-musk-doge-lawsuits-constitution-00204479",
    "verified": true,
    "severity": "high",
    "id": 107,
    "added_at": "2025-06-28T12:30:00Z"
  },
  {
    "date": "2025-02-12",
    "actor": "DOJ",
    "category": "Government Oversight",
    "title": "DOJ halts foreign bribery investigations",
    "description": "Trump DOJ suspended investigations into overseas corruption and disbanded an FBI task force probing foreign election interference.",
    "source_url": "https://www.reuters.com/investigations/how-trump-defanged-justice-departments-political-corruption-watchdogs-2025-06-09/",
    "verified": true,
    "severity": "high",
    "id": 112,
    "added_at": "2025-06-28T13:05:00Z"
  },
  {
    "date": "2025-02-10",
    "actor": "Justice Department under Trump",
    "category": "Government Oversight",
    "title": "DOJ orders dropping corruption case against NYC mayor",
    "description": "Unverifiable internal DOJ memo directed prosecutors to drop the case against Mayor Eric Adams, triggering seven resignations and raising politicization concerns.",
    "source_url": "https://en.wikipedia.org/wiki/Targeting_of_political_opponents_and_civil_society_under_the_second_Trump_administration",
    "verified": false,
    "severity": "medium",
    "id": 110,
    "added_at": "2025-06-28T12:45:00Z"
  },
  {
    "date": "2025-02-07",
    "actor": "Trump / $TRUMP",
    "category": "Platform Manipulation",
    "title": "$TRUMP copycat tokens flood market",
    "description": "Over 700 spoof tokens surfaced imitating Trump's meme‑coin, misleading investors and raising fraud concerns.",
    "source_url": "https://www.theguardian.com/us-news/2025/feb/07/trump-meme-coin-crypto-copycats",
    "verified": true,
    "severity": "medium",
    "id": 146,
    "added_at": "2025-06-28T17:35:00Z"
  },
  {
    "date": "2025-02-02",
    "actor": "Jay Alix",
    "category": "Corporate Ethics",
    "title": "Bankruptcy adviser Jay Alix ends long lobbying crusade against McKinsey",
    "description": "Jay Alix concluded a seven-year, $5 million lobbying effort against McKinsey, aiming to enforce conflict of interest disclosures in government work. This followed a legal battle where McKinsey settled charges in 2019 for failing to disclose conflicts in bankruptcy cases. Alix\\'s campaign led to legislation mandating such disclosures for financial advisers in bankruptcy cases and consultants for the Pentagon.",
    "source_url": "https://www.ft.com/content/9912d235-68b6-4c30-aed3-91a15de77df6",
    "verified": false,
    "severity": "medium",
    "id": "md28mzjj032f5mj90mk7",
    "added_at": "2025-07-13T22:20:22.255Z"
  },
  {
    "date": "2025-01-31",
    "actor": "DOJ / Trump Admin",
    "category": "Legal Proceedings",
    "title": "Dozens of Jan 6 prosecutors purged",
    "description": "DOJ removed 25–30 career prosecutors working on Jan 6 cases, considered part of a sweeping purge targeting personnel involved in investigations of Trump supporters.",
    "source_url": "https://www.politico.com/news/2025/01/31/doj-purges-prosecutors-january-6-cases-00201904",
    "verified": true,
    "severity": "high",
    "id": 133,
    "added_at": "2025-06-28T16:15:00Z"
  },
  {
    "date": "2025-01-24",
    "actor": "Department of Government Efficiency (DOGE)",
    "category": "Government Oversight",
    "title": "DOGE hijacks federal grants platform",
    "description": "Elon Musk's DOGE team took over grants.gov, delaying ~30 federal grant postings worth tens of millions, prompting restoration orders due to politicized interference.",
    "source_url": "https://www.washingtonpost.com/politics/2025/06/27/doge-loses-control-federal-grants/",
    "verified": true,
    "severity": "high",
    "id": 101,
    "added_at": "2025-06-28T12:00:00Z"
  },
  {
    "date": "2025-01-17",
    "actor": "Trump",
    "category": "Corporate Ethics",
    "title": "Trump launches $TRUMP meme‑coin",
    "description": "The official $TRUMP token debuted days before inauguration; Trump-affiliated entities held 80% of supply and netted ~$350 M in sales/fees.",
    "source_url": "https://en.wikipedia.org/wiki/%24Trump",
    "verified": true,
    "severity": "high",
    "id": 147,
    "added_at": "2025-06-28T17:40:00Z"
  },
  {
    "date": "2024-09-04",
    "actor": "U.S. Supreme Court",
    "category": "Legal Proceedings",
    "title": "Supreme Court Rulings Impact Health Care Industry",
    "description": "The Supreme Court issued two significant rulings: \\'Jarkesy v. SEC\\' prohibits federal agencies from imposing civil penalties via in-house processes, and \\'Loper Bright Enterprises v. Raimondo\\' overturns the \\'Chevron\\' doctrine, affecting agency interpretations of statutes.",
    "source_url": "https://www.reuters.com/legal/litigation/jarkesy-loper-bright-create-new-opportunities-offense-health-care-industry-2024-09-04/",
    "verified": true,
    "severity": "high",
    "id": "md289b50hfspg0n2vgr",
    "added_at": "2025-07-13T22:09:44.100Z"
  },
  {
    "date": "2024-07-22",
    "actor": "U.S. Supreme Court",
    "category": "Legal Proceedings",
    "title": "Supreme Court\\'s 2023 Term a Blockbuster for Businesses",
    "description": "The Court\\'s 2023 Term significantly impacted business law, including overruling the 40-year-old \\'Chevron\\' doctrine in \\'Loper Bright Enterprises v. Raimondo\\' and limiting agency rule challenges.",
    "source_url": "https://www.reuters.com/legal/legalindustry/supreme-courts-2023-term-blockbuster-businesses-2024-07-22/",
    "verified": true,
    "severity": "high",
    "id": "md289b50df5y6dm5xys",
    "added_at": "2025-07-13T22:09:44.100Z"
  },
  {
    "date": "2024-07-19",
    "actor": "U.S. Supreme Court",
    "category": "Legal Proceedings",
    "title": "Supreme Court Tightens Standing Requirements in Lawsuits",
    "description": "The Court terminated five high-profile cases from the 5th Circuit due to lack of legal standing, indicating a shift towards judicial restraint and affecting both conservative and liberal plaintiffs.",
    "source_url": "https://www.reuters.com/legal/us-supreme-court-is-making-it-harder-sue-even-conservatives-2024-07-19/",
    "verified": true,
    "severity": "medium",
    "id": "md289b504x86gi2bfu3",
    "added_at": "2025-07-13T22:09:44.100Z"
  },
  {
    "date": "2024-05-25",
    "actor": "U.S. Supreme Court",
    "category": "Legal Proceedings",
    "title": "Sackett v. EPA Limits Clean Water Act Protections",
    "description": "The Court held that the Clean Water Act covers only wetlands and permanent bodies of water with a \\'continuous surface connection\\' to traditional interstate navigable waters.",
    "source_url": "https://en.wikipedia.org/wiki/Sackett_v._Environmental_Protection_Agency_%282023%29",
    "verified": false,
    "severity": "high",
    "id": "md289b5005527myen8sd",
    "added_at": "2025-07-13T22:09:44.100Z"
  },
  {
    "date": "2024-05-09",
    "actor": "U.S. Supreme Court",
    "category": "Legal Proceedings",
    "title": "Culley v. Marshall Addresses Civil Asset Forfeiture Hearings",
    "description": "The Court ruled that the Due Process Clause requires a timely forfeiture hearing but does not require a separate preliminary hearing, impacting civil asset forfeiture procedures.",
    "source_url": "https://en.wikipedia.org/wiki/Culley_v._Marshall",
    "verified": false,
    "severity": "medium",
    "id": "md289b50yej2k83afe",
    "added_at": "2025-07-13T22:09:44.100Z"
  },
  {
    "date": "2024-03-06",
    "actor": "Legal Industry Professionals",
    "category": "Corporate Ethics",
    "title": "Stealthy political law issues - ignore at your own peril",
    "description": "The article discusses the importance of addressing specific areas of political law that are often underestimated but can have serious consequences. It covers topics such as honest services fraud, funding of 501(c)(4) organizations involved in political activities, shareholder proposals related to political activities, and the Foreign Agents Registration Act (FARA). Neglecting these areas can lead to significant legal issues for companies.",
    "source_url": "https://www.reuters.com/legal/legalindustry/stealthy-political-law-issues-ignore-your-own-peril-2024-03-06/",
    "verified": true,
    "severity": "high",
    "id": "md28mzjjyhpy895d3l",
    "added_at": "2025-07-13T22:20:22.255Z"
  }
]