[
  {
    "date": "2025-07-16",
    "actor": "Federal Employees",
    "category": "Government Efficiency",
    "title": "Federal Workers Share Impact of DOGE Policies in New Audio Series",
    "description": "An audio series titled \\'I Do Solemnly Swear\\' features testimonies from current and former federal employees detailing how DOGE policies have negatively affected agencies like the CDC, FAA, and VA, citing issues such as mass firings and reduced capacity to combat tax evasion.",
    "source_url": "https://www.axios.com/2025/07/16/doge-irs-faa-federal-workers",
    "verified": true,
    "severity": "high",
    "id": "md61i9hhi1zv2ef4b5",
    "added_at": "2025-07-16T14:11:49.253Z"
  },
  {
    "date": "2025-07-11",
    "actor": "U.S. State Department",
    "category": "Government Efficiency",
    "title": "State Department Announces Layoffs Amid DOGE-Driven Reorganization",
    "description": "The U.S. State Department informed staff of upcoming layoffs as part of a significant reorganization under the Trump administration\\'s plan to downsize federal agencies, coordinated by the Department of Government Efficiency, previously led by Elon Musk.",
    "source_url": "https://apnews.com/article/6a74fb3eee36982deef261b4f9b8799d",
    "verified": true,
    "severity": "medium",
    "id": "md61i9hhjk3cq2ciqwb",
    "added_at": "2025-07-16T14:11:49.253Z"
  },
  {
    "date": "2025-07-11",
    "actor": "White House",
    "category": "Government Efficiency",
    "title": "White House Reviews Mass Federal Layoff Plans Amid Legal Challenges",
    "description": "The White House is reviewing mass federal layoff plans to ensure legal compliance and avoid further court challenges, aiming to rapidly downsize the federal workforce, currently at 2.3 million employees, with the support of the Department of Government Efficiency.",
    "source_url": "https://www.reuters.com/legal/litigation/white-house-reviews-mass-federal-layoff-plans-aims-swift-action-2025-07-11/",
    "verified": true,
    "severity": "medium",
    "id": "md61i9hhozrdjuj8lpm",
    "added_at": "2025-07-16T14:11:49.253Z"
  },
  {
    "date": "2025-07-15",
    "actor": "Attorney General Pam Bondi",
    "category": "Government Oversight",
    "title": "Bondi avoids Epstein questions amid DOJ turmoil",
    "description": "Attorney General Pam Bondi deflected questions regarding the Justice Department\\'s handling of the Jeffrey Epstein case and internal disputes involving FBI Deputy Director Dan Bongino during a press event focused on drug seizures. She emphasized law enforcement efforts to combat fentanyl and methamphetamine smuggling, seeking to pivot attention away from ongoing controversies.",
    "source_url": "https://apnews.com/article/269d9526d270e6342e82ecae27fe6189",
    "verified": true,
    "severity": "medium",
    "id": "md61i8p2zawinf3rjq",
    "added_at": "2025-07-16T14:11:48.230Z"
  },
  {
    "date": "2025-07-16",
    "actor": "U.S. Department of Justice",
    "category": "Government Oversight",
    "title": "DOJ considered charging Minnesota judges over virtual hearings",
    "description": "The U.S. Justice Department considered criminal charges against Minnesota judges and defense lawyers who discussed virtual court hearings to protect undocumented immigrants from arrest by federal immigration officers. An FBI inquiry began in February in Minneapolis, investigating whether virtual hearing requests obstructed immigration enforcement.",
    "source_url": "https://www.reuters.com/legal/government/us-considered-charging-minnesota-judges-lawyers-immigration-crackdown-sources-2025-07-16/",
    "verified": true,
    "severity": "high",
    "id": "md61i8p2rq3jx74rmaf",
    "added_at": "2025-07-16T14:11:48.230Z"
  },
  {
    "date": "2025-07-14",
    "actor": "U.S. Supreme Court",
    "category": "Government Oversight",
    "title": "Supreme Court Allows Education Department Layoffs to Proceed",
    "description": "The Supreme Court overturned lower court decisions, permitting the Trump administration to proceed with mass layoffs at the Department of Education, reducing its workforce by nearly half. This decision follows previous legal challenges and raises questions about the future of federal education programs.",
    "source_url": "https://www.nbcnews.com/news/amp/rcna211450",
    "verified": true,
    "severity": "high",
    "id": "md61ib6u977iwa6hucg",
    "added_at": "2025-07-16T14:11:51.462Z"
  },
  {
    "date": "2025-07-13",
    "actor": "U.S. Supreme Court",
    "category": "Legal Proceedings",
    "title": "Supreme Court\\'s \\'Shadow Docket\\' Benefits Trump Administration",
    "description": "The Supreme Court\\'s expedited \\'shadow docket\\' has facilitated the Trump administration\\'s implementation of controversial policies, including mass deportations and dismissals of federal workers. This process bypasses standard legal procedures, leading to rapid policy enactments. Critics argue that it undermines the rule of law and judicial independence, while the administration defends it as a necessary response to lower court obstructions.",
    "source_url": "https://www.axios.com/2025/07/13/trump-supreme-court-shadow-emergency-docket",
    "verified": true,
    "severity": "high",
    "id": "md61iampsjegb0w871o",
    "added_at": "2025-07-16T14:11:50.737Z"
  },
  {
    "date": "2025-07-13",
    "actor": "Financial Stability Board",
    "category": "Corporate Ethics",
    "title": "FSB Releases Recommendations on Nonbank Financial Institution Leverage",
    "description": "The Financial Stability Board issued a report on July 9, 2025, providing non-binding recommendations to address risks associated with leverage in nonbank financial institutions (NBFIs) such as hedge funds, pension funds, and insurers. The report emphasizes the need for coordinated implementation of frameworks to mitigate market disruption risks and reduce reliance on central bank interventions.",
    "source_url": "https://www.pwc.com/us/en/industries/financial-services/library/our-take/07-11-2025.html",
    "verified": false,
    "severity": "medium",
    "id": "md61i9dcifo8oil3v2n",
    "added_at": "2025-07-16T14:11:49.104Z"
  },
  {
    "date": "2025-07-14",
    "actor": "Washington State Public Disclosure Commission",
    "category": "Corporate Ethics",
    "title": "SEIU Healthcare 1199 NW PAC Fined for Late Reporting",
    "description": "On May 22, 2025, the Washington State Public Disclosure Commission approved a $6,000 fine against SEIU Healthcare 1199 NW PAC for late reporting of over $430,000 in expenditures during the 2024 election cycle. The PAC failed to file a required last-minute contribution report for a $2,400 contribution made within 21 days of the November election.",
    "source_url": "https://www.pdc.wa.gov/news/2025/commission-meeting-highlights-may-2025",
    "verified": true,
    "severity": "low",
    "id": "md61i9dcf0rv3uvs6xk",
    "added_at": "2025-07-16T14:11:49.104Z"
  }
]