[
  {
    "date": "2025-07-18",
    "actor": "Donald Trump",
    "category": "Legal",
    "title": "Judge dismisses Trump\\'s $50 million lawsuit against Bob Woodward",
    "description": "A judge dismissed Donald Trump\\'s $50 million lawsuit against journalist Bob Woodward and audiobook publisher Simon & Schuster, citing insufficient grounds. Trump was given a month to file an amended claim. The lawsuit alleged copyright violations related to the publication of interviews conducted for Woodward\\'s book \\'Rage\\'.",
    "source_url": "https://www.cnn.com/2025/07/18/media/trump-woodward-lawsuit-dismissed/index.html",
    "verified": true,
    "severity": "medium",
    "id": "mdem8wj7rbbwfv0tegh",
    "added_at": "2025-07-22T14:14:33.907Z"
  },
  {
    "date": "2025-07-19",
    "actor": "Donald Trump",
    "category": "Legal",
    "title": "Trump sues Wall Street Journal over alleged defamatory article",
    "description": "Donald Trump filed a $10 billion defamation lawsuit against the Wall Street Journal, its publisher Dow Jones & Company, and News Corp, alleging that an article published on July 17, 2025, falsely claimed he wrote a lewd note about Jeffrey Epstein. The lawsuit seeks damages and a retraction of the article.",
    "source_url": "https://www.nytimes.com/2025/07/19/us/trump-sues-wall-street-journal.html",
    "verified": true,
    "severity": "high",
    "id": "mdem8wj7tbpurwyzi6k",
    "added_at": "2025-07-22T14:14:33.907Z"
  },
  {
    "date": "2025-07-20",
    "actor": "Donald Trump",
    "category": "Business",
    "title": "Trump\\'s World Liberty Financial faces scrutiny over Middle East ties",
    "description": "Donald Trump\\'s cryptocurrency venture, World Liberty Financial, co-founded with billionaire Steve Witkoff, is under scrutiny due to its partnership with the Tron crypto platform, which has been linked to militant groups like Hamas and Hezbollah. Critics express concerns over potential conflicts of interest and ethical implications.",
    "source_url": "https://www.reuters.com/technology/trump-crypto-venture-partners-with-platform-linked-middle-east-militants-2024-12-12/",
    "verified": true,
    "severity": "high",
    "id": "mdem8wj7gmmkwq1ui2e",
    "added_at": "2025-07-22T14:14:33.907Z"
  },
  {
    "date": "2025-07-22",
    "actor": "Donald Trump",
    "category": "Policy",
    "title": "Trump\\'s plan to accept luxury jet from Qatar sparks controversy",
    "description": "President Trump\\'s intention to accept a $400 million luxury jet from Qatar to serve as Air Force One has sparked bipartisan criticism, with opponents labeling it as a \\'bribe\\' and \\'corruption\\'. The deal is seen as a quid pro quo and raises questions about the transactional nature of his presidency.",
    "source_url": "https://www.theguardian.com/us-news/2025/may/11/trump-qatar-luxury-jet-controversy",
    "verified": true,
    "severity": "high",
    "id": "mdem8wj7ebva8moy3lr",
    "added_at": "2025-07-22T14:14:33.907Z"
  },
  {
    "date": "2025-07-22",
    "actor": "Scott Kupor",
    "category": "Government Efficiency",
    "title": "Scott Kupor Aims to Institutionalize DOGE\\'s Efficiency Policies",
    "description": "Scott Kupor, the new director of the U.S. Office of Personnel Management, plans to institutionalize the operational efficiency policies initiated by Elon Musk\\'s Department of Government Efficiency (DOGE), while moving away from Musk’s more controversial tactics. Kupor emphasizes a continued push for efficiency, including major workforce reductions and a culture shift toward accountability and productivity.",
    "source_url": "https://www.ft.com/content/bc805d25-3a0a-4625-9529-5260502c9215",
    "verified": true,
    "severity": "medium",
    "id": "mdem8wowjhhnt3qmiva",
    "added_at": "2025-07-22T14:14:34.112Z"
  },
  {
    "date": "2025-07-22",
    "actor": "Scott Kupor",
    "category": "Government Efficiency",
    "title": "Scott Kupor Distances Himself from Elon Musk Amid Tensions",
    "description": "Scott Kupor, the newly appointed head of the Office of Personnel Management, emphasized his independence from Elon Musk, stating he had no personal ties and had spoken to Musk only once. Kupor\\'s statement aims to affirm his loyalty to President Donald Trump\\'s agenda amid tensions stemming from a public rift between Trump and Musk.",
    "source_url": "https://www.reuters.com/world/us/new-trump-human-resources-czar-distances-himself-elon-musk-2025-07-21/",
    "verified": true,
    "severity": "medium",
    "id": "mdem8wowu16u1vausne",
    "added_at": "2025-07-22T14:14:34.112Z"
  },
  {
    "date": "2025-07-22",
    "actor": "Trump Administration",
    "category": "Government Contracts",
    "title": "Trump Administration Seeks Alternatives to Musk\\'s SpaceX for Missile Defense",
    "description": "The Trump administration is expanding its search for partners to develop the $175 billion Golden Dome missile defense system, looking beyond Elon Musk’s SpaceX amid growing tensions between Trump and Musk. The government is actively courting Amazon\\'s Project Kuiper and traditional defense contractors such as Lockheed Martin, Northrop Grumman, and L3Harris.",
    "source_url": "https://www.reuters.com/business/aerospace-defense/trumps-golden-dome-looks-alternatives-musks-spacex-2025-07-22/",
    "verified": true,
    "severity": "high",
    "id": "mdem8wowoi058lhquab",
    "added_at": "2025-07-22T14:14:34.112Z"
  },
  {
    "date": "2025-07-22",
    "actor": "U.S. Department of Justice",
    "category": "Government Oversight",
    "title": "DOJ Seeks Meeting with Ghislaine Maxwell",
    "description": "The DOJ has reached out to Ghislaine Maxwell, requesting a meeting to discuss her association with Jeffrey Epstein. Deputy Attorney General Todd Blanche anticipates a forthcoming meeting, emphasizing the department\\'s commitment to uncovering the truth in Epstein\\'s case.",
    "source_url": "https://www.reuters.com/business/media-telecom/us-justice-dept-asks-epstein-associate-maxwell-speak-prosecutors-2025-07-22/",
    "verified": true,
    "severity": "medium",
    "id": "mdem8uvtewev6j63itt",
    "added_at": "2025-07-22T14:14:31.769Z"
  },
  {
    "date": "2025-07-22",
    "actor": "Trump Administration",
    "category": "Government Oversight",
    "title": "Release of FBI Records on Martin Luther King Jr.",
    "description": "The Trump administration released over 240,000 pages of FBI surveillance records on Martin Luther King Jr., despite opposition from King\\'s family and the Southern Christian Leadership Conference. The documents reveal extensive FBI interest in King\\'s anti-war and anti-poverty efforts prior to his 1968 assassination.",
    "source_url": "https://apnews.com/article/1a58c3f0c9ec8878e487434e0d372b81",
    "verified": true,
    "severity": "medium",
    "id": "mdem8uvt5rzyluv3gnt",
    "added_at": "2025-07-22T14:14:31.769Z"
  },
  {
    "date": "2025-07-21",
    "actor": "Trump Administration",
    "category": "Legal Proceedings",
    "title": "Trump Administration Appeals Ruling Against Executive Order Targeting Jenner & Block",
    "description": "The Trump administration filed an appeal to revive an executive order against law firm Jenner & Block, which had previously employed a prosecutor involved in the Mueller investigation into Trump\\'s 2016 campaign. The Justice Department submitted a notice of appeal to the U.S. Court of Appeals for the D.C. Circuit, following a district court’s decision that struck down the executive order. This marks the second appeal among four lawsuits filed by firms targeted by similar executive orders. The administration had earlier appealed a ruling involving law firm Perkins Coie but has not yet contested rulings in favor of WilmerHale and Susman Godfrey.",
    "source_url": "https://www.reuters.com/legal/government/trump-administration-files-appeal-revive-executive-order-against-law-firm-jenner-2025-07-21/",
    "verified": true,
    "severity": "high",
    "id": "mdem8vzujxvi3gfitvi",
    "added_at": "2025-07-22T14:14:33.210Z"
  },
  {
    "date": "2025-07-21",
    "actor": "Trump Administration",
    "category": "Legal Proceedings",
    "title": "Trump Administration Seeks to Block Reinstatement of FTC Commissioner Slaughter",
    "description": "The Trump administration appealed to the U.S. Court of Appeals for the District of Columbia Circuit to block a lower court order reinstating Democratic Federal Trade Commissioner Rebecca Slaughter. The Justice Department argues that the ruling undermines the president\\'s constitutional authority to remove federal officials. U.S. District Judge Loren AliKhan had restored Slaughter to her position, determining that the administration had unlawfully removed her, violating federal law which only permits dismissal for just cause. Slaughter and another Democratic FTC commissioner, Alvaro Bedoya, filed a lawsuit in March challenging their terminations. Bedoya has since resigned. The case marks a broader conflict over the dismissal of Democratic officials by the Trump administration, with a prior Supreme Court ruling allowing Trump to oust two Democratic members from federal labor boards while legal disputes continued. Judge AliKhan emphasized that the FTC was designed by Congress to operate independently of presidential influence.",
    "source_url": "https://www.reuters.com/legal/government/trump-administration-asks-us-appeals-court-block-order-reinstating-ftc-2025-07-21/",
    "verified": true,
    "severity": "high",
    "id": "mdem8vzu4b59dovdts3",
    "added_at": "2025-07-22T14:14:33.210Z"
  },
  {
    "date": "2025-07-17",
    "actor": "Puerto Rico Government",
    "category": "Legal Proceedings",
    "title": "Puerto Rico Bans Gender-Affirming Care for Individuals Under 21",
    "description": "Puerto Rico implemented a ban on gender-affirming care for anyone under 21 years of age. The law also bars public funding for such care and threatens doctors who violate the ban with up to 15 years in prison, a $50,000 fine, and the permanent loss of their licenses. The LGBTQ+ Federation of Puerto Rico immediately announced plans to challenge the ban in court, highlighting the ongoing legal battles over transgender rights in the United States.",
    "source_url": "https://en.wikipedia.org/wiki/2025_in_LGBTQ_rights",
    "verified": false,
    "severity": "high",
    "id": "mdem8vzugb8zz45wl",
    "added_at": "2025-07-22T14:14:33.210Z"
  },
  {
    "date": "2025-07-15",
    "actor": "SEIU Healthcare 1199 NW PAC",
    "category": "Corporate Ethics",
    "title": "Washington PAC Fined for Late Reporting of Over $430K in Expenditures",
    "description": "The Washington Public Disclosure Commission imposed a $6,000 fine on SEIU Healthcare 1199 NW PAC for failing to timely report more than $430,000 in expenditures during the 2024 election cycle, highlighting ongoing issues with campaign finance transparency.",
    "source_url": "https://www.pdc.wa.gov/news-events/news/2025/06/26/pdc-imposes-20-000-fine-for-late-reporting-of-more-than-1m-by-ballot-measure-pac",
    "verified": true,
    "severity": "medium",
    "id": "mdem8wdw5qi3yuobg9k",
    "added_at": "2025-07-22T14:14:33.716Z"
  },
  {
    "date": "2025-07-15",
    "actor": "Tennessee Campaign Finance Agency",
    "category": "Corporate Ethics",
    "title": "Investigation Sought into Secret PAC Linked to Former State Staffer",
    "description": "The Tennessee Campaign Finance Agency requested an investigation into the Faith Family Freedom Fund PAC, associated with former state staffer Cade Cothren, to determine potential criminal activity related to undisclosed political contributions.",
    "source_url": "https://www.tennesseelookout.com/2025/06/23/tennessee-campaign-finance-agency-seeks-probe-of-secret-pac/",
    "verified": false,
    "severity": "high",
    "id": "mdem8wdw0ewm6owppurq",
    "added_at": "2025-07-22T14:14:33.716Z"
  },
  {
    "date": "2025-07-15",
    "actor": "U.S. Attorney’s Office for the District of Columbia",
    "category": "Corporate Ethics",
    "title": "Enforcement of Lobbying Disclosure Act Intensifies",
    "description": "The U.S. Attorney’s Office for the District of Columbia is actively enforcing the Lobbying Disclosure Act, addressing noncompliance by lobbyists and organizations to ensure transparency in lobbying activities.",
    "source_url": "https://files.gao.gov/reports/GAO-25-107523/index.html",
    "verified": true,
    "severity": "medium",
    "id": "mdem8wdxplmg32ki00f",
    "added_at": "2025-07-22T14:14:33.717Z"
  }
]