[
  {
    "date": "2025-07-25",
    "actor": "President Donald Trump",
    "category": "Policy",
    "title": "Trump suggests Fed may be ready to lower interest rates",
    "description": "On July 25, 2025, President Trump stated that following a meeting with Federal Reserve Chair Jerome Powell, he believed the Fed might soon be ready to lower interest rates. The meeting took place during Trump\\'s rare visit to the central bank\\'s Washington headquarters, which is undergoing renovations—a project criticized by the White House for its expenses. Although Powell emphasized that the Fed needs more data before making any rate adjustments, Trump interpreted their conversation as a signal for potential rate cuts. The Fed is expected to maintain the benchmark interest rate at its current 4.25%-4.50% range during its upcoming policy meeting. Despite past tensions, including Trump calling Powell a \\\"numbskull,\\\" the president confirmed he does not plan to dismiss him. The Fed, in turn, acknowledged Trump\\'s support for completing the renovation project. The interaction highlights ongoing White House pressure on the central bank to ease borrowing costs.",
    "source_url": "https://www.reuters.com/world/us/trump-suggests-fed-may-be-ready-lower-interest-rates-2025-07-25/",
    "verified": true,
    "severity": "medium",
    "id": "mdkccaiqpvbwsudyq2",
    "added_at": "2025-07-26T14:23:52.898Z"
  },
  {
    "date": "2025-07-24",
    "actor": "President Donald Trump",
    "category": "Policy",
    "title": "Trump to visit Fed on Thursday, ramping up pressure on Powell",
    "description": "U.S. President Donald Trump is set to visit the Federal Reserve on Thursday, a rare and controversial move that intensifies pressure on Fed Chair Jerome Powell. Trump, who originally nominated Powell but later became a vocal critic, has pushed for aggressive interest rate cuts and recently called Powell a \\\"numbskull.\\\" The visit follows allegations from the White House of mismanagement and potential fraud in the Fed\\'s renovation of historic buildings, with a projected $700 million cost overrun. The White House confirmed the visit but did not clarify if Trump will meet Powell. The trip is seen by analysts as an intimidation tactic, especially given Trump\\'s recent criticisms and demands for drastic rate cuts to 1%, far below Fed projections. Treasury Secretary Scott Bessent stated that no immediate move to replace Powell is planned, though a successor may be announced by early next year. Trump\\'s pressure campaign has reignited concerns over threats to central bank independence. Former Fed Chairs Bernanke and Yellen warned that Trump\\'s posture could cause lasting economic damage by undermining the Fed’s credibility. The Fed is expected to maintain current rates at its next meeting, with possible cuts anticipated in September.",
    "source_url": "https://www.reuters.com/world/us/trump-visit-fed-thursday-ramping-up-pressure-powell-2025-07-24/",
    "verified": true,
    "severity": "medium",
    "id": "mdkccaiq1oeduwgnkuu",
    "added_at": "2025-07-26T14:23:52.898Z"
  },
  {
    "date": "2025-07-24",
    "actor": "President Donald Trump",
    "category": "Policy",
    "title": "The Latest: Interest rates are central to Trump’s continuing feud with Fed chair Powell",
    "description": "President Donald Trump visited the Federal Reserve headquarters in Washington on Thursday, where he publicly scorned Fed chairman Jerome Powell over the costs of a long-planned, roughly $2. ... . Trump has previously indicated that Powell\\'s ...  \\\"fireable offense,\\\" Trump said, \\\"I don\\'t want to put this ... .\\\" Trump has criticized and threatened to fire ... .",
    "source_url": "https://apnews.com/article/3fd52eaf477ca409e5cef09fc16fbfc9",
    "verified": true,
    "severity": "medium",
    "id": "mdkccaiqphlvi0km54k",
    "added_at": "2025-07-26T14:23:52.898Z"
  },
  {
    "date": "2025-07-25",
    "actor": "Elon Musk\\'s Boring Company",
    "category": "Infrastructure Development",
    "title": "Boring Company Unveils Nashville Tunnel Project",
    "description": "Elon Musk\\'s Boring Company, in collaboration with Tennessee state officials, is set to unveil a new underground tunnel project in Nashville. The tunnel aims to connect downtown to the airport via Murfreesboro Pike, designed for Tesla vehicles to taxi passengers, addressing the city\\'s transportation challenges.",
    "source_url": "https://www.axios.com/local/nashville/2025/07/25/elon-musks-boring-company-to-unveil-tunnel-project-in-nashville",
    "verified": true,
    "severity": "medium",
    "id": "mdkcc9cgg5gwkui2w1m",
    "added_at": "2025-07-26T14:23:51.376Z"
  },
  {
    "date": "2025-07-25",
    "actor": "Tesla Shareholders",
    "category": "Corporate Governance",
    "title": "Shareholders Propose Investment in Elon Musk\\'s xAI",
    "description": "Tesla has received multiple shareholder proposals concerning a potential investment in xAI, an artificial intelligence startup founded by CEO Elon Musk. Despite Musk ruling out a merger, he proposed a shareholder vote on a possible investment by Tesla in the startup, which has seen significant funding activity this year.",
    "source_url": "https://www.reuters.com/business/autos-transportation/tesla-gets-multiple-shareholder-proposals-related-investment-xai-2025-07-25/",
    "verified": true,
    "severity": "low",
    "id": "mdkcc9cgmy0rcdgj4eq",
    "added_at": "2025-07-26T14:23:51.376Z"
  },
  {
    "date": "2025-07-25",
    "actor": "President Donald Trump",
    "category": "Political Support",
    "title": "Trump Expresses Support for Musk\\'s Tesla Amid Stock Decline",
    "description": "President Donald Trump publicly expressed support for Elon Musk’s Tesla via a Truth Social post, emphasizing his desire for all U.S. businesses, including Musk’s, to thrive. This comes amid Tesla stock plunging 8.2% following a disappointing quarterly report.",
    "source_url": "https://apnews.com/article/6739cb3c1777db5adf51ab8a39bfa226",
    "verified": true,
    "severity": "low",
    "id": "mdkcc9cgkmcdk2nfi9j",
    "added_at": "2025-07-26T14:23:51.376Z"
  },
  {
    "date": "2025-07-23",
    "actor": "House Oversight Committee",
    "category": "Government Oversight",
    "title": "House Committee Votes to Subpoena Epstein Files from DOJ",
    "description": "The House Oversight Committee voted 8-2 to subpoena the Department of Justice for all files related to Jeffrey Epstein\\'s sex trafficking investigation, reflecting bipartisan pressure for transparency in the case.",
    "source_url": "https://apnews.com/article/216bfdadff5877673d80c7fea09aa520",
    "verified": true,
    "severity": "medium",
    "id": "mdkccak1asc289gcm2i",
    "added_at": "2025-07-26T14:23:52.945Z"
  },
  {
    "date": "2025-07-23",
    "actor": "Ghislaine Maxwell",
    "category": "Government Oversight",
    "title": "Ghislaine Maxwell Completes DOJ Interview on Epstein Case",
    "description": "Ghislaine Maxwell underwent a 1.5-day interview with the DOJ, addressing inquiries about 100 individuals related to the Jeffrey Epstein sex abuse case, as the investigation continues to unfold.",
    "source_url": "https://apnews.com/article/88fd99b7aff4b7b38afcb264fa26d502",
    "verified": true,
    "severity": "medium",
    "id": "mdkccak134pwt2c5dkl",
    "added_at": "2025-07-26T14:23:52.945Z"
  },
  {
    "date": "2025-07-23",
    "actor": "FBI Whistleblower",
    "category": "Government Oversight",
    "title": "FBI Whistleblower Alleges Retaliation Over January 6 Cases",
    "description": "An FBI whistleblower filed a class-action lawsuit against the DOJ, alleging retaliation for their involvement in investigating January 6 cases, highlighting concerns over political interference within the bureau.",
    "source_url": "https://www.washingtontimes.com/news/2025/feb/4/fbi-agents-file-class-action-lawsuit-justice-dept-/",
    "verified": false,
    "severity": "high",
    "id": "mdkccak19hgo1lzsr6e",
    "added_at": "2025-07-26T14:23:52.945Z"
  },
  {
    "date": "2025-07-25",
    "actor": "Department of Education",
    "category": "Budget and Operational Changes",
    "title": "Trump administration to release over $5 billion school funding that it withheld",
    "description": "The Department of Education announced the release of over $5 billion in previously withheld school funding, ending a freeze initiated on July 1 as part of a review into whether the funds aligned with White House priorities. The freeze affected over $6 billion in funding critical for various educational programs, drawing widespread criticism from educators and lawmakers. The Office of Management and Budget has completed its review, and funds will begin reaching states next week.",
    "source_url": "https://www.reuters.com/legal/government/trump-administration-release-over-5-billion-school-funding-that-it-withheld-2025-07-25/",
    "verified": true,
    "severity": "medium",
    "id": "mdkccdsc9hs8y4koni",
    "added_at": "2025-07-26T14:23:57.132Z"
  },
  {
    "date": "2025-07-25",
    "actor": "Department of Education",
    "category": "Policy Implementation Changes",
    "title": "Trump administration to release billions in frozen education funds",
    "description": "The Trump administration announced the release of more than $5 billion in previously frozen federal education funds, following bipartisan pressure, including public appeals from Republican senators. The funds, part of nearly $7 billion approved by Congress, were reviewed by the White House Office of Management and Budget, which approved the release of funds related to various educational programs. Education Secretary Linda McMahon attributed the delays to the transition between administrations and the extended review process.",
    "source_url": "https://www.axios.com/2025/07/25/education-funds-released-trump-admin",
    "verified": true,
    "severity": "medium",
    "id": "mdkccdscz6lu13nl12p",
    "added_at": "2025-07-26T14:23:57.132Z"
  },
  {
    "date": "2025-07-25",
    "actor": "Department of Education",
    "category": "Policy Implementation Changes",
    "title": "Education Department says it will release billions in remaining withheld grant money for schools",
    "description": "The U.S. Education Department announced it will release billions in previously withheld federal school grants, ending a freeze initiated by the Trump administration on July 1 as part of a review into whether the funds aligned with White House priorities. The freeze affected over $6 billion in funding critical for various educational programs, drawing widespread criticism from educators and lawmakers. The Office of Management and Budget has completed its review, and funds will begin reaching states next week.",
    "source_url": "https://apnews.com/article/f9ac79dd44595fc9d8a3c72609cb5574",
    "verified": true,
    "severity": "medium",
    "id": "mdkccdsc8ec419twd1",
    "added_at": "2025-07-26T14:23:57.132Z"
  },
  {
    "date": "2025-07-25",
    "actor": "U.S. Supreme Court",
    "category": "Legal Proceedings",
    "title": "Supreme Court Gains Confidence Amid Power Concerns",
    "description": "A recent AP-NORC poll indicates that public confidence in the U.S. Supreme Court is on the rise, with 67% of Americans expressing at least some trust in the institution. This rebound in confidence occurs even as concerns grow about the Court wielding too much power, a sentiment that varies sharply along political lines. The Court, currently with a 6-3 conservative majority, has made several major rulings favoring conservative causes, fueling the perception of partisanship.",
    "source_url": "https://www.axios.com/2025/07/25/supreme-court-confidence-power-concerns-increase",
    "verified": true,
    "severity": "low",
    "id": "mdkcca3medq336rb5p",
    "added_at": "2025-07-26T14:23:52.354Z"
  },
  {
    "date": "2025-07-24",
    "actor": "U.S. Securities and Exchange Commission (SEC)",
    "category": "Corporate Ethics",
    "title": "SEC Withdraws Defense of Climate Disclosure Rules Amid Legal Challenges",
    "description": "The SEC voted to end its defense of the 2024 climate-related disclosure rules, marking a significant shift in the agency\\'s stance on environmental reporting requirements. This decision comes amid ongoing legal challenges and reflects a broader deregulatory trend in the current administration. The withdrawal has raised concerns among environmental advocates about the future of climate-related disclosures and their impact on corporate transparency.",
    "source_url": "https://www.pulsora.com/blog/esg-regulations-and-framework-updates-q2-2025",
    "verified": false,
    "severity": "medium",
    "id": "mdkcc92axx57abyvjim",
    "added_at": "2025-07-26T14:23:51.010Z"
  },
  {
    "date": "2025-07-23",
    "actor": "U.S. Department of Justice (DOJ)",
    "category": "Corporate Ethics",
    "title": "DOJ Resumes FCPA Enforcement with New Guidelines Amid Deregulatory Shift",
    "description": "The DOJ announced the resumption of enforcement under the Foreign Corrupt Practices Act (FCPA), signaling a return to anti-bribery enforcement after a period of reduced activity. The new guidelines focus on the \\'vindication of US interests\\' and outline specific factors for initiating investigations, including the impact on US entities and national security concerns. This move contrasts with the previous administration\\'s deregulatory approach and indicates a renewed emphasis on corporate accountability.",
    "source_url": "https://www.hsfkramer.com/insights/2025/07/corporate-governance-2025-midyear-review",
    "verified": false,
    "severity": "medium",
    "id": "mdkcc92a5hz5zmp1gp",
    "added_at": "2025-07-26T14:23:51.010Z"
  }
]