[
  {
    "date": "2025-07-18",
    "actor": "Donald Trump",
    "category": "Legal",
    "title": "Judge dismisses Trump\\'s copyright lawsuit against Bob Woodward and audiobook publisher",
    "description": "A judge dismissed Donald Trump\\'s $50 million copyright lawsuit against journalist Bob Woodward and audiobook publisher Simon & Schuster, giving Trump a month to file an amended claim. The lawsuit alleged that the publication of interviews from Woodward\\'s book \\'Rage\\' in an audiobook violated Trump\\'s rights. The dismissal was reported by CNN on July 18, 2025.",
    "source_url": "https://www.cnn.com/2025/07/18/politics/trump-copyright-lawsuit-dismissed/index.html",
    "verified": true,
    "severity": "medium",
    "id": "mdg267vqc79qvgor05",
    "added_at": "2025-07-23T14:28:08.678Z"
  },
  {
    "date": "2025-07-19",
    "actor": "Donald Trump",
    "category": "Legal",
    "title": "Trump sues Wall Street Journal and Rupert Murdoch for defamation over alleged Epstein note",
    "description": "Donald Trump filed a $10 billion defamation lawsuit against the Wall Street Journal, its publisher Dow Jones & Company, owner News Corp, Rupert Murdoch, and two journalists. The suit alleges that a 2003 lewd note written by Trump, included in a birthday album for Jeffrey Epstein, was fabricated. The lawsuit was reported by The Washington Post on July 19, 2025.",
    "source_url": "https://www.washingtonpost.com/politics/2025/07/19/trump-sues-wall-street-journal-rupert-murdoch-defamation-epstein-note/",
    "verified": true,
    "severity": "high",
    "id": "mdg267vqnigysae1rrg",
    "added_at": "2025-07-23T14:28:08.678Z"
  },
  {
    "date": "2025-07-21",
    "actor": "Donald Trump",
    "category": "Policy",
    "title": "Trump\\'s Middle East trip marked by potential private business conflicts",
    "description": "President Trump\\'s Middle East trip has raised concerns about potential private business conflicts, particularly involving his family\\'s cryptocurrency venture, World Liberty Financial. An investment firm backed by Abu Dhabi plans to invest $2 billion into the venture, prompting questions about the intersection of Trump\\'s business interests and foreign policy. The article was published by The Washington Post on July 21, 2025.",
    "source_url": "https://www.washingtonpost.com/politics/2025/07/21/trump-mideast-business-conflicts/",
    "verified": true,
    "severity": "high",
    "id": "mdg267vqjfbsnq1bibc",
    "added_at": "2025-07-23T14:28:08.678Z"
  },
  {
    "date": "2025-07-22",
    "actor": "Donald Trump",
    "category": "Financial",
    "title": "Trump\\'s memecoin dinner raises ethics concerns over foreign influence",
    "description": "A private dinner held by President Trump for major stakeholders in his memecoin cryptocurrency, $Trump, has raised ethics concerns and potential foreign influence. The dinner, attended by top investors, including those from foreign countries, has been criticized as a blatant instance of selling access to the presidency. The event was reported by The New York Times on July 22, 2025.",
    "source_url": "https://www.nytimes.com/2025/07/22/us/politics/trump-memecoin-dinner-ethics.html",
    "verified": true,
    "severity": "high",
    "id": "mdg267vqoam19tmojre",
    "added_at": "2025-07-23T14:28:08.678Z"
  },
  {
    "date": "2025-07-22",
    "actor": "U.S. House Republicans",
    "category": "Government Oversight",
    "title": "House Republicans Adjourn Early Amid Epstein Document Dispute",
    "description": "To avoid a contentious debate over Jeffrey Epstein-related government documents, Speaker Mike Johnson led House Republicans to start their five-week summer recess a day early. This decision aimed to prevent a bipartisan resolution that sought to compel the Justice Department and FBI to release all Epstein files, a move criticized by Johnson as a political ploy by Democrats.",
    "source_url": "https://www.reuters.com/world/us/epstein-files-fight-leads-us-house-republicans-start-summer-break-day-early-2025-07-22/",
    "verified": true,
    "severity": "medium",
    "id": "mdg269vhz9vvll8yzkb",
    "added_at": "2025-07-23T14:28:11.261Z"
  },
  {
    "date": "2025-07-22",
    "actor": "Attorney General Pam Bondi",
    "category": "Government Oversight",
    "title": "DOJ Removes Successor After Judges Reject Trump\\'s Pick for NJ Prosecutor",
    "description": "A panel of New Jersey federal judges declined to approve President Trump\\'s nomination of Alina Habba as the state\\'s top federal prosecutor. In response, Attorney General Pam Bondi removed Habba\\'s successor, Desiree Grace, criticizing the judges\\' decision as interference with presidential authority.",
    "source_url": "https://www.reuters.com/world/us/judges-reject-trumps-pick-top-new-jersey-federal-prosecutor-doj-removes-2025-07-22/",
    "verified": true,
    "severity": "medium",
    "id": "mdg269vhwm7pe37tjvb",
    "added_at": "2025-07-23T14:28:11.261Z"
  },
  {
    "date": "2025-07-20",
    "actor": "President Donald J. Trump",
    "category": "Policy Implementation",
    "title": "Executive Order to Close Department of Education",
    "description": "President Trump signed an executive order directing the closure of the U.S. Department of Education, aiming to return educational authority to the states. The order seeks to reduce the department\\'s size while maintaining federal student loans and Pell grants, though specifics on program transfers or eliminations remain unclear.",
    "source_url": "https://www.theregreview.org/2025/03/21/week-in-review-353/",
    "verified": false,
    "severity": "high",
    "id": "mdg265s5hmy42aapudt",
    "added_at": "2025-07-23T14:28:05.957Z"
  },
  {
    "date": "2025-07-21",
    "actor": "President Donald J. Trump",
    "category": "Policy Implementation",
    "title": "Executive Order on Transparency Regarding Foreign Influence at Universities",
    "description": "An executive order directs the Secretary of Education to actively monitor and enforce the Higher Education Act\\'s requirement for institutions to report significant foreign funding sources, enhancing transparency in academic funding.",
    "source_url": "https://www.ncsl.org/in-dc/2025-administration-actions-key-executive-orders-and-policies",
    "verified": false,
    "severity": "medium",
    "id": "mdg265s6oqxz0vneon",
    "added_at": "2025-07-23T14:28:05.958Z"
  },
  {
    "date": "2025-07-19",
    "actor": "U.S. Court of International Trade",
    "category": "Legal Proceedings",
    "title": "Court invalidates Trump\\'s \\'Liberation Day\\' tariffs",
    "description": "On May 28, 2025, the United States Court of International Trade ruled that the \\'Liberation Day\\' tariffs imposed by former President Donald Trump exceeded the authority granted under the International Emergency Economic Powers Act (IEEPA). The court found that the executive orders authorizing broad-based import tariffs were contrary to law and beyond presidential authority to regulate imports via tariffs. The ruling marked a significant judicial check on the use of emergency economic powers and reinforced the constitutional limits on executive action in trade policy.",
    "source_url": "https://en.wikipedia.org/wiki/V.O.S._Selections,_Inc._v._Trump",
    "verified": false,
    "severity": "high",
    "id": "mdg26b9ctokmdtlkbm",
    "added_at": "2025-07-23T14:28:13.056Z"
  },
  {
    "date": "2025-07-19",
    "actor": "U.S. District Judge Susan Illston",
    "category": "Legal Proceedings",
    "title": "Judge issues restraining order against Trump\\'s federal workforce reduction plan",
    "description": "On May 9, 2025, Judge Susan Illston granted a two-week restraining order against President Donald Trump\\'s plan for large-scale reductions in the federal workforce. The restraining order temporarily blocked the administration\\'s efforts to lay off employees and close programs, citing insufficient disclosure to Congress and the plaintiffs. The case, American Federation of Government Employees, AFL-CIO v. Trump, involves a coalition of labor unions, non-profit organizations, and local governments seeking to prevent the administration from instituting mass layoffs and program closures.",
    "source_url": "https://en.wikipedia.org/wiki/AFGE_v._Trump",
    "verified": false,
    "severity": "medium",
    "id": "mdg26b9c7k3nnhisuzt",
    "added_at": "2025-07-23T14:28:13.056Z"
  }
]