[
  {
    "date": "2025-07-14",
    "actor": "Donald Trump Jr. and Eric Trump",
    "category": "Financial",
    "title": "Trump Sons\\' Cryptocurrency Venture Faces Scrutiny Over Foreign Investments",
    "description": "Donald Trump Jr. and Eric Trump, sons of former President Donald Trump, are under scrutiny for their involvement in World Liberty Financial, a cryptocurrency venture that has attracted significant foreign investments. The venture has been linked to Chinese billionaire Justin Sun and an Abu Dhabi-backed investment firm, raising concerns about potential conflicts of interest and the influence of foreign capital on U.S. business operations.",
    "source_url": "https://www.nytimes.com/2025/04/29/us/politics/trump-crypto-world-liberty-financial.html",
    "verified": true,
    "severity": "medium",
    "id": "md4mk1jhu166xvxdbbp",
    "added_at": "2025-07-15T14:25:31.853Z"
  },
  {
    "date": "2025-07-14",
    "actor": "Lara Trump",
    "category": "Media",
    "title": "Lara Trump Hosts New Fox News Show Amid Ethical Concerns",
    "description": "Lara Trump, daughter-in-law of former President Donald Trump, has launched a new opinion show on Fox News titled \\'My View with Lara Trump.\\' The show has received mixed reactions, with critics raising concerns about potential conflicts of interest due to her familial ties to the sitting president and the blurring of lines between journalism and political influence.",
    "source_url": "https://www.newyorker.com/news/our-columnists/fox-news-lara-trump",
    "verified": false,
    "severity": "medium",
    "id": "md4mk1jhj4p36fhiogh",
    "added_at": "2025-07-15T14:25:31.853Z"
  },
  {
    "date": "2025-07-10",
    "actor": "U.S. District Court for the District of New Hampshire",
    "category": "Legal Proceedings",
    "title": "Federal Judge Halts Trump\\'s Birthright Citizenship Order Nationwide",
    "description": "A federal judge in New Hampshire issued a nationwide injunction blocking President Trump\\'s executive order on birthright citizenship. Judge Joseph LaPlante\\'s decision marks a significant legal setback for the policy, which sought to restrict birthright citizenship for children born to non-citizens in the U.S.",
    "source_url": "https://daily-miner.com/supreme-court-june-2025-key-rulings-gender-health/",
    "verified": false,
    "severity": "high",
    "id": "md4mk2eh8hudondbny8",
    "added_at": "2025-07-15T14:25:32.969Z"
  }
]